{
  "Aloo panchporan (Stir-fried potatoes tempered with five spices)": {
    "ingredients": [
      "1-2 tbsp vegetable oil",
      "1kg/2lb potatoes, peeled and diced into 1cm/½in cubes",
      "½ tsp dried turmeric",
      "½ tsp red chilli powder",
      "salt",
      "1 tbsp cumin seeds",
      "1 tbsp fennel seeds",
      "1 tbsp fenugreek seeds",
      "1 tbsp nigella seeds",
      "1 tbsp black mustard seeds",
      "1 tsp vegetable oil",
      "2 tsp five spice mix (panchphoran) ",
      "1 green chilli finely chopped",
      "1 tbsp fresh coriander, chopped"
    ],
    "method": [
      "In a wide non-stick pan, heat the oil to a medium-high heat and add the potatoes.  ",
      "Sauté the potatoes until they are nearly cooked. Add the turmeric, chilli powder and salt and fry until they are cooked through.",
      "In a separate small shallow frying pan heat the oil until it begins to smoke. Mix together the five spice mix ingredients, and add two teaspoons to the hot pan. The seeds will crackle and pop, so be careful when handling the mixture. Add the green chillies and the chopped coriander and stir for a few seconds. Pour this mixture onto the cooked potatoes.  ",
      "Serve immediately."
    ],
    "url": "www_bbc_com_food_recipes_aloopanchporanstirfr_77165",
    "title": "Aloo panchporan (Stir-fried potatoes tempered with five spices)",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4-6Serves 4-6",
    "isVegetarian": true,
    "recommendations": 0,
    "image": "https://www.yummytummyaarthi.com/wp-content/uploads/2013/03/1-5.jpg"
  },

  "Alpine pizza": {
    "ingredients": [
      "500g/1lb 2oz strong plain flour, plus extra for dusting ",
      "2 tsp salt",
      "1 x 7g sachet of dried yeast",
      "320ml/11fl oz lukewarm water",
      "dried breadcrumbs or semolina, for dusting",
      "80g/3oz gruyère cheese, grated",
      "250g/9oz crème fraîche",
      "salt and freshly ground black pepper",
      "1 large red onion, thinly sliced",
      "140g/5oz salami, cut into strips ",
      "marjoram leaves, to finish"
    ],
    "method": [
      "For the pizza dough, combine the flour, salt and yeast in a large bowl. Gradually add the water, mixing well with your hands to obtain a dough. If you find the dough too sticky, simply add a little more flour. Shape into a ball, cover with a cloth and leave to rest for five minutes. ",
      "Knead the dough for about 10 minutes and split it in half. Sprinkle some flour on a clean kitchen cloth and place the pieces of dough on it. Cover with a slightly damp cloth and leave to rise for at least 30 minutes in a warm place. ",
      "Preheat the oven to 240C/475F/Gas 9. ",
      "Meanwhile, for the topping, combine the gruyère and crème fraîche in a bowl, adding some salt and pepper to taste. Set aside. ",
      "Once the dough has risen, sprinkle some flour on a clean work surface and spread one dough ball into a circle about 30cm/12in in diameter, making it as thin as possible (without tearing it), with the border slightly thicker. Repeat with the other dough ball. Sprinkle two flat baking trays with breadcrumbs or semolina and place the pizza bases on them. ",
      "Spread the crème fraîche mixture over each base. Top with the onions and salami. Bake in the hot oven for 10 minutes. Remove from the oven, sprinkle with the marjoram and serve. "
    ],
    "url": "www_bbc_com_food_recipes_alpine_pizza_32132",
    "title": "Alpine pizza",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 70
    },
    "serves": "Makes 2 large pizzasMakes 2 large pizzas",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/alpine_pizza_32132_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Aloo gobi and jeera rice": {
    "ingredients": [
      "350g/12oz basmati rice",
      "2 tbsp sunflower oil",
      "1 large onion, thinly sliced",
      "2 tsp cumin seeds",
      "1 bay leaf",
      "1 cinnamon stick",
      "3 green cardamom pods",
      "2 tbsp sunflower oil",
      "25g/1oz butter (or alternative)",
      "2 tsp cumin seeds ",
      "2 tsp ground turmeric",
      "4cm/1½in fresh root ginger, finely grated",
      "2 onions, roughly chopped",
      "2 tsp freshly chopped green bird’s-eye chillies (or to taste) ",
      "3 tbsp dried fenugreek leaves (methi) ",
      "1 cauliflower, broken into florets, leaves chopped ",
      "2 large potatoes, cut into 2cm/¾in cubes",
      "2 tsp garam masala",
      "salt and freshly ground black pepper",
      "handful fresh coriander, to garnish "
    ],
    "method": [
      "To make the jeera rice, wash and soak the rice while you prepare the spices. Place the oil in a large saucepan over a medium heat. Add the onion, cumin, bay, cinnamon and cardamom pods and gently fry for a few minutes. Drain and add the rice, then pour over 800ml/1 pint 8fl oz water. Bring to the boil, cover, reduce the heat and simmer for 15–20 minutes.",
      "Meanwhile, to make the aloo gobi, heat the oil and butter in a large heavy-based saucepan over a medium heat. Add the cumin, turmeric, ginger, onions, chillies and fenugreek and fry for a few minutes. Add the cauliflower florets and leaves, stir to coat in the spices and cook for a few minutes. Add the potatoes, stir again, cover and steam for 10–15 minutes, or until the vegetables are tender. Sprinkle over the garam masala and season to taste. Garnish with coriander before serving with the rice."
    ],
    "url": "www_bbc_com_food_recipes_aloo_gobi_and_jeera_rice_60396",
    "title": "Aloo gobi and jeera rice",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aloo_gobi_and_jeera_rice_60396_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Amaretti biscuits": {
    "ingredients": [
      "4 eggs, whites only (160g/6oz)",
      "340g/12oz caster sugar",
      "340g/12oz ground almonds",
      "30ml/1fl oz amaretto liquor",
      "butter, for greasing"
    ],
    "method": [
      "Preheat the oven to 170C/325F/Gas 3.",
      "In a large bowl beat the egg whites until firm.  ",
      "Mix the sugar and the almonds gently into it.  ",
      "Add the amaretto liquor and fold in gently until you have a smooth paste.",
      "Place some baking paper on a baking tray and lightly brush with butter.   ",
      "Using a teaspoon place small heaps of the mixture approximately 2cm/¾in apart, as they will expand whilst cooking.  ",
      "Bake for approximately 15 minutes until golden brown. Leave to cool slightly then serve or store in an air-tight container."
    ],
    "url": "www_bbc_com_food_recipes_amarettibistcuits_67183",
    "title": "Amaretti biscuits",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes approximately 20 biscuitsMakes approximately 20 biscuits",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/amarettibistcuits_67183_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "Amaretti tiramisu": {
    "ingredients": [
      "200ml/7fl oz strong black coffee",
      "½ brandy miniature ",
      "6 amaretti biscuits",
      "150ml/5fl oz double cream, whipped ",
      "50g/1¾oz chocolate, grated ",
      "50g/1¾oz tinned cherries, drained, stones removed ",
      "1 tbsp cocoa powder, for dusting ",
      "250ml/9fl oz milk",
      "75g/2¾oz dark chocolate, chopped",
      "2 tbsp icing sugar ",
      "½ orange, peeled, sliced"
    ],
    "method": [
      "Place the coffee and brandy into a bowl and mix together.",
      "Dip the biscuits into the mixture, then place half of them into the base of a dessert glass.",
      "Place the whipped cream into a bowl with the grated chocolate and cherries and stir to mix.",
      "Spoon half of the cream mixture onto the biscuits, then repeat to make a second layer of biscuits followed by a final layer of cream. Dust with cocoa powder.",
      "For the chocolate sauce, heat the milk in a saucepan, add the chocolate and simmer gently until the chocolate has melted. Stir in the icing sugar.",
      "To serve, pour some of the chocolate sauce over the tiramisu and top with the orange slices."
    ],
    "url": "www_bbc_com_food_recipes_amarettitiramisu_84954",
    "title": "Amaretti tiramisu",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0,
    "image": "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/2/4/2/RX-FNM_030111-Sugar-Fix-005_s4x3.jpg.rend.hgtvcom.616.462.suffix/1371597326801.jpeg"
  },
  "Breakfast muffins": {
    "ingredients": [
      "300g/10½oz self-raising flour, sifted",
      "1 tsp baking powder",
      "pinch salt",
      "1 tsp ground cinnamon",
      "150g/5½oz light brown sugar",
      "250ml/9fl oz full-fat milk",
      "2 free-range eggs, beaten",
      "100g/3½oz butter, melted",
      "100g/3½oz toasted, skinned hazelnuts, chopped",
      "25g/1oz dried cherries",
      "25g/1oz dried cranberries",
      "75g/2½oz crunchy granola "
    ],
    "method": [
      "Preheat the oven to 180C/350F/Gas 4 and line a muffin tray with paper muffin cases.",
      "In a large bowl, sift together the flour, baking powder, salt and cinnamon and then stir in the sugar. In a separate bowl, whisk together the milk, eggs and melted butter, then pour into the dry ingredients and quickly mix together. Stir in the hazelnuts, dried cherries and dried cranberries. ",
      "Divide the batter between the 12 muffin cases and sprinkle the top of each with the granola.",
      "Bake for 20-25 minutes, or until a skewer inserted into the middle of the muffins comes out clean. Leave to cool for five minutes in the tin before serving warm or at room temperature."
    ],
    "url": "www_bbc_com_food_recipes_american-style_breakfast_66044",
    "title": "Breakfast muffins",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 12Makes 12",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/american-style_breakfast_66044_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "American-style pancakes with blueberries": {
    "ingredients": [
      "450g/1lb self-raising flour",
      "1 tsp baking powder",
      "½ tsp ground cinnamon (optional)",
      "small pinch salt ",
      "50g/1¾oz butter, melted, plus a small knob for frying",
      "600ml/20fl oz buttermilk",
      "3 large free-range eggs, separated",
      "1 tsp vanilla extract, or seeds scraped from 1 vanilla pod",
      "300g/10½oz blueberries, plus extra to serve",
      "150g/5½oz butter, softened",
      "pinch of ground cinnamon",
      "4 tbsp maple syrup"
    ],
    "method": [
      "For the pancakes, put the flour, baking powder, cinnamon, if using, and salt in a large bowl, mix and make a well in the centre. Put the buttermilk, egg yolks, melted butter and vanilla in a large bowl and whisk. In a separate, clean glass bowl, whisk the egg whites until stiff peaks form.",
      "Pour the buttermilk mixture into the well in the flour mixture and whisk. Add a large spoonful of the egg whites and fold in with a metal spoon to loosen the batter a little. Stir in the rest of the egg whites, preserving as much of the air as possible, until you have a fluffy, bubbly batter.",
      "Heat a 20cm/8in frying pan to a medium heat and rub over a little butter. Pour one and a half ladlefuls of batter into the pan. Sprinkle a large handful of blueberries over the pancake; it will rise up around them as it cooks. When the pancake has browned on the bottom and is firm enough to flip (cooked through beyond halfway), turn it over quickly and cook for another minute on the other side. Transfer to a plate. Repeat with the rest of the batter and blueberries.",
      "For the maple butter, put the butter, cinnamon and a pinch of salt into a bowl. Whisk with a hand whisk until white and fluffy. Gradually whisk in the maple syrup until it is all incorporated and has a whipped consistency."
    ],
    "url": "www_bbc_com_food_recipes_american_style_pancakes_94634",
    "title": "American-style pancakes with blueberries",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 8 x 20cm/8in pancakesMakes 8 x 20cm/8in pancakes",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/american_style_pancakes_94634_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "Anatra con melagrana (duck with pomegranate) and sautéed escarole": {
    "ingredients": [
      "4 skinless duck breasts",
      "salt and freshly ground black pepper",
      "plain flour, for dusting",
      "40g/1½oz butter",
      "4 tbsp olive oil",
      "4 pomegranates",
      "1 escarole, cleaned and leaves separated ",
      "5 tbsp olive oil",
      "3 garlic cloves, finely chopped"
    ],
    "method": [
      "Preheat the oven to 200C/400F/Gas 6.",
      "Season the duck breast with salt and freshly ground black pepper and dust with flour, shaking off any excess.",
      "Heat the butter and olive oil in a large ovenproof frying pan until the butter begins to foam. Add the duck and fry for two minutes on each side, then transfer to the oven to roast for 5-6 minutes, or until just cooked. The duck should be rare, but cook according to your preference.",
      "Meanwhile, rub two of the whole pomegranates firmly on a work surface with the palm of your hand, then cut them in half and squeeze out the juice, as you would with a lemon, all over the cooked duck.",
      "Open up the remaining pomegranates and remove the seeds. Sprinkle the pomegranate seeds over the duck.",
      "Place the duck onto a plate and drizzle with the juices and seeds from the pan. Let the duck rest for 2-3 minutes then slice on the diagonal.",
      "For the escarole, blanch the escarole leaves for a couple of minutes in boiling salted water. Drain and set aside.",
      "Heat the olive oil in a frying pan, add the garlic and fry for one minute, or until soft, then add the escarole and gently sauté for 1-2 minutes. Reduce the heat, cover with a lid and cook for 5-6 minutes, or until the escarole is tender.",
      "To serve, place the escarole onto the plate alongside the duck and spoon any remaining pan juices over."
    ],
    "url": "www_bbc_com_food_recipes_anatraconmelagranadu_84995",
    "title": "Anatra con melagrana (duck with pomegranate) and sautéed escarole",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0,
    "image": "https://assets.bonappetit.com/photos/57b03238f1c801a1038bd707/16:9/w_1000,c_limit/mare_roast_duck_breasts_with_pomegranate_chile_sauce_h.jpg"
  },
  "An authentic ragù bolognese": {
    "ingredients": [
      "450g/1lb lean minced beef",
      "450g/1lb minced pork",
      "6 tbsp extra virgin olive oil",
      "1x225g/8oz tub chicken livers",
      "2 medium onion, finely chopped",
      "4 fat garlic cloves, chopped",
      "2 x 70g packs (or 140g/5oz) pancetta or streaky bacon, finely chopped",
      "2 x 400g/14oz tins Italian chopped tomatoes",
      "2 x 200g/7oz tubes double concentrate tomato purée",
      "1 x 37.5cl half bottle red wine (or 400ml/14fl oz)",
      "2 x 15g packs or 30g/1oz fresh basil",
      "½ whole nutmeg, grated",
      "salt and freshly milled black pepper"
    ],
    "method": [
      "Preheat the oven to 140C/275F/Gas 1.",
      "First take a large frying pan, the largest you have, heat 3 tbsp of the oil and gently fry the onion and garlic over a medium heat for about 10 minutes, moving it around from time to time.",
      "While the onion is softening, chop the pancetta: the best way to do this after opening the pack is to roll the contents into a sausage shape, then using a sharp knife slice it lengthways into four, then slice the lengths across as finely as possible. After 10 minutes, add this to the pan to join the onions and garlic and continue cooking them all for another 5 minutes. ",
      "Now transfer this mixture to the casserole. Add another tbsp of oil to the pan, turn the heat up to its highest then add the minced beef and brown it, breaking it up and moving it round in the pan. When the beef is browned tip it into the casserole. Heat another tbsp of the oil and do exactly the same with the minced pork. While the pork is browning, trim the chicken livers, rinse them under cold running water, dry them thoroughly with kitchen paper and chop them minutely small. When the pork is browned, transfer it to the casserole, then heat the remaining tbsp of oil and brown the pieces of chicken liver. Add these to the casserole.",
      "Now you've finished with the frying pan, so get rid of that and place the casserole over the direct heat, give everything a good stir together, then add the contents of the tins of tomatoes, the tomato purée, red wine and a really good seasoning of salt, pepper and nutmeg.",
      "Allow this to come up to simmering point. Then strip the leaves from half the basil, chop them very finely and add them to the pot. As soon as everything is simmering, place the casserole on the centre shelf of the oven and leave it to cook slowly, without a lid, for 4 hours.  It's a good idea to have a look after 3 hours to make sure all is well, but what you should end up with is a thick, concentrated sauce with only a trace of liquid left in it, then remove it from the oven, taste to check the seasoning, strip the leaves off the remainng basil, chop them small and stir them in.",
      "Then when the sauce is absolutely cold, divide it, using scales, by spooning 225g/8oz into polythene freezer bags. Seal them leaving a little bit of air at the top to allow room for expansion. Each 225g/8oz pack, thoroughly defrosted and re-heated, will provide enough ragù for 225g/8oz pasta, which will serve 2 people."
    ],
    "url": "www_bbc_com_food_recipes_anauthenticragubolog_66229",
    "title": "An authentic ragù bolognese",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 240
    },
    "serves": "Makes 8 x 225g/8oz portionsMakes 8 x 225g/8oz portions",
    "isVegetarian": false,
    "recommendations": 0,
    "image": "https://assets.epicurious.com/photos/58a4bff7f43b8f08235e5588/master/pass/classic-ragu-bolognese-021517-2.jpg"
  },
  "Pork chops with celeriac mash and apple and ale gravy": {
    "ingredients": [
      "1 large celeriac",
      "150g/5oz butter, plus extra for the sauce",
      "salt and freshly ground black pepper",
      "1 large onion",
      "2 tbsp extra virgin olive oil",
      "3 Cox's apples, peeled",
      "425ml/¾ pint London Pride ale (or similar)",
      "4 pork chops",
      "2 tsp vegetable oil",
      "½ tsp Dijon mustard",
      "1 tbsp white wine vinegar",
      "3 tbsp extra virgin olive oil",
      "250g/9oz rocket leaves"
    ],
    "method": [
      "Peel the celeriac, chop into 2.5cm/1-inch chunks and place in a pan of cold water. Place on the hob, bring to the boil and simmer until tender, about 20 minutes. Mash the celeriac with 100g/3½oz of the butter and season with salt and freshly ground black pepper. Keep covered and warm.",
      "Meanwhile, peel, halve and thinly slice the onion lengthways into semicircles. Heat the olive oil in a heavy-bottomed frying pan and cook the onions on a medium high heat until soft and lightly coloured. ",
      "Cut the apples into quarters and cut out the cores out, then cut them again into eighths. ",
      "Remove the onions from the pan, add the remaining 50g/1½oz butter and place the apples in. Cook over a medium heat. When they are golden brown turn them over so that they are beautifully coloured on both sides. ",
      "Return the onions to the pan with the apples, raise the heat and add the ale to the pan. Adjust the seasoning and continue cooking until the apples begin to break down a little and the liquid has reduced by at least half and has thickened somewhat.",
      "With a sharp knife score the skin of the chops and season them. This will help the chop to crisp when it is cooked.",
      "Heat a griddle pan until smoking hot. Rub the pork chops with some vegetable oil (this will help prevent sticking) and place the chops on the hot griddle. Cook, turning as necessary, until the meat is cooked through (cooking time will depend on the thickness of the chops; it will be cooked when the juices run clear when pierced with a sharp knife near the bone).",
      "For the salad, make the vinaigrette. Place the mustard, vinegar and olive oil in a bowl and whisk. Season to taste.",
      "When the chops are cooked, remove from the griddle, and put covered on a plate in a warm place for five minutes. Meanwhile, whisk a knob of butter into the sauce to thicken it slightly. ",
      "To serve, divide the mash among four plates, place a chop on each dollop of mash and pour the mustard and ale sauce over it. Dress the rocket with the vinaigrette and serve on the side."
    ],
    "url": "www_bbc_com_food_recipes_amershamporkchopswit_80661",
    "title": "Pork chops with celeriac mash and apple and ale gravy",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 120
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/amershamporkchopswit_80661_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "Anardana chana (pomegranate and chickpea curry)": {
    "ingredients": [
      "200g/7oz dried chickpeas, soaked in water overnight",
      "100g/3½oz chana dal, soaked in water overnight",
      "2 tbsp sunflower oil",
      "2 onions, roughly chopped",
      "3cm/1¼in fresh root ginger, finely grated",
      "1½ tsp cumin seeds",
      "1 cinnamon stick",
      "2 black cardamoms, lightly crushed",
      "2–3 cloves",
      "1 small green chilli, finely chopped",
      "1 tsp salt",
      "1½ tbsp anardana powder (crushed pomegranate), or 1 tbsp pomegranate molasses",
      "1 tsp garam masala ",
      "50g/1¾oz pomegranate seeds, to garnish",
      "handful coriander, finely chopped, to garnish"
    ],
    "method": [
      "Drain the chickpeas and place in a saucepan. Cover with water and bring to the boil. Reduce the heat and simmer for 45 minutes, or until tender. Drain and set aside.",
      "Meanwhile, heat the oil in a heavy bottomed saucepan over a medium heat. When hot, add the onions and cook for a few minutes until starting to soften. Add the ginger, spices, chilli and salt. ",
      "Drain the chana dal and add to the pan with 400ml/14fl oz water. Bring to the boil, then simmer for 35–40 minutes, or until the dal is tender. Add a little more water if needed. ",
      "Stir in the anardana, garam masala and chickpeas, heat through and adjust the seasoning.",
      "To serve, pick out the whole spices if you wish and garnish with the coriander and pomegranate seeds. "
    ],
    "url": "www_bbc_com_food_recipes_anardana_channa_chickpea_14037",
    "title": "Anardana chana (pomegranate and chickpea curry)",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 840
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anardana_channa_chickpea_14037_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Asparagus and puff pastry cigars": {
    "ingredients": [
      "150g/5oz ready-made puff pastry",
      "flour, for dusting",
      "25g/1oz cream cheese",
      "10 asparagus spears",
      "1 free-range egg, beaten",
      "2 tbsp freshly grated parmesan (or a similar vegetarian hard cheese)"
    ],
    "method": [
      "Preheat the oven to 200C/400F/Gas 6.",
      "Roll the puff pastry out on a floured surface into an 15cmx25cm/6inx10in rectangle and spread all over with the cream cheese.",
      "Using a sharp knife, cut the pastry into 10 long, thin strips.",
      "Wrap one pastry strip in a spiral around each asparagus spear and place onto a baking tray. Lightly brush each with beaten egg then scatter over the parmesan.",
      "Bake the cigars in the oven for 15-20 minutes, or until the pastry has risen and is golden-brown."
    ],
    "url": "www_bbc_com_food_recipes_asparagus_and_puff_00402",
    "title": "Asparagus and puff pastry cigars",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 10Makes 10",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagus_and_puff_00402_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Asparagus and poached egg puff tarts with parmesan and basil": {
    "ingredients": [
      "plain flour, for dusting ",
      "500g/1lb 2oz puff pastry",
      "200g/7oz low-fat cream cheese ",
      "¼ lemon, finely grated zest only ",
      "flaked sea salt and freshly ground black pepper",
      "30 medium asparagus spears",
      "1 free-range egg, beaten, to glaze (alternatively use a little milk)",
      "6 medium free-range eggs",
      "25g/1oz parmesan, made into shavings with a potato peeler",
      "good handful small basil leaves",
      "drizzle extra virgin olive oil (optional)"
    ],
    "method": [
      "Line a large baking tray with baking parchment and set aside.",
      "Dust a little flour on a clean work surface and roll out the puff pastry to a 28x30cm/11x12in rectangle about the thickness of a £1 coin. Trim the edges so that the sides are nice and straight and neat. Cut the pastry in half down the length and then into thirds across the width to give six 10x14cm/4x5½in rectangles.",
      "Put the pastry rectangles on the baking tray, cover with cling film and refrigerate for 20 minutes (or freeze for 10 minutes) for the pastry to firm up. It is important to do this so that when the puff pastry goes into the oven the flour cooks before the butter melts ensuring a much lighter pastry.",
      "Preheat the oven to 220C/425F/Gas 7 (200C fan).  Mix the cream cheese and lemon zest together in a small bowl and season to taste with salt and pepper. Trim the asparagus so that each stem is 10cm/4in long (you can use the trimmings to make a quick soup or add to a pasta sauce).",
      "Once firm, remove the pastry from the fridge (or freezer) and use a sharp knife to mark a 1cm/½in wide border around each rectangle. Then, using a crosshatch pattern, mark the border so each pastry shape resembles a picture frame. Take a fork and prick the centre of each shape about 10 times, right through to the baking tray. Brush the border with the beaten egg (or milk), making sure that it does not go down the sides of the pastry (if this happens, wipe it away with your finger otherwise the egg will stick the layers of the pastry together and stop the pastry from rising). ",
      "Divide the lemony cream cheese between the six tarts, spreading it out with the back of the spoon and making sure that it stays inside the ‘frame’. Lay five asparagus spears in a single layer, touching each other and pointing in the same direction on each tart, and push them down slightly. ",
      "Bake the tarts in the oven for 18-20 minutes, or until the pastry has puffed up nicely and is firm and golden-brown where it has risen.",
      "About 10 minutes before the tart is ready, pour about 4cm/1½in of water into a sauté pan or a deep frying pan and bring to the boil over a high heat. Turn the heat down to bring the water to a gentle simmer. Crack an egg into a very small bowl or tea cup and then slide the egg into the water. Repeat with all of the eggs, spacing them apart. Cook them for about 3-4 minutes, or until the white is cooked but the yolk still soft. Remove with a slotted spoon onto a warm plate. ",
      "Remove the tarts from the oven and divide between six serving plates. Sit a poached egg on top of each tart and scatter over the parmesan and basil leaves. Sprinkle with a little salt and pepper and drizzle with a little olive oil, if liked, and serve."
    ],
    "url": "www_bbc_com_food_recipes_asparagus_and_poached_80127",
    "title": "Asparagus and poached egg puff tarts with parmesan and basil",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagus_and_poached_80127_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Avocado salad": {
    "ingredients": [
      "¼ red onion, thinly sliced",
      "400g tin cannellini beans, drained and rinsed",
      "1 large avocado, peeled, stoned and thickly sliced",
      "100g/3½oz cherry tomatoes, quartered ",
      "20g/¾oz fresh basil, roughly chopped",
      "¼ lemon, juice only",
      "½ tbsp extra virgin olive oil ",
      "salt and freshly ground black pepper"
    ],
    "method": [
      "Soak the onion in a small bowl of cold water for 5 minutes to remove some of the heat.",
      "Toss the cannellini beans, avocado, cherry tomatoes and basil together in a bowl.",
      "Drain the onion and pat dry with kitchen paper then mix into the salad.",
      "Drizzle over the lemon juice and oil, season with salt and pepper and serve."
    ],
    "url": "www_bbc_com_food_recipes_avocado_salad_60227",
    "title": "Avocado salad",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 30
    },
    "serves": "Serves 1Serves 1",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/avocado_salad_60227_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Avocado pasta with peas and mint": {
    "ingredients": [
      "375g/13oz pasta",
      "1 large avocado (or 2 small) ",
      "2 garlic cloves",
      "2 tbsp coconut oil, melted",
      "½ tsp salt ",
      "1 lemon, juice and zest ",
      "6 fresh mint leaves",
      "150g/5½oz fresh peas (or frozen and defrosted) ",
      "1 large red chilli (optional) "
    ],
    "method": [
      "Cook the pasta according to the packet instructions. Drain and set aside. ",
      "Destone the avocado, then put the avocado flesh, garlic, coconut oil, salt, lemon juice, zest and mint leaves into a blender with 4 tablespoons of water. (Alternatively, you can put everything in a bowl or pan and use a stick blender.)",
      "Blend until you get a smooth paste. If you find the mixture is struggling to move, add another tablespoon of water and try again. Put the pasta into a serving bowl and pour over the sauce. Add the peas and mix until all the pasta is coated in green goodness. ",
      "For a little kick, I like to take a red chilli and grate it over the top. This is optional, but worth doing if you like chilli!"
    ],
    "url": "www_bbc_com_food_recipes_avocado_pasta_with_peas_31700",
    "title": "Avocado pasta with peas and mint",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/avocado_pasta_with_peas_31700_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Simple baba ganoush": {
    "ingredients": [
      "2 aubergine, peeled and chopped",
      "6 tbsp olive oil",
      "½ red onion, finely chopped",
      "2 garlic cloves, crushed",
      "1 large bunch fresh basil",
      "splash olive oil",
      "1 loaf ciabatta ",
      "extra olive oil, to brush"
    ],
    "method": [
      "Heat the oil in an oven-proof frying pan over a medium heat. Add the aubergine and onion and fry for fifteen minutes to soften. Add the garlic and fry for two minutes",
      "Meanwhile, heat a griddle pan. Brush the ciabatta with oil and grill the bread on each side for 1-2 minutes, or until brown stripes appear.",
      "Place the aubergine mixture into a food processor with the basil and a splash of oil. Blend to a rough paste and pour out into a bowl.",
      "Serve the aubergine mixture with the griddled bread."
    ],
    "url": "www_bbc_com_food_recipes_babaganoush_78707",
    "title": "Simple baba ganoush",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/babaganoush_78707_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Bacon and egg bites": {
    "ingredients": [
      "12 bacon medallions",
      "12 free-range eggs",
      "12 small cherry tomatoes, halved",
      "freshly ground black pepper",
      "6 slices of bread, to serve",
      "knob of butter, to spread"
    ],
    "method": [
      "Preheat the oven to 220C/200C Fan/Gas 8 and lightly grease a 12-hole muffin tin. ",
      "Put the bacon medallions between two sheets of cling film and roll out using a rolling pin. Put them into the muffin tin, creating a case shape.",
      "Crack the eggs into the centre of each bacon case, season with black pepper and top with two tomato halves.",
      "Bake in the oven for 10 minutes until the bacon is cooked and the egg just cooked on the inside. If you like your egg well done, cook for 15 minutes.",
      "Toast the bread to your liking and then butter lightly. Serve two egg bites with one piece of toast per person."
    ],
    "url": "www_bbc_com_food_recipes_bacon_and_egg_bites_26820",
    "title": "Bacon and egg bites",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_egg_bites_26820_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Bacon and white bean soup": {
    "ingredients": [
      "1 tsp olive oil",
      "2 lean smoked bacon rashers, chopped",
      "2 garlic cloves, crushed",
      "1 onion, chopped",
      "3 thyme sprigs",
      "2 x 400g cans cannellini beans, drained and rinsed",
      "850ml/1½ pints vegetable stock ",
      "2 tbsp chopped parsley",
      "freshly ground black pepper"
    ],
    "method": [
      "Heat the oil in a large saucepan over a medium heat. Add the bacon, garlic and onion and fry for 3-4 minutes, or until the bacon begins to brown and the onion softens.",
      "Add the thyme and fry for a further minute. Add the beans and stock to the pan and bring to the boil, then reduce the heat and simmer for 10 minutes.",
      "Transfer the soup to a blender or food processor and blend with the parsley and pepper until smooth.",
      "Return the soup to the pan and heat through, then ladle into 4 bowls and serve immediately."
    ],
    "url": "www_bbc_com_food_recipes_bacon_and_white_bean_06748",
    "title": "Bacon and white bean soup",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_white_bean_06748_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Bacon and cheese straws": {
    "ingredients": [
      "1 x 375g/13oz puff pastry",
      "plain flour, for dusting",
      "1 tbsp English mustard",
      "100g/3½oz mature cheddar, grated",
      "freshly ground black pepper",
      "14 slices good-quality streaky bacon",
      "1 free-range egg, lightly beaten"
    ],
    "method": [
      "Line a baking tray with greaseproof paper.",
      "Roll the pastry out on a lightly floured work surface to a large rectangle of 0.5cm/¼in thickness. ",
      "Turn the pastry so that the longest side is facing you, spread over the mustard, sprinkle with the cheese and season with freshly ground black pepper. Place the pieces of bacon onto the pastry, leaving a small gap between each piece. ",
      "Cut the pastry between each slice of bacon. Carefully twist each piece of pastry 4-5 times so it looks like a curly straw, then place on the baking tray.",
      "Repeat the process until all of the bacon has been used up. Chill the pastry twists in the fridge for 15-20 minutes.",
      "Preheat the oven to 220C/425F/Gas 7.",
      "Remove the twists from the fridge and brush with the beaten egg. ",
      "Reduce the oven to 200C/400F/Gas 6 and bake the twists for 20-25 minutes, or until the pastry is well risen and golden-brown. Remove from the oven and set aside to cool."
    ],
    "url": "www_bbc_com_food_recipes_bacon_and_mature_cheddar_58920",
    "title": "Bacon and cheese straws",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 14 cheese strawsMakes 14 cheese straws",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_mature_cheddar_58920_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Bacon and Brussels sprout salad": {
    "ingredients": [
      "1 tbsp olive oil",
      "100g/3½oz smoked bacon lardons",
      "500g/1lb 2oz Brussels sprouts, trimmed",
      "50g/1¾oz dried cranberries",
      "bag mixed leaves",
      "100ml/3½fl oz marsala or sherry ",
      "50g/1¾oz pecans, lightly toasted",
      "3 tbsp walnut oil",
      "2 tbsp sherry vinegar",
      "½ tsp honey",
      "½ tsp mustard (optional)"
    ],
    "method": [
      "Heat the olive oil in a large sauté pan. Add the bacon and cook until very crisp and the fat has rendered off. Remove with a slotted spoon and drain on kitchen paper.",
      "Thinly slice the Brussels sprouts and add to the pan. Cook on a high heat until the sprouts are starting to brown around the edges. Add 100ml/3½fl oz water and continue to cook, stirring regularly, until the water has evaporated off and the Brussels are just cooked – they should have wilted a little but still be a very fresh looking green. Keep warm.",
      "Meanwhile, put the cranberries in a small saucepan and cover with the marsala. Bring to the boil and simmer until all the liquid has been absorbed by the cranberries – they will be glossy and plump.",
      "Whisk the walnut oil and sherry vinegar together with the honey and mustard, if using. Season with salt and pepper. ",
      "To assemble the salad, arrange the leaves in a bowl or serving platter. Add the Brussels sprouts and most of the dressing and toss gently. Sprinkle over the bacon, pecans and cranberries and serve."
    ],
    "url": "www_bbc_com_food_recipes_baconbutteredbrussel_84617",
    "title": "Bacon and Brussels sprout salad",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baconbutteredbrussel_84617_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Bagels": {
    "ingredients": [
      "450g/1lb strong bread flour, plus extra for dusting",
      "2 tsp salt",
      "7g sachet fast-acting yeast",
      "2 tbsp clear honey",
      "1 tbsp vegetable oil, plus extra for greasing",
      "3 tbsp black treacle or molasses",
      "fine polenta, for sprinkling",
      "1 free-range egg, beaten",
      "sesame seeds, sea salt, poppy seeds, or a savoury topping of your choice (optional)"
    ],
    "method": [
      "Sift the flour and salt into a large mixing bowl, then add the yeast and mix well.",
      "Measure 250ml/9fl oz warm water in a measuring jug and then stir in the honey and oil.",
      "Make a well in the centre of the flour and pour the liquid in gradually, bringing the dough together with your hands.",
      "Turn the dough out onto a clean, dry and floured work surface. Start kneading the dough, stretching it away with the palm of one hand and folding it back again with the other. Knead for approximately 10 minutes, adding more flour if the dough becomes too sticky. Continue kneading until the dough is firm and elastic.",
      "Shape the dough into a large ball and place in a lightly oiled, large bowl. Turn the dough in the oil to coat. Cover with cling film or a plastic bag and put in a warm, dry place for 1–3 hours, or until the dough has doubled in size.",
      "When the dough has proved, bring a large saucepan of water to the boil and add the treacle or molasses. Cover and turn off the heat.",
      "Lightly oil two baking trays and sprinkle with polenta. Remove the dough from the bowl, then punch it down and knead it briefly. Roll it into a rough sausage shape and divide into seven equal chunks. As you work with one chunk, keep the others covered with a clean tea towel.",
      "Firmly roll out each chunk into a long, slender sausage shape. Bring the ends together, splash the ends with a tiny bit of water and squeeze them together to seal. Place on the prepared baking trays and repeat with the remaining the dough.",
      "Cover and set aside to prove for a further 10–20 minutes.",
      "Preheat the oven to 220C/425F/Gas 7.",
      "Bring the saucepan of molasses and water back to a gentle simmer. Gently drop each bagel into the water (do this in batches of no more than three at a time) and turn over after 1-2 minutes. Simmer for another 1-2 minutes, then remove the bagels from the water, and drain.",
      "Place the bagels on the prepared baking trays, spacing them widely apart. Brush the tops with the beaten egg and sprinkle with sesame seeds, sea salt, poppy seeds or a savoury topping of your choice. Bake in the oven for 15 minutes, or until golden-brown, then turn them upside down for a further ten minutes to cook the bases. Transfer to a wire rack to cool before serving."
    ],
    "url": "www_bbc_com_food_recipes_bagels_47163",
    "title": "Bagels",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 180
    },
    "serves": "Serves 7Serves 7",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bagels_47163_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  }
}
