{
  "Coq au vin": {
    "ingredients": [
      "25g/1oz butter",
      "150g/5½oz shallots, peeled but left whole",
      "5 garlic cloves, crushed ",
      "150g/5½oz streaky bacon, cut thickly ",
      "sprig of fresh thyme or a good pinch of dried",
      "350g/12½oz button mushrooms",
      "500ml/16½fl oz good red wine",
      "500ml/16½fl oz chicken stock",
      "2 tbsp balsamic vinegar",
      "1 free range chicken, cut into 8 serving pieces, on the bone but skin removed (or 6 chicken thighs)",
      "small bunch flatleaf parsley, chopped",
      "salt and crushed black pepper"
    ],
    "method": [
      "Heat a thick-bottomed casserole dish on the stove, add almost all the butter (reserving a knob of the butter) and the shallots. Cook until just browned; then stir in the garlic. Add the bacon and thyme and cook for 2-3 minutes.",
      "Add the mushrooms, turn up the heat and add the red wine, chicken stock and vinegar. Add the chicken pieces, bring the sauce to the boil and then simmer gently for about 25 minutes or until the chicken is tender and cooked through. For a thicker sauce, remove the chicken once it is cooked and keep warm. Cook the sauce over a high heat for a few minutes until the volume of liquid has reduced. Return the chicken back to the pan.",
      "Add the parsley, together with the reserved knob of butter. Season with salt and freshly ground black pepper and serve with a dressed green salad and olive oil mash or crusty bread."
    ],
    "url": "www_bbc_com_food_recipes_coqauvin_10455",
    "title": "Coq au vin",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coqauvin_10455_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Steak pasty": {
    "ingredients": [
      "225g/½lb plain flour, plus extra for dusting",
      "1 tsp baking powder",
      "½ tsp salt",
      "60g/2½oz unsalted butter",
      "1 free-range egg, yolk only",
      "60ml/2½fl oz water",
      "1 free-range egg, beaten, for glazing",
      "50g/2oz swede, finely chopped",
      "150g/5½oz potato, peeled and cut into cubes",
      "50g/2oz onion, finely chopped ",
      "100g/3½oz rib-eye steak, cut into small pieces",
      "1 tbsp chopped fresh parsley",
      "salt and freshly ground black pepper"
    ],
    "method": [
      "For the pastry, pulse the flour, baking powder, salt, butter and egg yolk in a food processor until the mixture resembles breadcrumbs. ",
      "Gradually add the water, a tablespoon at a time, mixing continuously until the mixture just comes together as a dough. (You may not need to use all the water.) Roll the dough into a ball, then wrap it in cling film and chill in the fridge for an hour. ",
      "Meanwhile, for the filling, bring a pan of salted, boiling water to the boil. Add the chopped swede and potato and cook for 4-5 minutes, until tender, then drain well, refresh in cold water and set aside.",
      "Preheat the oven to 180C/350F/Gas 4.",
      "Roll the chilled pastry out onto a clean, floured work surface. Cut a large disc from the pastry using a dinner plate as a template. Place the onions in a line down the middle of the pastry disc. Spoon the chopped steak on top, then spoon the cooked potato and swede over it. Sprinkle with the chopped parsley and season, to taste, with salt and freshly ground black pepper.",
      "Brush the edge of the pastry disc with some of the beaten egg. Draw the edges of the pastry together and crimp them with your fingers to seal so that the seal sits on top of the filling. Using a knife, make a small hole in the top of the pasty and brush all over with the remaining beaten egg.",
      "Place the pasty onto a baking tray and bake in the oven for 25-30 minutes, or until golden-brown."
    ],
    "url": "www_bbc_com_food_recipes_cornishpasty_89627",
    "title": "Steak pasty",
    "time": {
      "preparation": "1-2 hours1-2 hours",
      "preparationMins": 120,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 180
    },
    "serves": "Makes 1 large pastyMakes 1 large pasty",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cornishpasty_89627_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "Chicken and mushroom casserole": {
    "ingredients": [
      "8 tbsp olive oil",
      "flour, for dusting",
      "400g /14oz chicken thighs, skinned and boned",
      "150g /5½oz small onions, peeled",
      "1 carrot, very finely chopped",
      "1 celery stalk, very finely chopped",
      "300g/10½oz button mushrooms, halved",
      "200ml/7fl oz dry white wine ",
      "500ml/18fl oz chicken stock",
      "freshly grated nutmeg, to taste",
      "3 free range egg yolks, beaten with 4 tsp of milk",
      "1 tbsp finely chopped fresh parsley"
    ],
    "method": [
      "Heat six tablespoons of the olive oil in a frying pan over a medium heat. ",
      "Sprinkle some flour onto a plate. Coat the chicken thighs in the flour, shaking off any excess, and carefully place into the hot oil. Fry the chicken thighs for 4-5 minutes on each side, or until golden-brown on each side.",
      "Remove the chicken thighs from the pan and set aside on a plate lined with kitchen paper.",
      "Heat the remaining two tablespoons of olive oil in a frying pan and fry the onion, carrot, celery and mushrooms for five minutes, or until softened. ",
      "Add the wine and the stock, bring to a simmer and cook for a further 10 minutes. ",
      "Return the chicken to the pan and season to taste with salt, freshly ground black pepper and nutmeg. Continue to simmer for another 4-5 minutes, or until the chicken is cooked through",
      "Just before serving, stir in the egg yolk mixture until smooth and sprinkle over the parsley."
    ],
    "url": "www_bbc_com_food_recipes_chicken_and_mushroom_17575",
    "title": "Chicken and mushroom casserole",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_mushroom_17575_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  }, "Chicken noodle soup": {
    "ingredients": [
      "3 chicken carcasses, plus 6 chicken legs",
      "2.5 litres/4 pints 8fl oz water",
      "3 carrots, peeled, chopped",
      "2 celery stalks, trimmed, chopped",
      "1 large leek, trimmed, sliced",
      "2 large onions, peeled, chopped",
      "2 fresh bay leaves",
      "1 small bunch fresh thyme",
      "1 tsp black peppercorns",
      "1 tsp salt flakes",
      "150g/5oz rice noodles",
      "1 tbsp chopped fresh parsley",
      "1-2 tbsp chopped fresh chives, to serve"
    ],
    "method": [
      "Place the chicken carcasses and drumsticks into a large deep pan and cover with the water. Add the carrots, celery, leek and onions. ",
      "Make a bouquet garni with the bay leaves and the thyme by tying the herbs together with kitchen string. Add the bouquet garni to the pan along with the peppercorns and salt. ",
      "Cover the pan with the lid and bring the mixture to the boil, then reduce the heat until it is simmering. Simmer for about two hours, skimming off any scum that rises to the surface of the liquid from time to time. Set aside to cool slightly, then strain the stock into a smaller pan. Pick the meat from the chicken drumsticks and add it to the strained broth. ",
      "When ready to serve the broth, bring it to a gentle simmer, then add the noodles. Cook the noodles according to packet instructions until tender, then stir in the chopped parsley.",
      "Serve the chicken noodle soup in bowls with the chopped chives sprinkled over."
    ],
    "url": "www_bbc_com_food_recipes_chickennoodlesoup_93136",
    "title": "Chicken noodle soup",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 6Serves 6",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickennoodlesoup_93136_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },"Mulled cider": {
    "ingredients": [
      "4 cardamom pods, lightly crushed",
      "1 clementine, sliced into wedges, spiked with 8 cloves",
      "1 lemon, sliced into wedges, spiked with 8 cloves",
      "100ml/4fl oz whisky ",
      "100ml/4fl oz orange liqueur",
      "3 tbsp clear honey",
      "1 litre/1 pint 15¼fl oz cider ",
      "4 cinnamon stick",
      "freshly grated nutmeg, to garnish"
    ],
    "method": [
      "Heat all of the ingredients in a large saucepan over a low heat until warmed through.",
      "Pour between 4 latte glasses or other heatproof glasses.",
      "Finish with a little freshly grated nutmeg."
    ],
    "url": "www_bbc_com_food_recipes_cidertoddy_90492",
    "title": "Mulled cider",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cidertoddy_90492_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },
  "Classic sourdough": {
    "ingredients": [
      "375g/13oz strong white flour, plus extra for dusting",
      "250g/9oz sourdough starter",
      "7.5g salt",
      "130-175ml/4-6fl oz tepid water",
      "olive oil, for kneading"
    ],
    "method": [
      "Combine the flour, starter and salt in a large mixing bowl. Add the water, a little at a time, and mix with your hands to make a soft dough (you may not need all of the water).",
      "Coat a chopping board or work surface with olive oil, then tip the dough onto it and knead the dough for 10-15 minutes, or until the dough forms is smooth and elastic. ",
      "Tip the dough into a lightly oiled bowl and cover with cling film. Leave to rise in a warm place for five hours, or until at least doubled in size. ",
      "Knead the dough until it’s smooth, knocking the air out. Roll into a ball and dust with flour. ",
      "Tip the dough into a well-floured round banneton or proving basket and leave to rise for 4-8 hours.",
      "Put a tray half filled with water on the bottom oven shelf and preheat the oven to 220C/425F/Gas 7. ",
      "Gently tip the risen dough onto a lined baking tray.  Bake the loaf for 30 minutes at this heat, then reduce the heat to 200C/400F/Gas 6 and bake for a further 15-20 minutes. Cool on a cooling rack.  "
    ],
    "url": "www_bbc_com_food_recipes_classic_sourdough_21029",
    "title": "Classic sourdough",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 180
    },
    "serves": "Makes 1 loafMakes 1 loaf",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_sourdough_21029_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  }
  }
