{

  "Ten-minute pizza": {
    "ingredients": {
      "sugar": { "quantity": 1, "type": "tbsp" },
      "flour": { "quantity": 1, "type": "cup" },
      "olive oil": { "quantity": 8, "type": "tbsp" },
      "salt": { "quantity": 1, "type": "tsp" },
      "tomato paste": { "quantity": 1, "type": "can" },
      "mushrooms": { "quantity": 1, "type": "package" },
      "prosciutto": { "quantity": 4, "type": "slices" },
      "gorgonzola": { "quantity": 4, "type": "oz" },
      "egg": { "quantity": 1, "type": "egg" }
    },
    "method": [
      "Preheat the oven to 200C/400F/Gas 6.",
      "For the pizza base, place the flour, oil, water and salt into a food processor and blend together until a dough is formed. Tip out onto a floured work surface and knead. Shape into a round base about 20cm/8in wide. ",
      "Place into a frying pan over a high heat and brown the base, then using a mini-blowtorch, crisp the top of the pizza. (Alternatively you can do this under the grill.) ",
      "For the topping, spread tomato purée over the top of the base. ",
      "Fry the mushrooms in a dry frying pan then scatter over the tomato purée. Arrange the prosciutto and cheese on top. ",
      "Crack an egg into the middle, then place into the oven for five minutes to finish cooking. ",
      "Serve on a large plate, and slice into wedges to serve."
    ],
    "url": "www_bbc_com_food_recipes_10minutepizza_87314",
    "title": "Ten-minute pizza",
    "image":
      "https://upload.wikimedia.org/wikipedia/commons/a/a3/Eq_it-na_pizza-margherita_sep2005_sml.jpg",
    "time": {
      "preparationMins": 30,
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Makes 1",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["quick"],
    "cuisine" : ["italian"]
  },
  "Schichttorte": {
    "ingredients": {
      "milk": { "quantity": 1, "type": "tbsp" },
      "rum": { "quantity": 1, "type": "tbsp" },
      "sugar": { "quantity": 9, "type": "oz" },
      "chocolate": { "quantity": 3, "type": "oz" },
      "vanila": { "quantity": 1, "type": "tbsp" },
      "golden syrup": { "quantity": 1, "type": "tbsp" },
      "butter": { "quantity": 5, "type": "oz" },
      "apricot jam": { "quantity": 6, "type": "tbsp" },
      "lemon": { "quantity": 1, "type": "" },
      "egg": { "quantity": 10, "type": "egg" },
      "flour": { "quantity": 5, "type": "oz" }
    },
    "method": [
      "Whisk the egg yolks in the bowl of a freestanding mixer on a high speed for five minutes, until pale, thick and creamy.  ",
      "In a separate bowl, beat the butter and sugar together until pale and creamy. Add the lemon zest and vanilla paste and mix well. Add the whisked egg yolks and beat well. Add the flour and cornflour and mix.",
      "In a clean, grease-free bowl, whisk the egg whites until soft peaks form when the whisk is removed. Stir one-third of the egg whites into the batter to loosen the consistency. Then gently fold the remaining egg whites into the egg yolk mixture. ",
      "Preheat the grill to high.  ",
      "Grease a 20cm/8in round springform tin with oil and line the base with parchment paper.  ",
      "Spoon some of the batter into the base of the cake tin and spread evenly across the bottom. Give the tin a gentle side-to-side shake to even out the top of the batter. Place on a shelf 10cm/4in below the grill and cook for two minutes, or until light golden-brown.  ",
      "Remove from the grill, add another spoonful of batter, spread out with a pastry brush, and place under the grill for three minutes, or until dark golden-brown. Continue layering and grilling until you have 20 layers alternating in colour from light golden-brown to dark golden-brown. (Or continue until you have used all the batter.) ",
      "Remove from the grill and leave to cool in the tin for five minutes.  Carefully release from the tin and turn out onto a wire rack to cool.",
      "Melt the apricot jam in a small pan over a low heat. Pass through a fine sieve, then brush the top and sides of the cake with jam. This will help the glaze stick to the cake.",
      "For the chocolate glaze, melt the butter in a small pan with the golden syrup, rum and vanilla paste and bring to the boil. Remove from the heat, allow to cool for five minutes. Stir in the chocolate until melted. Transfer to a bowl and allow to cool to a coating consistency.  ",
      "Place a large piece of greaseproof paper under the wire rack holding the cake. Pour the glaze evenly over the cake to cover completely. Any excess glaze will be caught on the greaseproof paper and can be reused to fill in any unglazed areas of the cake.  ",
      "For the vanilla glaze, sieve the icing sugar into a bowl. Add the rum, vanilla paste and milk, stirring until completely smooth. Drizzle over the chocolate glaze. "
    ],
    "url": "www_bbc_com_food_recipes__schichttorte_49934",
    "title": "Schichttorte",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 8-10Serves 8-10",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["dessert"],
    "cuisine" : ["german"]
  },
  "Ajitsuke tamago (Japanese pickled eggs)": {
    "ingredients": {
      "egg": { "quantity": 6, "type": "egg" },
      "soy sauce": { "quantity": 4, "type": "fl-oz" },
      "mirin": { "quantity": 4, "type": "fl-oz" },
      "sake": { "quantity": 4, "type": "fl-oz" },
      "sugar": { "quantity": 6, "type": "tbsp" }
    },
    "method": [
      "Three-quarters fill a medium saucepan with water and bring to the boil. Once boiling, carefully add the eggs to the pan and boil for exactly six minutes. Use a timer as the eggs want to be just perfect with a lovely runny yolk.",
      "Once cooked, transfer to a bowl of iced-cold water and carefully peel. Be aware that the eggs are still runny and that you need to handle with care. Add the remaining ingredients, including 100ml/3½fl oz water to another saucepan, gently bring to a simmer and cook until the sugar is dissolved. Remove from the heat and leave to cool.",
      "Place the eggs in a small container that will fit neatly as you want the liquid to nearly cover the eggs. Pour in the cold marinade and place a small piece of muslin or a jay cloth over the eggs - this helps to make sure the eggs get an even coating of the marinade as the liquid will soak in to the material as well as weighing the eggs down in the liquid.        ",
      "Marinate for at least 12 hours, but ideally 24."
    ],
    "url": "www_bbc_com_food_recipes_ajitsuke_tamago_japanese_65686",
    "title": "Ajitsuke tamago (Japanese pickled eggs)",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 730
    },
    "serves": "Makes 6Makes 6",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["appetizer"],
    "cuisine" : ["japanese"]
  },
  "Ale fruit loaf": {
    "ingredients": {
      "currants": { "quantity": 2, "type": "oz" },
      "rasins": { "quantity": 5, "type": "oz" },
      "peel": { "quantity": 5, "type": "oz" },
      "beer": { "quantity": 17, "type": "fl-oz" },
      "sugar": { "quantity": 7, "type": "oz" },
      "flour": { "quantity": 6, "type": "oz" },
      "spice": { "quantity": 7, "type": "oz" },
      "egg": { "quantity": 3, "type": "egg" }
    },
    "method": [
      "Put the dried fruit into a large pan and cover with the bottled beer.",
      "Gently heat the fruit until the beer is hot, but not boiling. Remove from the heat, cover and leave overnight.",
      "When you are ready to cook the loaf, preheat the oven to 140C/275F/Gas 1.",
      "Add the sugar, flours, mixed spice and eggs to the fruit mixture. Stir well until all the ingredients are combined.",
      "Divide the mixture between two greased 500g/1Ib 2oz loaf tins. ",
      "Bake for 1¼ hours until risen, pale brown and firm to the touch.",
      "Cover with a tea towel and leave on a wire rack to cool.",
      "Wrap the loaves tightly in cling film and keep in a cool, dry place for up to 6 weeks. This loaf is delicious buttered with raspberry jam or served with a piece of Wensleydale cheese."
    ],
    "url": "www_bbc_com_food_recipes_alefruitloaf_83744",
    "title": "Ale fruit loaf",
    "image":
      "https://i.pinimg.com/originals/7f/26/d4/7f26d487f34123ebcf24b69d3a55ce82.jpg",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 840
    },
    "serves": "Makes 2 loavesMakes 2 loaves",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["cake", "dessert"],
    "cuisine" : ["american"]
  },
  "Nigel Slater's all-in-one roast beef rib": {
    "ingredients": {
      "potatoes": { "quantity": 4, "type": "lb" },
      "beef": { "quantity": 8, "type": "lb" },
      "horseradish": { "quantity": 3, "type": "tbsp" },
      "peppercons": { "quantity": 2, "type": "tbsp" },
      "salt": { "quantity": 2, "type": "tbsp" },
      "carrots": { "quantity": 8, "type": "vegetable" },
      "parsnips": { "quantity": 8, "type": "vegetable" }
    },
    "method": [
      "Preheat the oven to 220C/425F/Gas 7.",
      "Boil the peeled and sliced potatoes in a large pan of salted water until soft to the point of a knife. ",
      "Drain the potatoes and shake in a colander so that the edges fluff up.",
      "In a saucepan, melt the dripping with the horseradish, salt and pepper.",
      "Score the beef all over with a sharp knife.",
      "Layer all the chopped vegetables in a large oven tray and place the beef on top. Tip the potatoes into another tray.",
      "Ladle most of the horseradish glaze over the top of the vegetables and meat (reserving some for the potatoes). Roast the meat in the oven for 20 minutes then reduce the temperature to 160C/325F/Gas 3 and baste the meat with the dripping.",
      "Pour the remaining horseradish glaze over the potatoes and place them in the oven to cook for the duration of the beef cooking time.",
      "Roast the meat for two hours,basting it with the dripping every half hour.",
      "Allow the meat to rest under foil for 30 minutes before serving.  If necessary, you could turn up the oven to crisp the potatoes while the meat is resting."
    ],
    "url": "www_bbc_com_food_recipes_all-in-one_rib_roast_75464",
    "title": "Nigel Slater's all-in-one roast beef rib",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 6-8Serves 6-8",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-in-one_rib_roast_75464_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["meat", "roast"],
    "cuisine" : ["british"]
  },
  "All-day breakfast frittata": {
    "ingredients": {
      "bacon": { "quantity": 2, "type": "" },
      "mushrooms": { "quantity": 5, "type": "oz" },
      "spinach": { "quantity": 3, "type": "oz" },
      "potatoes": { "quantity": 8, "type": "oz" },
      "cherry tomatoes": { "quantity": 4, "type": "oz" },
      "egg": { "quantity": 4, "type": "egg" }
    },
    "method": [
      "Preheat the grill to medium-high. Grill the bacon until it is browned on both sides. Remove from the grill and set aside. ",
      "Spray a small non-stick frying pan with spray oil and place on a medium-high heat. When the pan is hot, fry the mushrooms for 5 minutes, stirring frequently, until they are browned and softened. Set aside.",
      "Rinse the spinach under cold water and drain it in a sieve. Add it to the frying pan and cook for 1-2 minutes, stirring all the time, so that the leaves steam in the residual water. When the spinach is cooked, but still bright green, transfer back to the sieve and press with the back of a spoon to squeeze any remaining water from the leaves. Set aside.",
      "Wipe the frying pan clean, spray with oil and return to a medium heat. Fry the potatoes and tomatoes without stirring too much, so that the vegetables take on some colour but don’t fall apart – about 5 minutes.",
      "Meanwhile, beat the eggs in a fairly large bowl. Chop the cooked bacon and the spinach. Add to the eggs along with the cooked mushrooms. Season the eggs with salt and freshly ground black pepper. ",
      "When the tomatoes and potatoes are golden-brown in places, spoon them into the eggs with the other vegetables. Give the egg mixture a brief stir, then pour it back into the frying pan and place it back over the heat. Cook gently over a medium heat for 10 minutes, until the egg looks set around the edges (it may be a little runny on the top). ",
      "Place the pan under the grill for 2 minutes to finish cooking the frittata on top. Turn out the frittata onto a plate and let it cool slightly before cutting into wedges. Serve with a crunchy salad for maximum veggies."
    ],
    "url": "www_bbc_com_food_recipes_all-day_breakfast_12416",
    "title": "All-day breakfast frittata",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 2Serves 2",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-day_breakfast_12416_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["breakfast"],
    "cuisine" : ["mexican"]
  },
  "15 minute pasta": {
    "ingredients": {
      "flour": { "quantity": 1, "type": "cup" },
      "olive oil": { "quantity": 8, "type": "tbsp" },
      "penne pasta": { "quantity": 1, "type": "package" },
      "Parma ham": { "quantity": 2, "type": "package" },
      "small brown chestnut mushrooms": { "quantity": 1, "type": "package" },
      "crème fraîche": { "quantity": 7, "type": "oz" },
      "Parmesan": { "quantity": 3.5, "type": "oz" },
      "parsley": { "quantity": 2, "type": "tbsp" }
    },
    "method": [
      "Cook the pasta in a pan of boiling salted water according to the packet instructions. Drain and set aside",
      "Heat a frying pan until hot. Add the pieces of Parma ham and fry until crisp, remove half of the ham onto a plate and set aside. Add the mushrooms to the pan and fry for two minutes. Add the crème fraîche and bring up to the boil. Add the pasta, Parmesan and parsley and toss together over the heat. Season well with salt and pepper.",
      "Serve with a green salad and crunchy bread."
    ],
    "url": "www_bbc_com_food_recipes_15_minute_pasta_33407",
    "title": "15 minute pasta",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/15_minute_pasta_33407_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["pasta", "quick"],
    "cuisine" : ["italian"]
  },
  "Lemon curd ice cream": {
    "ingredients": {
      "heavy cream": { "quantity": 8, "type": "oz" },
      "lemon curd": { "quantity": 12, "type": "oz" },
      "lemon": { "quantity": 1, "type": "" }
    },
    "method": [
      "Whisk the cream until floppy,  then whisk in the lemon curd along with the lemon juice and zest. ",
      "Spread in a serving dish and freeze for at least four hours."
    ],
    "url": "www_bbc_com_food_recipes_3wayswithlemoncurd_67266",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg",
    "title": "Lemon curd ice cream",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 120
    },
    "serves": "Makes 290ml/½ pintMakes 290ml/½ pint",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["dessert"],
    "cuisine": ["british"]
  },
  "Mary Berry's mulled wine": {
    "ingredients": {
      "orange": { "quantity": 1, "type": "" },
      "lemon": { "quantity": 3, "type": "" },
      "cloves": { "quantity": 12, "type": "" },
      "clementines": { "quantity": 2, "type": "" },
      "red wine": { "quantity": 2, "type": "bottles" },
      "cinnamon": { "quantity": 2, "type": "sticks" }
    },
		"method": [
			"Carefully peel the zest very thinly from the orange and lemons using a vegetable peeler. Squeeze out the juice and reserve. ",
			"Stick the cloves into the satsumas. ",
			"Pour the wine, 1.2 litres/2 pints of cold water, and the citrus peel and juices into a large, heavy-based saucepan. Add the clove-studded satsumas and cinnamon sticks. Bring the mixture just to the boil, then reduce the heat until the mixture is simmering, cover the pan with the lid, and continue to simmer for about 1 hour. Stir in the sugar gradually during cooking, until the mulled wine is sweetened to your liking (you may not need all of the sugar). ",
			"Strain the mulled wine and serve hot in cups."
		],
		"url": "www_bbc_com_food_recipes_mulled_wine_46955",
		"title": "Mary Berry's mulled wine",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": "30",
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": "60",
			"totalMins": "90"
		},
		"serves": "Serves 12Serves 12",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulled_wine_46955_16x9.jpg",
		"isVegetarian": true,
    "categories": ["alcohol"],
    "cuisine": ["american"]
	},

	"3D biscuits": {
		"ingredients": {
			"butter": { "quantity": "8", "type": "oz" },
			"caster sugar": { "quantity": "7", "type": "oz" },
			"vanilla extract": { "quantity": "1", "type": "tsp" },
			"egg": { "quantity": "1", "type": "" },
			"icing sugar": { "quantity": "9", "type": "oz" }
		},
    "method": [
      "To make the basic dough, line a baking tray with baking parchment (you may need two baking trays or, alternatively, cook the biscuits in batches).",
      "In a bowl, use a wooden spoon or a mixer to cream together the butter, sugar and vanilla essence until just creamy.  Do not over work the batter at this stage.  Beat in the egg until well combined. ",
      "Add the flour and mix on a low speed until a dough forms. In the bowl, use your hands to lightly knead the dough into a ball. Wrap it in cling film and refrigerate for least an hour.",
      "Roll out the dough on a lightly floured work surface to a depth of about 5mm, if possible use spacers to achieve an even thickness. Cut the desired shapes. For the duck biscuits: use a duck-shaped cutter and a round cutter for the base (the base should be approximately the same size as the duck). For the tree biscuits: cut two simple tree shapes out using either a cutter or a template and cut one tree shape in half vertically. For the ladybird biscuits: cut out two rounds, one slightly smaller than the other (approx. 5cm/2in and 3cm/1¼in). For the lamb biscuits: use a cutter or a template to cut out two lamb shapes for each finished biscuit and cut two additional leg shapes separately (for each finished lamb biscuit you should have two lamb shapes and two leg shapes). For the sitting down person biscuits: cut a gingerbread person out of the dough and then cut off the legs. Trim about 2mm from around the edges of the legs and cut two slots out of the bottom of the gingerbread body, about the depth of the legs (the legs will slot in here once baked). Also cut out two small ovals for feet.  ",
      "Transfer the shapes onto the baking sheet using a palate knife and chill again for about 30 minutes. (This is important to prevent the biscuits losing their shape when baked.)",
      "Preheat the oven to 180C/350F/Gas 4.",
      "Bake the biscuits for 6–10 minutes, depending on size, until lightly golden-brown at the edges. Transfer to a wire rack to cool completely.",
      "For the icing, lightly beat the egg white in a large bowl.  Add the icing sugar and mix slowly at first to avoid an icing sugar cloud. Once combined, whisk or beat for about five minutes if using an electric beater or whisk, or for longer if using a wooden spoon. Continue whisking until the ingredients form a thick, smooth paste that is bright white in colour. If you are using colours, separate the icing into various bowls and colour accordingly.",
      "To decorate the duck biscuits, thinly roll out the yellow ready-to-roll icing and cover the duck shapes. Pipe on any decoration desired for the eyes, beaks and wings. Position a wire rack over a container that will hold it at a suitable height to lean the stand up biscuit against. Use the flooding technique to ice the biscuit circles (see step 10 for more information) to represent a pond. While the icing is still wet, place the round biscuit under the edge of the wire rack. Stand the duck biscuit in position on the wet icing on the round, using the rack as support to keep it upright. Allow the icing to set completely before carefully removing the support rack.",
      "To flood ice the biscuits, pipe an outline around the edge of the biscuit using either a fine nozzle or by snipping the very end off a disposable piping bag. Let the icing set for a few minutes. For flooding the icing needs to be slightly runnier, so add a few drops of water. Pipe or spoon enough of the runnier icing into the centre of the iced shape to completely fill it – don’t worry about it being neat at this point. Use a toothpick to spread the icing evenly inside the hard icing ‘wall’. If the surface of the icing isn’t flat, gently shake the biscuit back and forth until you have a smooth covering.",
      "To decorate the tree biscuits, pipe a line of green icing all around the edge and cover the biscuits using the flooding method described in step 10. Once the icing is completely dry, use some leftover icing to pipe a zig zag along the bare edge of each half tree and attach them to the middle of the whole trees  Repeat at the back of the biscuit with the remaining tree halves. You may have to hold the half trees in place while the icing sets.",
      "To decorate the ladybird biscuits, brush the rounds with cooled boiled water and cover the larger round with a circle of pink or red ready-to-roll icing and the smaller in white ready-to-roll icing. Attach the white round to the base using a small ball of ready-to-roll icing and tilt on an angle. Finish decorating the ladybird by piping on a face and spots in black icing.",
      "To decorate the lamb biscuits, ice half the bodies of the lambs using the flooding technique in step 10 - keeping the legs free of icing. Once the icing is dry, spread an undecorated lamb biscuit with icing and sandwich to the back of the decorated biscuit. Dot some icing on the back of the individual lamb legs and stick over the whole lamb’s legs to give a 3D effect. When the icing is dry the biscuits should stand up without support. If desired, decorate the lamb’s legs with icing.",
      "To decorate the sitting down person biscuits, decorate the biscuit bodies as desired. Slot the legs sideways into the precut slots so the person is sitting down with their legs stretched out in front of them.  Attach the feet to the bottom of the legs using icing and leave to dry.  "
    ],
    "url": "www_bbc_com_food_recipes_3d_biscuits_29555",
    "title": "3D biscuits",
    "time": {
      "totalMins": "150"
    },
    "serves": "Makes about 25 medium-sized or 12 large biscuitsMakes about 25 medium-sized or 12 large biscuits",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/3d_biscuits_29555_16x9.jpg",
    "isVegetarian": true,
		"recommendations": "0",
    "categories": ["dessert"],
    "cuisine":["american"]
	},

	"Chicken chasseur with creamy mash": {
		"ingredients": {
			"chicken": { "quantity": "3", "type": "lb" },
			"flour": { "quantity": "1", "type": "tbsp" },
			"butter": { "quantity": "5", "type": "oz" },
			"bacon": { "quantity": "1", "type": "package" },
			"shallots": { "quantity": "2", "type": "" },
			"mushrooms": { "quantity": "6", "type": "oz" },
			"tomato paste": { "quantity": "1", "type": "can" },
			"white wine": { "quantity": "6", "type": "oz" },
			"chicken stock": { "quantity": "14", "type": "oz" },
			"tarragon": { "quantity": "1", "type": "bunch" },
			"tomatoes": { "quantity": "3", "type": "" },
			"parsley": { "quantity": "2", "type": "tbsp" },
			"potatoes": { "quantity": "4", "type": "" },
			"double cream": { "quantity": "4", "type": "oz" }
		},
    "method": [
      "For the chicken, season the chicken with salt and black pepper then toss in the flour to just coat.",
      "Heat a large pan until hot, add the oil, a knob of the butter and half the chicken and fry skin side down for 3-4 minutes until golden-brown.",
      "Turn and fry on the other side for another 1-2 minutes, then remove from the pan. Repeat with another knob of butter and the rest of the chicken.",
      "Add another knob of butter and the bacon and fry until golden-brown then add the shallots, mushrooms and tomato purée and fry for another couple of minutes.",
      "Add the wine and bring to a simmer, gently scraping up any cooked on bits from the bottom of the pan.",
      "Add the stock then return the chicken to the pan with half the tarragon and bring to a boil.",
      "Reduce the heat to a simmer, cover and cook for 30-40 minutes until the chicken is tender and the liquid slightly reduced.",
      "While the chicken cooks, skin and seed the tomatoes. Bring a pan of water to the boil, take out the stalk of the tomato and make a cross on the bottom.",
      "Drop the tomatoes into the water and simmer for 10-15 seconds until the skin starts to peel away.",
      "Lift straight out into a bowl of iced water and peel off the skin.",
      "Cut the tomatoes into quarters and remove the seeds then cut into small dice. Roughly chop the remaining tarragon.",
      "Add the tomatoes, flatleaf parsley and tarragon then check the seasoning.",
      "For the mash place the potatoes into a pan of salted water and bring to the boil.",
      "Reduce the heat and simmer for 12-15 minutes until the potatoes are tender.",
      "Drain and return to the pan, then place over the heat for one minute to drive off any excess moisture.",
      "Pass through a potato ricer back into the pan (or mash with a fork) then add the butter and cream, beating to form a smooth mash.",
      "Season with salt and white pepper.",
      "Serve two pieces of chicken per person with the sauce spooned over and a dollop of mash."
    ],
    "url": "www_bbc_com_food_recipes_chicken_chasseur_with_12065",
    "title": "Chicken chasseur with creamy mash",
    "time": {
      "totalMins": "90"
    },
    "serves": "Serves 4Serves 4",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_chasseur_with_12065_16x9.jpg",
    "isVegetarian": false,
		"recommendations": "0",
    "categories": ["comfort"],
    "cuisine": ["french"]
  },
  "Andalucian pork with apricots, prunes and herbs, rolled in paprika": {
		"ingredients": {
			"pork fillet": { "quantity": 1, "type": "" },
			"dried apricots": { "quantity": "1.75", "type": "oz" },
			"prunes": { "quantity": "1.75", "type": "oz" },
			"paprika": { "quantity": 2, "type": "tbsp" },
			"fresh parsley": { "quantity": 0.5, "type": "oz" },
			"oregano": { "quantity": 1, "type": "tsp" },
			"thyme": { "quantity": 1, "type": "tsp" },
			"garlic": { "quantity": 1, "type": "clove" },
			"olive oil": { "quantity": 2, "type": "tbsp" },
			"lemon": { "quantity": 1, "type": "" }
		},

		"method": [
			"Cut the pork open with a sharp knife and open the fillet out along its length, being careful not to cut all the way through the fillet.",
			"In a bowl, mix together the prunes, apricots and parsley and insert along the length of the fillet. Season well.",
			"Roll the fillet up and securely fasten with string.",
			"Mix up the paprika, the remaining herbs, the garlic, the salt and the oil to make a thick paste. Spread over the surface of the meat, and leave it in the fridge, ideally overnight.",
			"Preheat the oven to 200C/400C/Gas 6. Season the meat and sear on all sides in a heavy pan. Place in the oven for fifteen minutes.",
			"Rest the meat before serving with lemon wedges."
		],
		"url": "www_bbc_com_food_recipes_andalucianporkwithap_72080",
		"title":
			"Andalucian pork with apricots, prunes and herbs, rolled in paprika",
		"time": {
			"preparation": "overnightovernight",
			"preparationMins": 720,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 750
		},
		"serves": "Serves 2Serves 2",
		"isVegetarian": false,
		"recommendations": 0,
		"image":
			"https://i.pinimg.com/originals/0a/7a/11/0a7a11aa7855cf36fb8cc854f4748477.jpg",
		"cuisines": ["spanish"]
	},

	"Chicken in white wine sauce": {
		"ingredients": {
			"chicken breasts": { "quantity": 4, "type": "breast" },
			"onion": { "quantity": 1, "type": "medium" },
			"carrot": { "quantity": 1, "type": "carrot" },
			"celery": { "quantity": 1, "type": "stalk" },
			"bay leaf": { "quantity": 1, "type": "leaf" },
			"peppercorns": { "quantity": 6, "type": "tsp" },
			"butter": { "quantity": 1, "type": "oz" },
			"flour": { "quantity": 1, "type": "cup" },
			"white wine": { "quantity": 5, "type": "fl oz" },
			"egg": { "quantity": 1, "type": "egg" },
			"cream": { "quantity": 6, "type": "tbsp" },
			"lemon juice": { "quantity": 1, "type": "tsp" },
			"parsley ": { "quantity": 1, "type": "tbsp" }
		},
		"method": [
			"Place the chicken breasts in a pan with the vegetables and peppercorns and cover with water. ",
			"Bring gradually to the boil and simmer until the chicken is cooked all the way through - about 30 minutes. ",
			"Carefully remove the chicken breasts from the cooking liquid and keep them warm. ",
			"Strain the cooking liquid into a clean pan, discarding the cooked vegetables. Reserve about 450ml/16fl oz of the liquid.",
			"Melt the butter in a separate pan and add the flour. Cook until the mixture forms a smooth paste which leaves the sides and base of pan cleanly.",
			"Gradually add the reserved cooking liquid to the mixture, a ladle at a time, allowing to boil after each addition before beating well. Stir until the mixture blends smoothly.",
			"Pour the white wine into the sauce and reduce the heat to low. ",
			"In a small bowl, combine the egg yolk with the double cream. Stir the egg and cream into the sauce. ",
			"Add a squeeze of lemon juice and salt and freshly ground black pepper to taste.",
			"Cut the cooked chicken into bite-sized pieces and stir into the sauce. ",
			"Garnish with chopped fresh parsley and serve at once."
		],
		"url": "www_bbc_com_food_recipes_mirandaschickeninwhi_85673",
		"title": "Chicken in white wine sauce",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 4Serves 4",
		"isVegetarian": false,
		"recommendations": 0,
		"image":
			"https://www.monpetitfour.com/wp-content/uploads/2017/05/Chicken-in-White-Wine-Sauce_3-copy.jpg",
		"categories": ["chicken"],
		"cuisine": ["italian"]
	},
	"Feijoada": {
		"ingredients": {
			"dried black beans": { "quantity": 4, "type": "oz" },
			"olive oil": { "quantity": 4, "type": "tbsp" },
			"pork ribs": { "quantity": 4, "type": "oz" },
			"ribs": { "quantity": 1, "type": "rack" },
			"onion": { "quantity": 1, "type": "large" },
			"garlic": { "quantity": 1, "type": "head" },
			"bacon": { "quantity": 2, "type": "oz" },
			"pork belly": { "quantity": 2, "type": "oz" },
			"smoked pork sausage": {
				"quantity": 1,
				"type": "link"
			},

			"chilli": { "quantity": 2, "type": "tbsp" }
		},
		"method": [
			"Soak the black beans in 2 litres/3½ pints of cold water overnight.",
			"When the beans have soaked, heat half of the oil in a lidded frying pan (large enough to fit all the ribs in at once) over a medium heat. ",
			"Season the smoked and unsmoked pork ribs all over with salt and freshly ground black pepper. Fry the ribs for 4-5 minutes on each side, or until browned on both sides.",
			"Add the onion and garlic and continue to fry for a further 2-3 minutes, stirring well, until softened.",
			"Add 250ml/9fl oz water and bring it to a simmer, then cover the frying pan with the lid and cook for 18-20 minutes, topping up the pan with water as necessary if the liquid evaporates too quickly. Transfer the pan contents to a large casserole and set aside.",
			"Wipe the frying pan clean with kitchen paper, then heat the remaining oil over a medium heat. Fry the bacon, pork belly and sausage, in batches, until browned all over (do not overcrowd the pan). Transfer the browned meat to the casserole.",
			"Add the soaked black beans and the soaking liquid to the casserole and stir well. Bring the mixture to the boil, then reduce the heat until the mixture is simmering gently. Simmer, half-covered, for about 2½ hours, topping up the casserole with water every so often to prevent it from drying out. The feijoada is ready when the ribs are tender and the meat is almost falling off the bone.",
			"Just before serving, season the feijoada with salt and freshly ground black pepper, if necessary, and with chill flakes, if desired."
		],
		"url": "www_bbc_com_food_recipes_andre_and_andersons_49427",
		"title": "Feijoada",
		"time": {
			"preparation": "overnightovernight",
			"preparationMins": 720,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 840
		},
		"serves": "Serves 6-8Serves 6-8",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/andre_and_andersons_49427_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Angel food cake with lemon curd": {
		"ingredients": {
			"flour": { "quantity": 2, "type": "oz" },
			"sugar": { "quantity": 1, "type": "oz" },
			"egg": { "quantity": 11, "type": "eggs" },
			"lemons": { "quantity": 2, "type": "lemons" },
			"lemon juice": { "quantity": 1, "type": "tbsp" },
			"cream of tartar": { "quantity": 1, "type": "tsp" },
			"unsalted butter": { "quantity": 1, "type": "tbsp" },
			"passion fruit": { "quantity": 1, "type": "cup" },
			"whipping cream": { "quantity": 1, "type": "fl oz" },
			"vanilla extract": { "quantity": 0.5, "type": "tsp" }
		},
		"method": [
			"Preheat the oven to 180C/350F/Gas 4 (fan 160C) and arrange an oven shelf in the bottom third of the oven. Sift the flour and 100g/3½oz of the caster sugar together in a bowl and set aside.",
			"Whisk the egg whites in a large bowl with an electric hand whisk or mixer on a high speed for one minute until frothy. Add the lemon zest, lemon juice, cream of tartar and salt and continue whisking for 2-3 minutes, or until soft peaks form when the whisk is removed from the bowl. Increase the speed and add the remaining 200g/7oz of caster sugar, one tablespoon at a time to form firm, but not stiff peaks. ",
			"Sprinkle over one-third of the flour mixture and fold gently to combine. Repeat with the remaining two-thirds of the flour mixture folding gently to keep as much air in the mixture as possible.",
			"Transfer the batter to a 25cm/10in angel food cake pan. Gently run a knife through the centre of the batter to remove any pockets of air. Cook for 45-50 minutes, or until a skewer inserted into the centre comes out clean. ",
			"Remove from the oven and immediately turn upside down onto the tin’s cooling legs, or place over the neck of a wine bottle. Leave to cool for at least one hour. ",
			"Run a knife around the inner and outer edges of cake to remove it from the pan. Invert onto a plate. Carefully use a palette knife to separate the cake from the base of the pan. Leave to cool on a wire rack.",
			"For the lemon curd, mix the egg yolks, sugar, lemon juice and lemon zest together in a large pan. Cook over a low heat, stirring with a wooden spoon, making sure to stir the sides and base of the pan.  Cook for 5-7 minutes, or until the mixture coats the back of a spoon. Remove from the heat and stir in the butter. Pass through a sieve into a large jug. Fill two 350g/12oz glass jars with the lemon curd and seal with lids. Cover the remaining curd with cling film and leave to cool. ",
			"For the topping, whisk the cream and vanilla extract in a bowl until soft peaks form when the whisk is removed. Spoon the topping over the angel food cake and, using a palette knife, coat the top and sides of the cake, smoothing as you go.",
			"Cut the passion fruit in half and scoop out the seeds. Stir the passion fruit into the reserved, cooled lemon curd and drizzle over the angel food cake before serving. You may want to use just one of the jars of lemon curd to serve with the cake and save the other to eat separately. "
		],
		"url": "www_bbc_com_food_recipes_angel_food_cake_with_04002",
		"title": "Angel food cake with lemon curd",
		"time": {
			"preparation": "1-2 hours1-2 hours",
			"preparationMins": 120,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 180
		},
		"serves":
			"Serves 12-15, and makes two 350g/12oz jars of lemon curdServes 12-15, and makes two 350g/12oz jars of lemon curd",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/angel_food_cake_with_04002_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Swedish Christmas Glögg": {
		"ingredients": {
			"red wine": { "quantity": 1, "type": "bottle" },
			"sticks cinnamon": { "quantity": 2, "type": "stick" },
			"ginger": { "quantity": 5, "type": "g" },
			"orange peel": { "quantity": 5, "type": "g" },
			"orange": { "quantity": 1, "type": "" },
			"green cardamom": { "quantity": 7, "type": "pod" },
			"whole cloves": { "quantity": 16, "type": "clove" },
			"sugar": { "quantity": 1, "type": "tsp" },
			"almonds": { "quantity": 2, "type": "oz" },
			"raisins": { "quantity": 1.5, "type": "oz" },
			"vodka": { "quantity": 1, "type": "splash" },
			"rum": { "quantity": 1, "type": "shot" },
			"cognac": { "quantity": 1, "type": "shot" }
		},
		"method": [
			"Pour the wine into a pan, add the rest of the ingredients and heat to around 80C/176F, stirring to dissolve the sugar. ",
			"Remove from the heat and leave to infuse for at least an hour. ",
			"Strain the mixture and return the mulled wine to the bottle - use a funnel to make life easier for yourself. The wine can be kept for around a week. ",
			"To serve, pour the wine into a saucepan and heat it.",
			"Place a few flaked almonds and raisins in the bottom of your serving cups, and pour the glögg over the mixture. ",
			"If you want to give your glögg a kick, add a splash of either vodka, aquavit, rum or cognac just after you’ve reheated the wine. "
		],
		"url": "www_bbc_com_food_recipes_annikas_glgg_annikas_32356",
		"title": "Swedish Christmas Glögg",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "less than 10 minsless than 10 mins",
			"cookingMins": 10,
			"totalMins": 40
		},
		"serves": "Makes 1 bottleMakes 1 bottle",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/annikas_glgg_annikas_32356_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Angela's slow roasted ginger pork": {
		"ingredients": {
			"pork":{"quantity":3,"type":"oz"},
			"garlic":{"quantity":1,"type":"head"},
			"ginger":{"quantity":1,"type":"piece"},
			"olive oil":{"quantity":3,"type":"tbsp"},
			"white wine vinegar":{"quantity":4,"type":"tbsp"}},
		"method": [
			"Preheat the oven to 220C/425F/Gas mark 7.",
			"Place the pork skin-side up on a rack over a roasting tin. Place the garlic and ginger in a pestle and mortar or food processor and pound or process until you get a rough paste then mix in the oil and vinegar. Rub the paste all over the scored skin of the pork. Place in the preheated oven and cook for 30 minutes.",
			"Remove the pork from the oven, reduce the temperature to 150C/300F/Gas 2. Turn the pork over with the skin side down on the rack and return to the oven and cook for 4-5 hours.",
			"Remove from the oven and turn up to the highest setting 220C/425F/Gas 7. Turn the pork over to the crackling side on the rack and roast in the hot oven for the final 20 minutes to crisp up the crackling. Leave to stand for 10-15 minutes before carving.",
			"To serve, cut away the crackling with a sharp knife and break it up into pieces then carve the meat. It should be very tender and succulent."
		],
		"url": "www_bbc_com_food_recipes_angelasslowroastedgi_71381",
		"title": "Angela's slow roasted ginger pork",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 6-8Serves 6-8",
		"isVegetarian": false,
		"recommendations": 0,
		"image":
			"https://www.eatwell101.com/wp-content/uploads/2016/02/best-Slow-Cooked-Pork-Shoulder.jpg"
	},
	"Easy cookies": {
		"ingredients": {
			"unsalted butter":{"quantity":2,"type":"tbsp"},"granulated sugar":{"quantity":1,"type":"packet"},"vanilla extract":{"quantity":3,"type":"tsp"},
			"egg":{"quantity":1,"type":"large"},
			"flour":{"quantity":0.5,"type":"lb"},
			"baking powder":{"quantity":1,"type":"tsp"},
		"chocolate chips":{"quantity":4,"type":"oz"},
		"peanuts":{"quantity":4,"type":"oz"},
		"macadamia nuts":{"quantity":1,"type":"oz"},
		"ginger":{"quantity":2,"type":"oz"}
		},
		"method": [
			"In a large bowl, beat together the butter and sugar until pale, fluffy and well combined. ",
			"Beat in the vanilla extract and beaten egg, a little at a time, until well combined. ",
			"Sift the flour, baking powder and salt into the bowl and mix well until smooth and combined.",
			"Lay a large sheet of cling film (approx 30cm/12in square) onto a work surface and pour the cookie batter into the middle of it. ",
			"Bring the far edge of the cling film over the cookie batter and towards you, then use the side of a palette knife to press the batter against the length of cling film. Wrap the cling film around the dough to form a sausage shape 7–8cm/3–4in wide. Twist the ends to secure and chill in the fridge for one hour, or until firm. (NB: At this stage, the cookie dough can be frozen until needed.)",
			"Preheat the oven to 200C/180 Fan/Gas 6.",
			"When the cookie dough is firm, cut 1cm/½in slices from it and arrange them on a baking tray with enough space around each to allow for the mixture spreading.",
			"The cookies can be cooked as they are. Alternatively, sprinkle over toppings of your choice, such as chocolate chips, nuts or crystallised ginger before cooking. ",
			"Transfer the cookies to the oven and bake for 8–10 minutes, or until the edges are pale golden-brown.",
			"Set the cookies aside for 1–2 minutes, then transfer to a wire rack to cool."
		],
		"url": "www_bbc_com_food_recipes_anytimecookies_92185",
		"title": "Easy cookies",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "1 to 2 hours1 to 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Makes 30Makes 30",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anytimecookies_92185_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},
	"Paul's apple and blackberry crumble": {
		"ingredients":{
			"apples":{"quantity":2,"type":"oz"},
			"butter":{"quantity":1,"type":"tbsp"},
			"sugar":{"quantity":0.5,"type":"oz"},
			"blackberries":{"quantity":1,"type":""},
			"whole-wheat flour":{"quantity":0.5,"type":"oz"},
			"oats":{"quantity":0.5,"type":"oz"},
			"dark brown sugar":{"quantity":0.5,"type":"oz"},"unsalted butter":{"quantity":1,"type":"tbsp"},"sunflower seeds":{"quantity":1,"type":"cup"},"pumpkin seeds":{"quantity":0.5,"type":"oz"}},
		"method": [
			"Preheat the oven to 180C/350F/Gas 4. ",
			"For the filling, put the apples, butter and sugar in a pan. Cook over a medium heat for about 10 minutes, stirring from time to time, until the sugar has dissolved and the fruit is just beginning to collapse. Taste and add more sugar if required. Stir in the blackberries and transfer the mixture to an oven dish and set aside.  ",
			"To make the crumble topping, combine the flour, oats, powdered seaweed and sugar in a bowl. Add the butter and rub in lightly with your fingertips until the mix resembles coarse breadcrumbs. ",
			"Using a pestle and mortar or a small food processor, crush the seeds so they break down a little. Do not reduce them to a fine powder. Stir the crushed seeds into the crumble mixture.",
			"Spoon the crumble mixture over the filling. Bake for 35-40 minutes, or until golden-brown and bubbling. Leave to settle for about 10 minutes before serving. "
		],
		"url": "www_bbc_com_food_recipes_apple_and_blackberry_33697",
		"title": "Paul's apple and blackberry crumble",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 6Serves 6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_blackberry_33697_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
  },

  "Apple and cinnamon breakfast pot": {
		"ingredients":{
			"yogurt":{"quantity":0.5,"type":"oz"},
			"rolled oats":{"quantity":1,"type":"tbsp"},
			"apple":{"quantity":1,"type":"small"},
			"blueberries":{"quantity":1,"type":"cup"},
      "ground cinnamon":{"quantity":1,"type":"pinch"}
    },
		"method": [
			"Mix the yoghurt and oats together in a bowl, cover and refrigerate overnight. ",
			"When ready to eat, stir in the apple, blueberries, cinnamon and sweetener, if using. Serve."
		],
		"url": "www_bbc_com_food_recipes_apple_and_cinnamon_79023",
		"title": "Apple and cinnamon breakfast pot",
		"time": {
			"preparation": "overnightovernight",
			"preparationMins": 720,
			"cooking": "no cooking requiredno cooking required",
			"cookingMins": 0,
			"totalMins": 720
		},
		"serves": "Serves 1Serves 1",
		"isVegetarian": true,
		"recommendations": 0,
		"image":
			"https://www.fivehearthome.com/wp-content/uploads/2015/10/Ovenight-Slow-Cooker-Apple-Pie-Steel-Cut-Oatmeal-Breakfast-Recipe-No-Sticking-Burning-Edges-by-Five-Heart-Home_700pxZoom.jpg"
  },

	"Arancini with tomato and olive tapenade": {
		"ingredients": {
			"black olives":{"quantity":0.5,"type":"oz"},"tomatoes":{"quantity":0.5,"type":"oz"},
			"garlic":{"quantity":2,"type":"cloves"},
			"lemons":{"quantity":2,"type":""},
			"fresh parsley":{"quantity":1,"type":"tbsp"},"mayonnaise":{"quantity":0.5,"type":"oz"},
			"unsalted butter":{"quantity":2,"type":"tbsp"},"arborio rice":{"quantity":1,"type":"cup"},
			"white wine":{"quantity":1,"type":"splash"},"vegetable stock":{"quantity":1,"type":"pints"},
			"sun dried tomatoes":{"quantity":0.5,"type":"oz"},"spring onions":{"quantity":1,"type":"medium"},
			"egg":{"quantity":1,"type":"large"},
			"flour":{"quantity":1,"type":"cup"},
			"vegetable oil":{"quantity":0.75,"type":"tbsp"}
		},
		"method": [
			"For the tapenade, blend all of the ingredients except for the mayonnaise together until smooth. Stir in the mayonnaise. ",
			"For the arancini, melt the butter in a large heavy-bottomed saucepan. Add the rice and cook for 2-3 minutes on a low heat. When the rice starts to become a little translucent around the edges, add the wine and cook for another minute.",
			"Add a ladleful of warm stock and stir well. When the stock has almost been absorbed,  add another ladleful. Continue adding more stock until it has all been added and the rice is cooked. ",
			"Fold in the sun-dried tomatoes and spring onion and season with salt and freshly ground black pepper. Set aside to cool.",
			"Beat the egg in a bowl, sprinkle the flour onto a plate.",
			"Roll the rice into small balls, then dip into the beaten egg and dredge in the flour. ",
			"Half-fill a deep, heavy-based saucepan with vegetable oil and heat to 170C/325F (check using a digital thermometer). (CAUTION: Hot oil can be dangerous. Do not leave unattended).",
			"Deep-fry the arancini for 3-4 minutes, or until golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. ",
			"Serve the arancini with the tapenade. "
		],
		"url": "www_bbc_com_food_recipes_arancini_with_tomato_and_49993",
		"title": "Arancini with tomato and olive tapenade",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 6Serves 6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arancini_with_tomato_and_49993_16x9.jpg",
		"isVegetarian": true,
    "recommendations": 0,
    "Beef curry with shatkora": {
      "ingredients":  {
        "vegetable oil":{"quantity":2,"type":"tbsp"},"cinnamon":{"quantity":2,"type":"stick"},
        "bay leaves":{"quantity":4,"type":""},
        "cardamom":{"quantity":46,"type":"pods"},
        "star anise":{"quantity":1,"type":"pod"},
        "fenugreek seeds":{"quantity":0.25,"type":"tsp"},"onions":{"quantity":2,"type":"medium"},
        "garlic paste":{"quantity":1,"type":"tbsp"},
        "ginger paste":{"quantity":1,"type":"tbsp"},
        "beef chuck":{"quantity":8,"type":"oz"},
        "orange":{"quantity":1,"type":""},
        "chili powder":{"quantity":1,"type":"2 cups"},"turmeric":{"quantity":1,"type":"tsp"},
        "ground coriander":{"quantity":1,"type":"tsp"},"ground cumin":{"quantity":1,"type":"tsp"},
        "garam masala":{"quantity":1,"type":"tsp"},
        "tomato puree":{"quantity":2,"type":"tsp"},"tomatoes":{"quantity":1,"type":""},
        "coriander":{"quantity":1,"type":"tsp"},
        "basmati rice":{"quantity":1,"type":"cup"},
        "ginger":{"quantity":1,"type":"tsp"},
        "dill":{"quantity":5,"type":"sprigs"},
        "lemon":{"quantity":1,"type":""}
      },
      "method": [
        "Heat the oil in a large, heavy bottomed, non-stick saucepan. Add the whole spices (cinnamon, bay leaves, cardamom, star anise and fenugreek seeds) and heat gently, swirling in the oil to release the flavours. Add the salt.",
        "Stir in the onions, garlic and ginger pastes, continuing to stir and cook on a medium heat until the onions are soft and just starting to colour. Add the meat and brown all over in the spice and onion mixture, this will take approximately 10 minutes.",
        "Add enough water to fully cover the meat (approximately 750ml/1¼ pint). Stir and bring to the boil before reducing the heat and simmering uncovered for 30 minutes, stirring frequently. ",
        "Add a generous pinch of shatkora or orange rind slices (around 6-8 little slithers) to the pan and stir. Add the chilli powder, turmeric, coriander, cumin and garam masala. Stir in the tomato purèe. Add a little more water, cover with a lid and cook on a gentle simmer for 1½–2 hours, or until the meat is tender.  Remove the lid for the last 10 minutes to reduce and thicken the sauce.  ",
        "Finally add the tomato wedges and a handful of coriander and simmer for a few minutes before serving. Serve with rice and your choice of garnishes. "
      ],
      "url": "www_bbc_com_food_recipes_aromatic_beef_curry_with_63198",
      "title": "Beef curry with shatkora",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "over 2 hoursover 2 hours",
        "cookingMins": 120,
        "totalMins": 150
      },
      "serves": "Serves 4Serves 4",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromatic_beef_curry_with_63198_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0,
      "cuisine": ["indian"]
    }
  },
  "Aromatic beef curry": {
		"ingredients":
		{
			"ghee":{"quantity":2,"type":"oz"},
		"steak":{"quantity":1,"type":"steak"},
		"onion":{"quantity":1,"type":"medium"},
		"garlic":{"quantity":1,"type":"clove"},
		"cumin":{"quantity":1,"type":"tsp"},
		"coriander":{"quantity":1,"type":"tsp"},
		"turmeric":{"quantity":1,"type":"tsp"},
		"chili powder":{"quantity":1,"type":"tsp"},
		"ginger":{"quantity":0.5,"type":"tsp"},
		"cloves":{"quantity":3,"type":"tsp"},
		"cardamom":{"quantity":1,"type":"pod"},
		"cinnamon":{"quantity":0.5,"type":"tsp"},
		"tomatoes":{"quantity":1,"type":""},
		"yogurt":{"quantity":0.5,"type":"oz"},
		"vinegar":{"quantity":1,"type":"tbsp"},
		"sugar":{"quantity":1,"type":"pinch"}
	},
		"method": [
			"Heat a lidded frying pan over a medium heat and add the ghee or oil. Fry the meat until lightly browned on all sides, then remove from the pan with a slotted spoon, cover and set aside.",
			"Add the onion and garlic to the pan and fry over a low heat until soft. Turn the heat up slightly, add the spices and fry for 1 minute, they should start to smell aromatic, without burning.",
			"Return the beef to the pan, add the tomatoes and bring to the boil. Take the pan off the heat and stir in the yoghurt and vinegar, then season to taste with the salt and the sugar. ",
			"Return the pan to the heat, bring back to the boil and simmer, covered, for 1½ hours, or until the meat is tender."
		],
		"url": "www_bbc_com_food_recipes_aromatic_beef_curry_90850",
		"title": "Aromatic beef curry",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromatic_beef_curry_90850_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	}

}
