{
  "Ten-minute pizza": {
    "ingredients": {
      "sugar": { "quantity": 1, "type": "tbsp" },
      "flour": { "quantity": 1, "type": "cup" },
      "olive oil": { "quantity": 8, "type": "tbsp" },
      "salt": { "quantity": 1, "type": "tsp" },
      "tomato paste": { "quantity": 1, "type": "can" },
      "mushrooms": { "quantity": 1, "type": "package" },
      "prosciutto": { "quantity": 4, "type": "slices" },
      "gorgonzola": { "quantity": 4, "type": "oz" },
      "egg": { "quantity": 1, "type": "egg" }
    },
    "method": [
      "Preheat the oven to 200C/400F/Gas 6.",
      "For the pizza base, place the flour, oil, water and salt into a food processor and blend together until a dough is formed. Tip out onto a floured work surface and knead. Shape into a round base about 20cm/8in wide. ",
      "Place into a frying pan over a high heat and brown the base, then using a mini-blowtorch, crisp the top of the pizza. (Alternatively you can do this under the grill.) ",
      "For the topping, spread tomato purée over the top of the base. ",
      "Fry the mushrooms in a dry frying pan then scatter over the tomato purée. Arrange the prosciutto and cheese on top. ",
      "Crack an egg into the middle, then place into the oven for five minutes to finish cooking. ",
      "Serve on a large plate, and slice into wedges to serve."
    ],
    "url": "www_bbc_com_food_recipes_10minutepizza_87314",
    "title": "Ten-minute pizza",
    "image":
      "https://upload.wikimedia.org/wikipedia/commons/a/a3/Eq_it-na_pizza-margherita_sep2005_sml.jpg",
    "time": {
      "preparationMins": 30,
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Makes 1",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["quick"],
    "cuisine": ["italian"]
  },
  "Schichttorte": {
    "ingredients": {
      "milk": { "quantity": 1, "type": "tbsp" },
      "rum": { "quantity": 1, "type": "tbsp" },
      "sugar": { "quantity": 9, "type": "oz" },
      "chocolate": { "quantity": 3, "type": "oz" },
      "vanila": { "quantity": 1, "type": "tbsp" },
      "golden syrup": { "quantity": 1, "type": "tbsp" },
      "butter": { "quantity": 5, "type": "oz" },
      "apricot jam": { "quantity": 6, "type": "tbsp" },
      "lemon": { "quantity": 1, "type": "" },
      "egg": { "quantity": 10, "type": "egg" },
      "flour": { "quantity": 5, "type": "oz" }
    },
    "method": [
      "Whisk the egg yolks in the bowl of a freestanding mixer on a high speed for five minutes, until pale, thick and creamy.  ",
      "In a separate bowl, beat the butter and sugar together until pale and creamy. Add the lemon zest and vanilla paste and mix well. Add the whisked egg yolks and beat well. Add the flour and cornflour and mix.",
      "In a clean, grease-free bowl, whisk the egg whites until soft peaks form when the whisk is removed. Stir one-third of the egg whites into the batter to loosen the consistency. Then gently fold the remaining egg whites into the egg yolk mixture. ",
      "Preheat the grill to high.  ",
      "Grease a 20cm/8in round springform tin with oil and line the base with parchment paper.  ",
      "Spoon some of the batter into the base of the cake tin and spread evenly across the bottom. Give the tin a gentle side-to-side shake to even out the top of the batter. Place on a shelf 10cm/4in below the grill and cook for two minutes, or until light golden-brown.  ",
      "Remove from the grill, add another spoonful of batter, spread out with a pastry brush, and place under the grill for three minutes, or until dark golden-brown. Continue layering and grilling until you have 20 layers alternating in colour from light golden-brown to dark golden-brown. (Or continue until you have used all the batter.) ",
      "Remove from the grill and leave to cool in the tin for five minutes.  Carefully release from the tin and turn out onto a wire rack to cool.",
      "Melt the apricot jam in a small pan over a low heat. Pass through a fine sieve, then brush the top and sides of the cake with jam. This will help the glaze stick to the cake.",
      "For the chocolate glaze, melt the butter in a small pan with the golden syrup, rum and vanilla paste and bring to the boil. Remove from the heat, allow to cool for five minutes. Stir in the chocolate until melted. Transfer to a bowl and allow to cool to a coating consistency.  ",
      "Place a large piece of greaseproof paper under the wire rack holding the cake. Pour the glaze evenly over the cake to cover completely. Any excess glaze will be caught on the greaseproof paper and can be reused to fill in any unglazed areas of the cake.  ",
      "For the vanilla glaze, sieve the icing sugar into a bowl. Add the rum, vanilla paste and milk, stirring until completely smooth. Drizzle over the chocolate glaze. "
    ],
    "url": "www_bbc_com_food_recipes__schichttorte_49934",
    "title": "Schichttorte",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 8-10Serves 8-10",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["dessert"],
    "cuisine": ["german"]
  },
  "Ajitsuke tamago (Japanese pickled eggs)": {
    "ingredients": {
      "egg": { "quantity": 6, "type": "egg" },
      "soy sauce": { "quantity": 4, "type": "fl-oz" },
      "mirin": { "quantity": 4, "type": "fl-oz" },
      "sake": { "quantity": 4, "type": "fl-oz" },
      "sugar": { "quantity": 6, "type": "tbsp" }
    },
    "method": [
      "Three-quarters fill a medium saucepan with water and bring to the boil. Once boiling, carefully add the eggs to the pan and boil for exactly six minutes. Use a timer as the eggs want to be just perfect with a lovely runny yolk.",
      "Once cooked, transfer to a bowl of iced-cold water and carefully peel. Be aware that the eggs are still runny and that you need to handle with care. Add the remaining ingredients, including 100ml/3½fl oz water to another saucepan, gently bring to a simmer and cook until the sugar is dissolved. Remove from the heat and leave to cool.",
      "Place the eggs in a small container that will fit neatly as you want the liquid to nearly cover the eggs. Pour in the cold marinade and place a small piece of muslin or a jay cloth over the eggs - this helps to make sure the eggs get an even coating of the marinade as the liquid will soak in to the material as well as weighing the eggs down in the liquid.        ",
      "Marinate for at least 12 hours, but ideally 24."
    ],
    "url": "www_bbc_com_food_recipes_ajitsuke_tamago_japanese_65686",
    "title": "Ajitsuke tamago (Japanese pickled eggs)",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 730
    },
    "serves": "Makes 6Makes 6",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["appetizer"],
    "cuisine": ["japanese"]
  },
  "Ale fruit loaf": {
    "ingredients": {
      "currants": { "quantity": 2, "type": "oz" },
      "rasins": { "quantity": 5, "type": "oz" },
      "peel": { "quantity": 5, "type": "oz" },
      "beer": { "quantity": 17, "type": "fl-oz" },
      "sugar": { "quantity": 7, "type": "oz" },
      "flour": { "quantity": 6, "type": "oz" },
      "spice": { "quantity": 7, "type": "oz" },
      "egg": { "quantity": 3, "type": "egg" }
    },
    "method": [
      "Put the dried fruit into a large pan and cover with the bottled beer.",
      "Gently heat the fruit until the beer is hot, but not boiling. Remove from the heat, cover and leave overnight.",
      "When you are ready to cook the loaf, preheat the oven to 140C/275F/Gas 1.",
      "Add the sugar, flours, mixed spice and eggs to the fruit mixture. Stir well until all the ingredients are combined.",
      "Divide the mixture between two greased 500g/1Ib 2oz loaf tins. ",
      "Bake for 1¼ hours until risen, pale brown and firm to the touch.",
      "Cover with a tea towel and leave on a wire rack to cool.",
      "Wrap the loaves tightly in cling film and keep in a cool, dry place for up to 6 weeks. This loaf is delicious buttered with raspberry jam or served with a piece of Wensleydale cheese."
    ],
    "url": "www_bbc_com_food_recipes_alefruitloaf_83744",
    "title": "Ale fruit loaf",
    "image":
      "https://i.pinimg.com/originals/7f/26/d4/7f26d487f34123ebcf24b69d3a55ce82.jpg",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 840
    },
    "serves": "Makes 2 loavesMakes 2 loaves",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["cake", "dessert"],
    "cuisine": ["american"]
  },
  "Nigel Slater's all-in-one roast beef rib": {
    "ingredients": {
      "potatoes": { "quantity": 4, "type": "lb" },
      "beef": { "quantity": 8, "type": "lb" },
      "horseradish": { "quantity": 3, "type": "tbsp" },
      "peppercons": { "quantity": 2, "type": "tbsp" },
      "salt": { "quantity": 2, "type": "tbsp" },
      "carrots": { "quantity": 8, "type": "vegetable" },
      "parsnips": { "quantity": 8, "type": "vegetable" }
    },
    "method": [
      "Preheat the oven to 220C/425F/Gas 7.",
      "Boil the peeled and sliced potatoes in a large pan of salted water until soft to the point of a knife. ",
      "Drain the potatoes and shake in a colander so that the edges fluff up.",
      "In a saucepan, melt the dripping with the horseradish, salt and pepper.",
      "Score the beef all over with a sharp knife.",
      "Layer all the chopped vegetables in a large oven tray and place the beef on top. Tip the potatoes into another tray.",
      "Ladle most of the horseradish glaze over the top of the vegetables and meat (reserving some for the potatoes). Roast the meat in the oven for 20 minutes then reduce the temperature to 160C/325F/Gas 3 and baste the meat with the dripping.",
      "Pour the remaining horseradish glaze over the potatoes and place them in the oven to cook for the duration of the beef cooking time.",
      "Roast the meat for two hours,basting it with the dripping every half hour.",
      "Allow the meat to rest under foil for 30 minutes before serving.  If necessary, you could turn up the oven to crisp the potatoes while the meat is resting."
    ],
    "url": "www_bbc_com_food_recipes_all-in-one_rib_roast_75464",
    "title": "Nigel Slater's all-in-one roast beef rib",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 6-8Serves 6-8",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-in-one_rib_roast_75464_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["meat", "roast"],
    "cuisine": ["british"]
  },
  "All-day breakfast frittata": {
    "ingredients": {
      "bacon": { "quantity": 2, "type": "" },
      "mushrooms": { "quantity": 5, "type": "oz" },
      "spinach": { "quantity": 3, "type": "oz" },
      "potatoes": { "quantity": 8, "type": "oz" },
      "cherry tomatoes": { "quantity": 4, "type": "oz" },
      "egg": { "quantity": 4, "type": "egg" }
    },
    "method": [
      "Preheat the grill to medium-high. Grill the bacon until it is browned on both sides. Remove from the grill and set aside. ",
      "Spray a small non-stick frying pan with spray oil and place on a medium-high heat. When the pan is hot, fry the mushrooms for 5 minutes, stirring frequently, until they are browned and softened. Set aside.",
      "Rinse the spinach under cold water and drain it in a sieve. Add it to the frying pan and cook for 1-2 minutes, stirring all the time, so that the leaves steam in the residual water. When the spinach is cooked, but still bright green, transfer back to the sieve and press with the back of a spoon to squeeze any remaining water from the leaves. Set aside.",
      "Wipe the frying pan clean, spray with oil and return to a medium heat. Fry the potatoes and tomatoes without stirring too much, so that the vegetables take on some colour but don’t fall apart – about 5 minutes.",
      "Meanwhile, beat the eggs in a fairly large bowl. Chop the cooked bacon and the spinach. Add to the eggs along with the cooked mushrooms. Season the eggs with salt and freshly ground black pepper. ",
      "When the tomatoes and potatoes are golden-brown in places, spoon them into the eggs with the other vegetables. Give the egg mixture a brief stir, then pour it back into the frying pan and place it back over the heat. Cook gently over a medium heat for 10 minutes, until the egg looks set around the edges (it may be a little runny on the top). ",
      "Place the pan under the grill for 2 minutes to finish cooking the frittata on top. Turn out the frittata onto a plate and let it cool slightly before cutting into wedges. Serve with a crunchy salad for maximum veggies."
    ],
    "url": "www_bbc_com_food_recipes_all-day_breakfast_12416",
    "title": "All-day breakfast frittata",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 2Serves 2",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-day_breakfast_12416_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["breakfast"],
    "cuisine": ["mexican"]
  },
  "15 minute pasta": {
    "ingredients": {
      "flour": { "quantity": 1, "type": "cup" },
      "olive oil": { "quantity": 8, "type": "tbsp" },
      "penne pasta": { "quantity": 1, "type": "package" },
      "Parma ham": { "quantity": 2, "type": "package" },
      "small brown chestnut mushrooms": { "quantity": 1, "type": "package" },
      "crème fraîche": { "quantity": 7, "type": "oz" },
      "Parmesan": { "quantity": 3.5, "type": "oz" },
      "parsley": { "quantity": 2, "type": "tbsp" }
    },
    "method": [
      "Cook the pasta in a pan of boiling salted water according to the packet instructions. Drain and set aside",
      "Heat a frying pan until hot. Add the pieces of Parma ham and fry until crisp, remove half of the ham onto a plate and set aside. Add the mushrooms to the pan and fry for two minutes. Add the crème fraîche and bring up to the boil. Add the pasta, Parmesan and parsley and toss together over the heat. Season well with salt and pepper.",
      "Serve with a green salad and crunchy bread."
    ],
    "url": "www_bbc_com_food_recipes_15_minute_pasta_33407",
    "title": "15 minute pasta",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/15_minute_pasta_33407_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["pasta", "quick"],
    "cuisine": ["italian"]
  },
  "Lemon curd ice cream": {
    "ingredients": {
      "heavy cream": { "quantity": 8, "type": "oz" },
      "lemon curd": { "quantity": 12, "type": "oz" },
      "lemon": { "quantity": 1, "type": "" }
    },
    "method": [
      "Whisk the cream until floppy,  then whisk in the lemon curd along with the lemon juice and zest. ",
      "Spread in a serving dish and freeze for at least four hours."
    ],
    "url": "www_bbc_com_food_recipes_3wayswithlemoncurd_67266",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg",
    "title": "Lemon curd ice cream",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 120
    },
    "serves": "Makes 290ml/½ pintMakes 290ml/½ pint",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["dessert"],
    "cuisine": ["british"]
  },
  "Mary Berry's mulled wine": {
    "ingredients": {
      "orange": { "quantity": 1, "type": "" },
      "lemon": { "quantity": 3, "type": "" },
      "cloves": { "quantity": 12, "type": "" },
      "clementines": { "quantity": 2, "type": "" },
      "red wine": { "quantity": 2, "type": "bottles" },
      "cinnamon": { "quantity": 2, "type": "sticks" }
    },
    "method": [
      "Carefully peel the zest very thinly from the orange and lemons using a vegetable peeler. Squeeze out the juice and reserve. ",
      "Stick the cloves into the satsumas. ",
      "Pour the wine, 1.2 litres/2 pints of cold water, and the citrus peel and juices into a large, heavy-based saucepan. Add the clove-studded satsumas and cinnamon sticks. Bring the mixture just to the boil, then reduce the heat until the mixture is simmering, cover the pan with the lid, and continue to simmer for about 1 hour. Stir in the sugar gradually during cooking, until the mulled wine is sweetened to your liking (you may not need all of the sugar). ",
      "Strain the mulled wine and serve hot in cups."
    ],
    "url": "www_bbc_com_food_recipes_mulled_wine_46955",
    "title": "Mary Berry's mulled wine",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": "30",
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": "60",
      "totalMins": "90"
    },
    "serves": "Serves 12Serves 12",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulled_wine_46955_16x9.jpg",
    "isVegetarian": true,
    "categories": ["alcohol"],
    "cuisine": ["american"]
  },

  "3D biscuits": {
    "ingredients": {
      "butter": { "quantity": "8", "type": "oz" },
      "caster sugar": { "quantity": "7", "type": "oz" },
      "vanilla extract": { "quantity": "1", "type": "tsp" },
      "egg": { "quantity": "1", "type": "" },
      "icing sugar": { "quantity": "9", "type": "oz" }
    },
    "method": [
      "To make the basic dough, line a baking tray with baking parchment (you may need two baking trays or, alternatively, cook the biscuits in batches).",
      "In a bowl, use a wooden spoon or a mixer to cream together the butter, sugar and vanilla essence until just creamy.  Do not over work the batter at this stage.  Beat in the egg until well combined. ",
      "Add the flour and mix on a low speed until a dough forms. In the bowl, use your hands to lightly knead the dough into a ball. Wrap it in cling film and refrigerate for least an hour.",
      "Roll out the dough on a lightly floured work surface to a depth of about 5mm, if possible use spacers to achieve an even thickness. Cut the desired shapes. For the duck biscuits: use a duck-shaped cutter and a round cutter for the base (the base should be approximately the same size as the duck). For the tree biscuits: cut two simple tree shapes out using either a cutter or a template and cut one tree shape in half vertically. For the ladybird biscuits: cut out two rounds, one slightly smaller than the other (approx. 5cm/2in and 3cm/1¼in). For the lamb biscuits: use a cutter or a template to cut out two lamb shapes for each finished biscuit and cut two additional leg shapes separately (for each finished lamb biscuit you should have two lamb shapes and two leg shapes). For the sitting down person biscuits: cut a gingerbread person out of the dough and then cut off the legs. Trim about 2mm from around the edges of the legs and cut two slots out of the bottom of the gingerbread body, about the depth of the legs (the legs will slot in here once baked). Also cut out two small ovals for feet.  ",
      "Transfer the shapes onto the baking sheet using a palate knife and chill again for about 30 minutes. (This is important to prevent the biscuits losing their shape when baked.)",
      "Preheat the oven to 180C/350F/Gas 4.",
      "Bake the biscuits for 6–10 minutes, depending on size, until lightly golden-brown at the edges. Transfer to a wire rack to cool completely.",
      "For the icing, lightly beat the egg white in a large bowl.  Add the icing sugar and mix slowly at first to avoid an icing sugar cloud. Once combined, whisk or beat for about five minutes if using an electric beater or whisk, or for longer if using a wooden spoon. Continue whisking until the ingredients form a thick, smooth paste that is bright white in colour. If you are using colours, separate the icing into various bowls and colour accordingly.",
      "To decorate the duck biscuits, thinly roll out the yellow ready-to-roll icing and cover the duck shapes. Pipe on any decoration desired for the eyes, beaks and wings. Position a wire rack over a container that will hold it at a suitable height to lean the stand up biscuit against. Use the flooding technique to ice the biscuit circles (see step 10 for more information) to represent a pond. While the icing is still wet, place the round biscuit under the edge of the wire rack. Stand the duck biscuit in position on the wet icing on the round, using the rack as support to keep it upright. Allow the icing to set completely before carefully removing the support rack.",
      "To flood ice the biscuits, pipe an outline around the edge of the biscuit using either a fine nozzle or by snipping the very end off a disposable piping bag. Let the icing set for a few minutes. For flooding the icing needs to be slightly runnier, so add a few drops of water. Pipe or spoon enough of the runnier icing into the centre of the iced shape to completely fill it – don’t worry about it being neat at this point. Use a toothpick to spread the icing evenly inside the hard icing ‘wall’. If the surface of the icing isn’t flat, gently shake the biscuit back and forth until you have a smooth covering.",
      "To decorate the tree biscuits, pipe a line of green icing all around the edge and cover the biscuits using the flooding method described in step 10. Once the icing is completely dry, use some leftover icing to pipe a zig zag along the bare edge of each half tree and attach them to the middle of the whole trees  Repeat at the back of the biscuit with the remaining tree halves. You may have to hold the half trees in place while the icing sets.",
      "To decorate the ladybird biscuits, brush the rounds with cooled boiled water and cover the larger round with a circle of pink or red ready-to-roll icing and the smaller in white ready-to-roll icing. Attach the white round to the base using a small ball of ready-to-roll icing and tilt on an angle. Finish decorating the ladybird by piping on a face and spots in black icing.",
      "To decorate the lamb biscuits, ice half the bodies of the lambs using the flooding technique in step 10 - keeping the legs free of icing. Once the icing is dry, spread an undecorated lamb biscuit with icing and sandwich to the back of the decorated biscuit. Dot some icing on the back of the individual lamb legs and stick over the whole lamb’s legs to give a 3D effect. When the icing is dry the biscuits should stand up without support. If desired, decorate the lamb’s legs with icing.",
      "To decorate the sitting down person biscuits, decorate the biscuit bodies as desired. Slot the legs sideways into the precut slots so the person is sitting down with their legs stretched out in front of them.  Attach the feet to the bottom of the legs using icing and leave to dry.  "
    ],
    "url": "www_bbc_com_food_recipes_3d_biscuits_29555",
    "title": "3D biscuits",
    "time": {
      "totalMins": "150"
    },
    "serves":
      "Makes about 25 medium-sized or 12 large biscuitsMakes about 25 medium-sized or 12 large biscuits",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/3d_biscuits_29555_16x9.jpg",
    "isVegetarian": true,
    "recommendations": "0",
    "categories": ["dessert"],
    "cuisine": ["american"]
  },

  "Chicken chasseur with creamy mash": {
    "ingredients": {
      "chicken": { "quantity": "3", "type": "lb" },
      "flour": { "quantity": "1", "type": "tbsp" },
      "butter": { "quantity": "5", "type": "oz" },
      "bacon": { "quantity": "1", "type": "package" },
      "shallots": { "quantity": "2", "type": "" },
      "mushrooms": { "quantity": "6", "type": "oz" },
      "tomato paste": { "quantity": "1", "type": "can" },
      "white wine": { "quantity": "6", "type": "oz" },
      "chicken stock": { "quantity": "14", "type": "oz" },
      "tarragon": { "quantity": "1", "type": "bunch" },
      "tomatoes": { "quantity": "3", "type": "" },
      "parsley": { "quantity": "2", "type": "tbsp" },
      "potatoes": { "quantity": "4", "type": "" },
      "double cream": { "quantity": "4", "type": "oz" }
    },
    "method": [
      "For the chicken, season the chicken with salt and black pepper then toss in the flour to just coat.",
      "Heat a large pan until hot, add the oil, a knob of the butter and half the chicken and fry skin side down for 3-4 minutes until golden-brown.",
      "Turn and fry on the other side for another 1-2 minutes, then remove from the pan. Repeat with another knob of butter and the rest of the chicken.",
      "Add another knob of butter and the bacon and fry until golden-brown then add the shallots, mushrooms and tomato purée and fry for another couple of minutes.",
      "Add the wine and bring to a simmer, gently scraping up any cooked on bits from the bottom of the pan.",
      "Add the stock then return the chicken to the pan with half the tarragon and bring to a boil.",
      "Reduce the heat to a simmer, cover and cook for 30-40 minutes until the chicken is tender and the liquid slightly reduced.",
      "While the chicken cooks, skin and seed the tomatoes. Bring a pan of water to the boil, take out the stalk of the tomato and make a cross on the bottom.",
      "Drop the tomatoes into the water and simmer for 10-15 seconds until the skin starts to peel away.",
      "Lift straight out into a bowl of iced water and peel off the skin.",
      "Cut the tomatoes into quarters and remove the seeds then cut into small dice. Roughly chop the remaining tarragon.",
      "Add the tomatoes, flatleaf parsley and tarragon then check the seasoning.",
      "For the mash place the potatoes into a pan of salted water and bring to the boil.",
      "Reduce the heat and simmer for 12-15 minutes until the potatoes are tender.",
      "Drain and return to the pan, then place over the heat for one minute to drive off any excess moisture.",
      "Pass through a potato ricer back into the pan (or mash with a fork) then add the butter and cream, beating to form a smooth mash.",
      "Season with salt and white pepper.",
      "Serve two pieces of chicken per person with the sauce spooned over and a dollop of mash."
    ],
    "url": "www_bbc_com_food_recipes_chicken_chasseur_with_12065",
    "title": "Chicken chasseur with creamy mash",
    "time": {
      "totalMins": "90"
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_chasseur_with_12065_16x9.jpg",
    "isVegetarian": false,
    "recommendations": "0",
    "categories": ["comfort"],
    "cuisine": ["french"]
  },
  "Andalucian pork with apricots, prunes and herbs, rolled in paprika": {
    "ingredients": {
      "pork fillet": { "quantity": 1, "type": "" },
      "dried apricots": { "quantity": "1.75", "type": "oz" },
      "prunes": { "quantity": "1.75", "type": "oz" },
      "paprika": { "quantity": 2, "type": "tbsp" },
      "fresh parsley": { "quantity": 0.5, "type": "oz" },
      "oregano": { "quantity": 1, "type": "tsp" },
      "thyme": { "quantity": 1, "type": "tsp" },
      "garlic": { "quantity": 1, "type": "clove" },
      "olive oil": { "quantity": 2, "type": "tbsp" },
      "lemon": { "quantity": 1, "type": "" }
    },

    "method": [
      "Cut the pork open with a sharp knife and open the fillet out along its length, being careful not to cut all the way through the fillet.",
      "In a bowl, mix together the prunes, apricots and parsley and insert along the length of the fillet. Season well.",
      "Roll the fillet up and securely fasten with string.",
      "Mix up the paprika, the remaining herbs, the garlic, the salt and the oil to make a thick paste. Spread over the surface of the meat, and leave it in the fridge, ideally overnight.",
      "Preheat the oven to 200C/400C/Gas 6. Season the meat and sear on all sides in a heavy pan. Place in the oven for fifteen minutes.",
      "Rest the meat before serving with lemon wedges."
    ],
    "url": "www_bbc_com_food_recipes_andalucianporkwithap_72080",
    "title":
      "Andalucian pork with apricots, prunes and herbs, rolled in paprika",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 750
    },
    "serves": "Serves 2Serves 2",
    "isVegetarian": false,
    "recommendations": 0,
    "image":
      "https://i.pinimg.com/originals/0a/7a/11/0a7a11aa7855cf36fb8cc854f4748477.jpg",
    "cuisines": ["spanish"]
  },

  "Chicken in white wine sauce": {
    "ingredients": {
      "chicken breasts": { "quantity": 4, "type": "breast" },
      "onion": { "quantity": 1, "type": "medium" },
      "carrot": { "quantity": 1, "type": "carrot" },
      "celery": { "quantity": 1, "type": "stalk" },
      "bay leaf": { "quantity": 1, "type": "leaf" },
      "peppercorns": { "quantity": 6, "type": "tsp" },
      "butter": { "quantity": 1, "type": "oz" },
      "flour": { "quantity": 1, "type": "cup" },
      "white wine": { "quantity": 5, "type": "fl oz" },
      "egg": { "quantity": 1, "type": "egg" },
      "cream": { "quantity": 6, "type": "tbsp" },
      "lemon juice": { "quantity": 1, "type": "tsp" },
      "parsley ": { "quantity": 1, "type": "tbsp" }
    },
    "method": [
      "Place the chicken breasts in a pan with the vegetables and peppercorns and cover with water. ",
      "Bring gradually to the boil and simmer until the chicken is cooked all the way through - about 30 minutes. ",
      "Carefully remove the chicken breasts from the cooking liquid and keep them warm. ",
      "Strain the cooking liquid into a clean pan, discarding the cooked vegetables. Reserve about 450ml/16fl oz of the liquid.",
      "Melt the butter in a separate pan and add the flour. Cook until the mixture forms a smooth paste which leaves the sides and base of pan cleanly.",
      "Gradually add the reserved cooking liquid to the mixture, a ladle at a time, allowing to boil after each addition before beating well. Stir until the mixture blends smoothly.",
      "Pour the white wine into the sauce and reduce the heat to low. ",
      "In a small bowl, combine the egg yolk with the double cream. Stir the egg and cream into the sauce. ",
      "Add a squeeze of lemon juice and salt and freshly ground black pepper to taste.",
      "Cut the cooked chicken into bite-sized pieces and stir into the sauce. ",
      "Garnish with chopped fresh parsley and serve at once."
    ],
    "url": "www_bbc_com_food_recipes_mirandaschickeninwhi_85673",
    "title": "Chicken in white wine sauce",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0,
    "image":
      "https://www.monpetitfour.com/wp-content/uploads/2017/05/Chicken-in-White-Wine-Sauce_3-copy.jpg",
    "categories": ["chicken"],
    "cuisine": ["italian"]
  },
  "Feijoada": {
    "ingredients": {
      "dried black beans": { "quantity": 4, "type": "oz" },
      "olive oil": { "quantity": 4, "type": "tbsp" },
      "pork ribs": { "quantity": 4, "type": "oz" },
      "ribs": { "quantity": 1, "type": "rack" },
      "onion": { "quantity": 1, "type": "large" },
      "garlic": { "quantity": 1, "type": "head" },
      "bacon": { "quantity": 2, "type": "oz" },
      "pork belly": { "quantity": 2, "type": "oz" },
      "smoked pork sausage": {
        "quantity": 1,
        "type": "link"
      },

      "chilli": { "quantity": 2, "type": "tbsp" }
    },
    "method": [
      "Soak the black beans in 2 litres/3½ pints of cold water overnight.",
      "When the beans have soaked, heat half of the oil in a lidded frying pan (large enough to fit all the ribs in at once) over a medium heat. ",
      "Season the smoked and unsmoked pork ribs all over with salt and freshly ground black pepper. Fry the ribs for 4-5 minutes on each side, or until browned on both sides.",
      "Add the onion and garlic and continue to fry for a further 2-3 minutes, stirring well, until softened.",
      "Add 250ml/9fl oz water and bring it to a simmer, then cover the frying pan with the lid and cook for 18-20 minutes, topping up the pan with water as necessary if the liquid evaporates too quickly. Transfer the pan contents to a large casserole and set aside.",
      "Wipe the frying pan clean with kitchen paper, then heat the remaining oil over a medium heat. Fry the bacon, pork belly and sausage, in batches, until browned all over (do not overcrowd the pan). Transfer the browned meat to the casserole.",
      "Add the soaked black beans and the soaking liquid to the casserole and stir well. Bring the mixture to the boil, then reduce the heat until the mixture is simmering gently. Simmer, half-covered, for about 2½ hours, topping up the casserole with water every so often to prevent it from drying out. The feijoada is ready when the ribs are tender and the meat is almost falling off the bone.",
      "Just before serving, season the feijoada with salt and freshly ground black pepper, if necessary, and with chill flakes, if desired."
    ],
    "url": "www_bbc_com_food_recipes_andre_and_andersons_49427",
    "title": "Feijoada",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 840
    },
    "serves": "Serves 6-8Serves 6-8",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/andre_and_andersons_49427_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["comfort"],
    "cuisine": ["brazilian", "spanish"]
  },

  "Angel food cake with lemon curd": {
    "ingredients": {
      "flour": { "quantity": 2, "type": "oz" },
      "sugar": { "quantity": 1, "type": "oz" },
      "egg": { "quantity": 11, "type": "eggs" },
      "lemons": { "quantity": 2, "type": "lemons" },
      "lemon juice": { "quantity": 1, "type": "tbsp" },
      "cream of tartar": { "quantity": 1, "type": "tsp" },
      "unsalted butter": { "quantity": 1, "type": "tbsp" },
      "passion fruit": { "quantity": 1, "type": "cup" },
      "whipping cream": { "quantity": 1, "type": "fl oz" },
      "vanilla extract": { "quantity": 0.5, "type": "tsp" }
    },
    "method": [
      "Preheat the oven to 180C/350F/Gas 4 (fan 160C) and arrange an oven shelf in the bottom third of the oven. Sift the flour and 100g/3½oz of the caster sugar together in a bowl and set aside.",
      "Whisk the egg whites in a large bowl with an electric hand whisk or mixer on a high speed for one minute until frothy. Add the lemon zest, lemon juice, cream of tartar and salt and continue whisking for 2-3 minutes, or until soft peaks form when the whisk is removed from the bowl. Increase the speed and add the remaining 200g/7oz of caster sugar, one tablespoon at a time to form firm, but not stiff peaks. ",
      "Sprinkle over one-third of the flour mixture and fold gently to combine. Repeat with the remaining two-thirds of the flour mixture folding gently to keep as much air in the mixture as possible.",
      "Transfer the batter to a 25cm/10in angel food cake pan. Gently run a knife through the centre of the batter to remove any pockets of air. Cook for 45-50 minutes, or until a skewer inserted into the centre comes out clean. ",
      "Remove from the oven and immediately turn upside down onto the tin’s cooling legs, or place over the neck of a wine bottle. Leave to cool for at least one hour. ",
      "Run a knife around the inner and outer edges of cake to remove it from the pan. Invert onto a plate. Carefully use a palette knife to separate the cake from the base of the pan. Leave to cool on a wire rack.",
      "For the lemon curd, mix the egg yolks, sugar, lemon juice and lemon zest together in a large pan. Cook over a low heat, stirring with a wooden spoon, making sure to stir the sides and base of the pan.  Cook for 5-7 minutes, or until the mixture coats the back of a spoon. Remove from the heat and stir in the butter. Pass through a sieve into a large jug. Fill two 350g/12oz glass jars with the lemon curd and seal with lids. Cover the remaining curd with cling film and leave to cool. ",
      "For the topping, whisk the cream and vanilla extract in a bowl until soft peaks form when the whisk is removed. Spoon the topping over the angel food cake and, using a palette knife, coat the top and sides of the cake, smoothing as you go.",
      "Cut the passion fruit in half and scoop out the seeds. Stir the passion fruit into the reserved, cooled lemon curd and drizzle over the angel food cake before serving. You may want to use just one of the jars of lemon curd to serve with the cake and save the other to eat separately. "
    ],
    "url": "www_bbc_com_food_recipes_angel_food_cake_with_04002",
    "title": "Angel food cake with lemon curd",
    "time": {
      "preparation": "1-2 hours1-2 hours",
      "preparationMins": 120,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 180
    },
    "serves":
      "Serves 12-15, and makes two 350g/12oz jars of lemon curdServes 12-15, and makes two 350g/12oz jars of lemon curd",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/angel_food_cake_with_04002_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["dessert"]
  },

  "Swedish Christmas Glögg": {
    "ingredients": {
      "red wine": { "quantity": 1, "type": "bottle" },
      "sticks cinnamon": { "quantity": 2, "type": "stick" },
      "ginger": { "quantity": 5, "type": "g" },
      "orange peel": { "quantity": 5, "type": "g" },
      "orange": { "quantity": 1, "type": "" },
      "green cardamom": { "quantity": 7, "type": "pod" },
      "whole cloves": { "quantity": 16, "type": "clove" },
      "sugar": { "quantity": 1, "type": "tsp" },
      "almonds": { "quantity": 2, "type": "oz" },
      "raisins": { "quantity": 1.5, "type": "oz" },
      "vodka": { "quantity": 1, "type": "splash" },
      "rum": { "quantity": 1, "type": "shot" },
      "cognac": { "quantity": 1, "type": "shot" }
    },
    "method": [
      "Pour the wine into a pan, add the rest of the ingredients and heat to around 80C/176F, stirring to dissolve the sugar. ",
      "Remove from the heat and leave to infuse for at least an hour. ",
      "Strain the mixture and return the mulled wine to the bottle - use a funnel to make life easier for yourself. The wine can be kept for around a week. ",
      "To serve, pour the wine into a saucepan and heat it.",
      "Place a few flaked almonds and raisins in the bottom of your serving cups, and pour the glögg over the mixture. ",
      "If you want to give your glögg a kick, add a splash of either vodka, aquavit, rum or cognac just after you’ve reheated the wine. "
    ],
    "url": "www_bbc_com_food_recipes_annikas_glgg_annikas_32356",
    "title": "Swedish Christmas Glögg",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Makes 1 bottleMakes 1 bottle",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/annikas_glgg_annikas_32356_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["alcohol"]
  },

  "Angela's slow roasted ginger pork": {
    "ingredients": {
      "pork": { "quantity": 3, "type": "oz" },
      "garlic": { "quantity": 1, "type": "head" },
      "ginger": { "quantity": 1, "type": "piece" },
      "olive oil": { "quantity": 3, "type": "tbsp" },
      "white wine vinegar": { "quantity": 4, "type": "tbsp" }
    },
    "method": [
      "Preheat the oven to 220C/425F/Gas mark 7.",
      "Place the pork skin-side up on a rack over a roasting tin. Place the garlic and ginger in a pestle and mortar or food processor and pound or process until you get a rough paste then mix in the oil and vinegar. Rub the paste all over the scored skin of the pork. Place in the preheated oven and cook for 30 minutes.",
      "Remove the pork from the oven, reduce the temperature to 150C/300F/Gas 2. Turn the pork over with the skin side down on the rack and return to the oven and cook for 4-5 hours.",
      "Remove from the oven and turn up to the highest setting 220C/425F/Gas 7. Turn the pork over to the crackling side on the rack and roast in the hot oven for the final 20 minutes to crisp up the crackling. Leave to stand for 10-15 minutes before carving.",
      "To serve, cut away the crackling with a sharp knife and break it up into pieces then carve the meat. It should be very tender and succulent."
    ],
    "url": "www_bbc_com_food_recipes_angelasslowroastedgi_71381",
    "title": "Angela's slow roasted ginger pork",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 6-8Serves 6-8",
    "isVegetarian": false,
    "recommendations": 0,
    "image":
      "https://www.eatwell101.com/wp-content/uploads/2016/02/best-Slow-Cooked-Pork-Shoulder.jpg",
    "categories": ["roast"],
    "cuisine": ["american"]
  },
  "Easy cookies": {
    "ingredients": {
      "unsalted butter": { "quantity": 2, "type": "tbsp" },
      "granulated sugar": { "quantity": 1, "type": "packet" },
      "vanilla extract": { "quantity": 3, "type": "tsp" },
      "egg": { "quantity": 1, "type": "large" },
      "flour": { "quantity": 0.5, "type": "lb" },
      "baking powder": { "quantity": 1, "type": "tsp" },
      "chocolate chips": { "quantity": 4, "type": "oz" },
      "peanuts": { "quantity": 4, "type": "oz" },
      "macadamia nuts": { "quantity": 1, "type": "oz" },
      "ginger": { "quantity": 2, "type": "oz" }
    },
    "method": [
      "In a large bowl, beat together the butter and sugar until pale, fluffy and well combined. ",
      "Beat in the vanilla extract and beaten egg, a little at a time, until well combined. ",
      "Sift the flour, baking powder and salt into the bowl and mix well until smooth and combined.",
      "Lay a large sheet of cling film (approx 30cm/12in square) onto a work surface and pour the cookie batter into the middle of it. ",
      "Bring the far edge of the cling film over the cookie batter and towards you, then use the side of a palette knife to press the batter against the length of cling film. Wrap the cling film around the dough to form a sausage shape 7–8cm/3–4in wide. Twist the ends to secure and chill in the fridge for one hour, or until firm. (NB: At this stage, the cookie dough can be frozen until needed.)",
      "Preheat the oven to 200C/180 Fan/Gas 6.",
      "When the cookie dough is firm, cut 1cm/½in slices from it and arrange them on a baking tray with enough space around each to allow for the mixture spreading.",
      "The cookies can be cooked as they are. Alternatively, sprinkle over toppings of your choice, such as chocolate chips, nuts or crystallised ginger before cooking. ",
      "Transfer the cookies to the oven and bake for 8–10 minutes, or until the edges are pale golden-brown.",
      "Set the cookies aside for 1–2 minutes, then transfer to a wire rack to cool."
    ],
    "url": "www_bbc_com_food_recipes_anytimecookies_92185",
    "title": "Easy cookies",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Makes 30Makes 30",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anytimecookies_92185_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["dessert"],
    "cuisine": ["american"]
  },
  "Paul's apple and blackberry crumble": {
    "ingredients": {
      "apples": { "quantity": 2, "type": "oz" },
      "butter": { "quantity": 1, "type": "tbsp" },
      "sugar": { "quantity": 0.5, "type": "oz" },
      "blackberries": { "quantity": 1, "type": "" },
      "whole-wheat flour": { "quantity": 0.5, "type": "oz" },
      "oats": { "quantity": 0.5, "type": "oz" },
      "dark brown sugar": { "quantity": 0.5, "type": "oz" },
      "unsalted butter": { "quantity": 1, "type": "tbsp" },
      "sunflower seeds": { "quantity": 1, "type": "cup" },
      "pumpkin seeds": { "quantity": 0.5, "type": "oz" }
    },
    "method": [
      "Preheat the oven to 180C/350F/Gas 4. ",
      "For the filling, put the apples, butter and sugar in a pan. Cook over a medium heat for about 10 minutes, stirring from time to time, until the sugar has dissolved and the fruit is just beginning to collapse. Taste and add more sugar if required. Stir in the blackberries and transfer the mixture to an oven dish and set aside.  ",
      "To make the crumble topping, combine the flour, oats, powdered seaweed and sugar in a bowl. Add the butter and rub in lightly with your fingertips until the mix resembles coarse breadcrumbs. ",
      "Using a pestle and mortar or a small food processor, crush the seeds so they break down a little. Do not reduce them to a fine powder. Stir the crushed seeds into the crumble mixture.",
      "Spoon the crumble mixture over the filling. Bake for 35-40 minutes, or until golden-brown and bubbling. Leave to settle for about 10 minutes before serving. "
    ],
    "url": "www_bbc_com_food_recipes_apple_and_blackberry_33697",
    "title": "Paul's apple and blackberry crumble",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 6Serves 6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_blackberry_33697_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["dessert"],
    "cuisine": ["american"]
  },

  "Apple and cinnamon breakfast pot": {
    "ingredients": {
      "yogurt": { "quantity": 0.5, "type": "oz" },
      "rolled oats": { "quantity": 1, "type": "tbsp" },
      "apple": { "quantity": 1, "type": "small" },
      "blueberries": { "quantity": 1, "type": "cup" },
      "ground cinnamon": { "quantity": 1, "type": "pinch" }
    },
    "method": [
      "Mix the yoghurt and oats together in a bowl, cover and refrigerate overnight. ",
      "When ready to eat, stir in the apple, blueberries, cinnamon and sweetener, if using. Serve."
    ],
    "url": "www_bbc_com_food_recipes_apple_and_cinnamon_79023",
    "title": "Apple and cinnamon breakfast pot",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 720
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0,
    "image":
      "https://www.fivehearthome.com/wp-content/uploads/2015/10/Ovenight-Slow-Cooker-Apple-Pie-Steel-Cut-Oatmeal-Breakfast-Recipe-No-Sticking-Burning-Edges-by-Five-Heart-Home_700pxZoom.jpg",
    "categories": ["breakfast", "quick"],
    "cuisine": ["american"]
  },

  "Arancini with tomato and olive tapenade": {
    "ingredients": {
      "black olives": { "quantity": 0.5, "type": "oz" },
      "tomatoes": { "quantity": 0.5, "type": "oz" },
      "garlic": { "quantity": 2, "type": "cloves" },
      "lemons": { "quantity": 2, "type": "" },
      "fresh parsley": { "quantity": 1, "type": "tbsp" },
      "mayonnaise": { "quantity": 0.5, "type": "oz" },
      "unsalted butter": { "quantity": 2, "type": "tbsp" },
      "arborio rice": { "quantity": 1, "type": "cup" },
      "white wine": { "quantity": 1, "type": "splash" },
      "vegetable stock": { "quantity": 1, "type": "pints" },
      "sun dried tomatoes": { "quantity": 0.5, "type": "oz" },
      "spring onions": { "quantity": 1, "type": "medium" },
      "egg": { "quantity": 1, "type": "large" },
      "flour": { "quantity": 1, "type": "cup" },
      "vegetable oil": { "quantity": 0.75, "type": "tbsp" }
    },
    "method": [
      "For the tapenade, blend all of the ingredients except for the mayonnaise together until smooth. Stir in the mayonnaise. ",
      "For the arancini, melt the butter in a large heavy-bottomed saucepan. Add the rice and cook for 2-3 minutes on a low heat. When the rice starts to become a little translucent around the edges, add the wine and cook for another minute.",
      "Add a ladleful of warm stock and stir well. When the stock has almost been absorbed,  add another ladleful. Continue adding more stock until it has all been added and the rice is cooked. ",
      "Fold in the sun-dried tomatoes and spring onion and season with salt and freshly ground black pepper. Set aside to cool.",
      "Beat the egg in a bowl, sprinkle the flour onto a plate.",
      "Roll the rice into small balls, then dip into the beaten egg and dredge in the flour. ",
      "Half-fill a deep, heavy-based saucepan with vegetable oil and heat to 170C/325F (check using a digital thermometer). (CAUTION: Hot oil can be dangerous. Do not leave unattended).",
      "Deep-fry the arancini for 3-4 minutes, or until golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. ",
      "Serve the arancini with the tapenade. "
    ],
    "url": "www_bbc_com_food_recipes_arancini_with_tomato_and_49993",
    "title": "Arancini with tomato and olive tapenade",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 6Serves 6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arancini_with_tomato_and_49993_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["comfort"],
    "cuisine": ["italian"]
  },
  "Beef curry with shatkora": {
    "ingredients": {
      "vegetable oil": { "quantity": 2, "type": "tbsp" },
      "cinnamon": { "quantity": 2, "type": "stick" },
      "bay leaves": { "quantity": 4, "type": "" },
      "cardamom": { "quantity": 46, "type": "pods" },
      "star anise": { "quantity": 1, "type": "pod" },
      "fenugreek seeds": { "quantity": 0.25, "type": "tsp" },
      "onions": { "quantity": 2, "type": "medium" },
      "garlic paste": { "quantity": 1, "type": "tbsp" },
      "ginger paste": { "quantity": 1, "type": "tbsp" },
      "beef chuck": { "quantity": 8, "type": "oz" },
      "orange": { "quantity": 1, "type": "" },
      "chili powder": { "quantity": 1, "type": "2 cups" },
      "turmeric": { "quantity": 1, "type": "tsp" },
      "ground coriander": { "quantity": 1, "type": "tsp" },
      "ground cumin": { "quantity": 1, "type": "tsp" },
      "garam masala": { "quantity": 1, "type": "tsp" },
      "tomato puree": { "quantity": 2, "type": "tsp" },
      "tomatoes": { "quantity": 1, "type": "" },
      "coriander": { "quantity": 1, "type": "tsp" },
      "basmati rice": { "quantity": 1, "type": "cup" },
      "ginger": { "quantity": 1, "type": "tsp" },
      "dill": { "quantity": 5, "type": "sprigs" },
      "lemon": { "quantity": 1, "type": "" }
    },
    "method": [
      "Heat the oil in a large, heavy bottomed, non-stick saucepan. Add the whole spices (cinnamon, bay leaves, cardamom, star anise and fenugreek seeds) and heat gently, swirling in the oil to release the flavours. Add the salt.",
      "Stir in the onions, garlic and ginger pastes, continuing to stir and cook on a medium heat until the onions are soft and just starting to colour. Add the meat and brown all over in the spice and onion mixture, this will take approximately 10 minutes.",
      "Add enough water to fully cover the meat (approximately 750ml/1¼ pint). Stir and bring to the boil before reducing the heat and simmering uncovered for 30 minutes, stirring frequently. ",
      "Add a generous pinch of shatkora or orange rind slices (around 6-8 little slithers) to the pan and stir. Add the chilli powder, turmeric, coriander, cumin and garam masala. Stir in the tomato purèe. Add a little more water, cover with a lid and cook on a gentle simmer for 1½–2 hours, or until the meat is tender.  Remove the lid for the last 10 minutes to reduce and thicken the sauce.  ",
      "Finally add the tomato wedges and a handful of coriander and simmer for a few minutes before serving. Serve with rice and your choice of garnishes. "
    ],
    "url": "www_bbc_com_food_recipes_aromatic_beef_curry_with_63198",
    "title": "Beef curry with shatkora",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromatic_beef_curry_with_63198_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "cuisine": ["indian"],
    "categories": ["curry"]
  },
  "Aromatic beef curry": {
    "ingredients": {
      "ghee": { "quantity": 2, "type": "oz" },
      "steak": { "quantity": 1, "type": "steak" },
      "onion": { "quantity": 1, "type": "medium" },
      "garlic": { "quantity": 1, "type": "clove" },
      "cumin": { "quantity": 1, "type": "tsp" },
      "coriander": { "quantity": 1, "type": "tsp" },
      "turmeric": { "quantity": 1, "type": "tsp" },
      "chili powder": { "quantity": 1, "type": "tsp" },
      "ginger": { "quantity": 0.5, "type": "tsp" },
      "cloves": { "quantity": 3, "type": "tsp" },
      "cardamom": { "quantity": 1, "type": "pod" },
      "cinnamon": { "quantity": 0.5, "type": "tsp" },
      "tomatoes": { "quantity": 1, "type": "" },
      "yogurt": { "quantity": 0.5, "type": "oz" },
      "vinegar": { "quantity": 1, "type": "tbsp" },
      "sugar": { "quantity": 1, "type": "pinch" }
    },
    "method": [
      "Heat a lidded frying pan over a medium heat and add the ghee or oil. Fry the meat until lightly browned on all sides, then remove from the pan with a slotted spoon, cover and set aside.",
      "Add the onion and garlic to the pan and fry over a low heat until soft. Turn the heat up slightly, add the spices and fry for 1 minute, they should start to smell aromatic, without burning.",
      "Return the beef to the pan, add the tomatoes and bring to the boil. Take the pan off the heat and stir in the yoghurt and vinegar, then season to taste with the salt and the sugar. ",
      "Return the pan to the heat, bring back to the boil and simmer, covered, for 1½ hours, or until the meat is tender."
    ],
    "url": "www_bbc_com_food_recipes_aromatic_beef_curry_90850",
    "title": "Aromatic beef curry",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromatic_beef_curry_90850_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["curry"],
    "cuisine": ["indian"]
  },
  "Aloo panchporan (Stir-fried potatoes tempered with five spices)": {
    "ingredients": {
      "vegetable oil": { "quantity": 1, "type": "tbsp" },
      "potatoes": { "quantity": 2, "type": "lb" },
      "turmeric": { "quantity": 1, "type": "tsp" },
      "cilli powder": { "quantity": 1, "type": "tsp" },
      "cumin": { "quantity": 1, "type": "tbsp" },
      "fennel": { "quantity": 1, "type": "tbsp" },
      "fenugreek seeds": { "quantity": 1, "type": "tbsp" },
      "nigella seeds": { "quantity": 1, "type": "tbsp" },
      "black mustard seeds": { "quantity": 1, "type": "tbsp" },
      "five spice mix": { "quantity": 2, "type": "tbsp" },
      "green chilli": { "quantity": 1, "type": "tsp" },
      "coriander": { "quantity": 1, "type": "tbsp" }
    },
    "method": [
      "In a wide non-stick pan, heat the oil to a medium-high heat and add the potatoes.  ",
      "Sauté the potatoes until they are nearly cooked. Add the turmeric, chilli powder and salt and fry until they are cooked through.",
      "In a separate small shallow frying pan heat the oil until it begins to smoke. Mix together the five spice mix ingredients, and add two teaspoons to the hot pan. The seeds will crackle and pop, so be careful when handling the mixture. Add the green chillies and the chopped coriander and stir for a few seconds. Pour this mixture onto the cooked potatoes.  ",
      "Serve immediately."
    ],
    "url": "www_bbc_com_food_recipes_aloopanchporanstirfr_77165",
    "title": "Aloo panchporan (Stir-fried potatoes tempered with five spices)",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4-6Serves 4-6",
    "isVegetarian": true,
    "recommendations": 0,
    "image":
      "https://www.yummytummyaarthi.com/wp-content/uploads/2013/03/1-5.jpg",
    "categories": ["quick"],
    "cuisine": ["chinese"]
  },

  "Alpine pizza": {
    "ingredients": {
      "flour": { "quantity": 1, "type": "lb" },
      "salt": { "quantity": 2, "type": "tsp" },
      "sachet": { "quantity": 2, "type": "oz" },
      "gruyere cheese": { "quantity": 3, "type": "oz" },
      "crème fraîche": { "quantity": 9, "type": "oz" },
      "red onion": { "quantity": 1, "type": "onion" },
      "salami": { "quantity": 5, "type": "oz" }
    },
    "method": [
      "For the pizza dough, combine the flour, salt and yeast in a large bowl. Gradually add the water, mixing well with your hands to obtain a dough. If you find the dough too sticky, simply add a little more flour. Shape into a ball, cover with a cloth and leave to rest for five minutes. ",
      "Knead the dough for about 10 minutes and split it in half. Sprinkle some flour on a clean kitchen cloth and place the pieces of dough on it. Cover with a slightly damp cloth and leave to rise for at least 30 minutes in a warm place. ",
      "Preheat the oven to 240C/475F/Gas 9. ",
      "Meanwhile, for the topping, combine the gruyère and crème fraîche in a bowl, adding some salt and pepper to taste. Set aside. ",
      "Once the dough has risen, sprinkle some flour on a clean work surface and spread one dough ball into a circle about 30cm/12in in diameter, making it as thin as possible (without tearing it), with the border slightly thicker. Repeat with the other dough ball. Sprinkle two flat baking trays with breadcrumbs or semolina and place the pizza bases on them. ",
      "Spread the crème fraîche mixture over each base. Top with the onions and salami. Bake in the hot oven for 10 minutes. Remove from the oven, sprinkle with the marjoram and serve. "
    ],
    "url": "www_bbc_com_food_recipes_alpine_pizza_32132",
    "title": "Alpine pizza",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 70
    },
    "serves": "Makes 2 large pizzasMakes 2 large pizzas",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/alpine_pizza_32132_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["quick"],
    "cuisine": ["italian"]
  },

  "Aloo gobi and jeera rice": {
    "ingredients": {
      "basmati rice": { "quantity": 12, "type": "oz" },
      "sunflower oil": { "quantity": 2, "type": "tbsp" },
      "onion": { "quantity": 1, "type": "onion" },
      "cumin": { "quantity": 2, "type": "tsp" },
      "bay leaf": { "quantity": 1, "type": "" },
      "cinnamon stick": { "quantity": 1, "type": "" },
      "butter": { "quantity": 1, "type": "oz" },
      "ground turmeric": { "quantity": 2, "type": "tsp" },
      "root ginger": { "quantity": 1, "type": "in" },
      "chilli": { "quantity": 2, "type": "tsp" },
      "fenugreek": { "quantity": 3, "type": "tbsp" },
      "cauliflower": { "quantity": 1, "type": "" },
      "potatoes": { "quantity": 2, "type": "potatoes" },
      "masala": { "quantity": 2, "type": "tbsp" }
    },
    "method": [
      "To make the jeera rice, wash and soak the rice while you prepare the spices. Place the oil in a large saucepan over a medium heat. Add the onion, cumin, bay, cinnamon and cardamom pods and gently fry for a few minutes. Drain and add the rice, then pour over 800ml/1 pint 8fl oz water. Bring to the boil, cover, reduce the heat and simmer for 15–20 minutes.",
      "Meanwhile, to make the aloo gobi, heat the oil and butter in a large heavy-based saucepan over a medium heat. Add the cumin, turmeric, ginger, onions, chillies and fenugreek and fry for a few minutes. Add the cauliflower florets and leaves, stir to coat in the spices and cook for a few minutes. Add the potatoes, stir again, cover and steam for 10–15 minutes, or until the vegetables are tender. Sprinkle over the garam masala and season to taste. Garnish with coriander before serving with the rice."
    ],
    "url": "www_bbc_com_food_recipes_aloo_gobi_and_jeera_rice_60396",
    "title": "Aloo gobi and jeera rice",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aloo_gobi_and_jeera_rice_60396_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["salad"],
    "cuisine": ["indian"]
  },

  "Amaretti biscuits": {
    "ingredients": {
      "eggs": { "quantity": 4, "type": "eggs" },
      "sugar": { "quantity": 12, "type": "oz" },
      "almonds": { "quantity": 12, "type": "oz" },
      "amareto liquor": { "quantity": 1, "type": "fl oz" },
      "butter": { "quantity": 1, "type": "tbsp" }
    },
    "method": [
      "Preheat the oven to 170C/325F/Gas 3.",
      "In a large bowl beat the eggs whites until firm.  ",
      "Mix the sugar and the almonds gently into it.  ",
      "Add the amaretto liquor and fold in gently until you have a smooth paste.",
      "Place some baking paper on a baking tray and lightly brush with butter.   ",
      "Using a teaspoon place small heaps of the mixture approximately 2cm/¾in apart, as they will expand whilst cooking.  ",
      "Bake for approximately 15 minutes until golden brown. Leave to cool slightly then serve or store in an air-tight container."
    ],
    "url": "www_bbc_com_food_recipes_amarettibistcuits_67183",
    "title": "Amaretti biscuits",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes approximately 20 biscuitsMakes approximately 20 biscuits",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/amarettibistcuits_67183_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["dessert"],
    "cuisine": ["italian"]
  },
  "Amaretti tiramisu": {
    "ingredients": {
      "black coffee": { "quantity": 7, "type": "oz" },
      "brandy": { "quantity": 1, "type": "fl oz" },
      "amaretti": { "quantity": 6, "type": "" },
      "double cream": { "quantity": 5, "type": "fl oz" },
      "chocolate": { "quantity": 1, "type": "oz" },
      "cherries": { "quantity": 1, "type": "oz" },
      "cocoa": { "quantity": 1, "type": "tbsp" },
      "milk": { "quantity": 9, "type": "oz" },
      "sugar": { "quantity": 2, "type": "tbsp" },
      "orange": { "quantity": 2, "type": "" }
    },
    "method": [
      "Place the coffee and brandy into a bowl and mix together.",
      "Dip the biscuits into the mixture, then place half of them into the base of a dessert glass.",
      "Place the whipped cream into a bowl with the grated chocolate and cherries and stir to mix.",
      "Spoon half of the cream mixture onto the biscuits, then repeat to make a second layer of biscuits followed by a final layer of cream. Dust with cocoa powder.",
      "For the chocolate sauce, heat the milk in a saucepan, add the chocolate and simmer gently until the chocolate has melted. Stir in the icing sugar.",
      "To serve, pour some of the chocolate sauce over the tiramisu and top with the orange slices."
    ],
    "url": "www_bbc_com_food_recipes_amarettitiramisu_84954",
    "title": "Amaretti tiramisu",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Serves 1Serves 1",
    "isVegetarian": true,
    "recommendations": 0,
    "image":
      "https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/2/4/2/RX-FNM_030111-Sugar-Fix-005_s4x3.jpg.rend.hgtvcom.616.462.suffix/1371597326801.jpeg",
    "categories": ["dessert"],
    "cuisine": ["italian"]
  },
  "Breakfast muffins": {
    "ingredients": {
      "flour": { "quantity": 10, "type": "oz" },
      "baking powder": { "quantity": 1, "type": "tsp" },
      "cinnamon": { "quantity": 1, "type": "tsp" },
      "brown sugar": { "quantity": 5, "type": "oz" },
      "milk": { "quantity": 10, "type": "oz" },
      "eggs": { "quantity": 2, "type": "eggs" },
      "butter": { "quantity": 3, "type": "oz" },
      "hazelnuts": { "quantity": 3, "type": "oz" },
      "cherries": { "quantity": 1, "type": "oz" },
      "granola": { "quantity": 2, "type": "oz" }
    },
    "method": [
      "Preheat the oven to 180C/350F/Gas 4 and line a muffin tray with paper muffin cases.",
      "In a large bowl, sift together the flour, baking powder, salt and cinnamon and then stir in the sugar. In a separate bowl, whisk together the milk, eggs and melted butter, then pour into the dry ingredients and quickly mix together. Stir in the hazelnuts, dried cherries and dried cranberries. ",
      "Divide the batter between the 12 muffin cases and sprinkle the top of each with the granola.",
      "Bake for 20-25 minutes, or until a skewer inserted into the middle of the muffins comes out clean. Leave to cool for five minutes in the tin before serving warm or at room temperature."
    ],
    "url": "www_bbc_com_food_recipes_american-style_breakfast_66044",
    "title": "Breakfast muffins",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 12Makes 12",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/american-style_breakfast_66044_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["breakfast"],
    "cuisine": ["british"]
  },
  "American-style pancakes with blueberries": {
    "ingredients": {
      "flour": { "quantity": 1, "type": "lb" },
      "baking powder": { "quantity": 1, "type": "tsp" },
      "cinnamon": { "quantity": 1, "type": "tsp" },
      "buttermilk": { "quantity": 23, "type": "fl oz" },
      "vanilla": { "quantity": 1, "type": "tsp" },
      "eggs": { "quantity": 3, "type": "eggs" },
      "butter": { "quantity": 1, "type": "oz" },
      "blueberries": { "quantity": 10, "type": "oz" },
      "maple syrup": { "quantity": 5, "type": "tbps" }
    },
    "method": [
      "For the pancakes, put the flour, baking powder, cinnamon, if using, and salt in a large bowl, mix and make a well in the centre. Put the buttermilk, eggs yolks, melted butter and vanilla in a large bowl and whisk. In a separate, clean glass bowl, whisk the eggs whites until stiff peaks form.",
      "Pour the buttermilk mixture into the well in the flour mixture and whisk. Add a large spoonful of the eggs whites and fold in with a metal spoon to loosen the batter a little. Stir in the rest of the eggs whites, preserving as much of the air as possible, until you have a fluffy, bubbly batter.",
      "Heat a 20cm/8in frying pan to a medium heat and rub over a little butter. Pour one and a half ladlefuls of batter into the pan. Sprinkle a large handful of blueberries over the pancake; it will rise up around them as it cooks. When the pancake has browned on the bottom and is firm enough to flip (cooked through beyond halfway), turn it over quickly and cook for another minute on the other side. Transfer to a plate. Repeat with the rest of the batter and blueberries.",
      "For the maple butter, put the butter, cinnamon and a pinch of salt into a bowl. Whisk with a hand whisk until white and fluffy. Gradually whisk in the maple syrup until it is all incorporated and has a whipped consistency."
    ],
    "url": "www_bbc_com_food_recipes_american_style_pancakes_94634",
    "title": "American-style pancakes with blueberries",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 8 x 20cm/8in pancakesMakes 8 x 20cm/8in pancakes",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/american_style_pancakes_94634_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["breakfast"],
    "cuisine": ["american"]
  },
  "Anatra con melagrana (duck with pomegranate) and sautéed escarole": {
    "ingredients": {
      "duck": { "quantity": 4, "type": "" },
      "black pepper": { "quantity": 1, "type": "tbsp" },
      "butter": { "quantity": 1, "type": "oz" },
      "flour": { "quantity": 1, "type": "oz" },
      "olive oil": { "quantity": 4, "type": "tbsp" },
      "pomegranates": { "quantity": 5, "type": "" },
      "escarole": { "quantity": 1, "type": "" },
      "garlic": { "quantity": 4, "type": "" }
    },
    "method": [
      "Preheat the oven to 200C/400F/Gas 6.",
      "Season the duck breast with salt and freshly ground black pepper and dust with flour, shaking off any excess.",
      "Heat the butter and olive oil in a large ovenproof frying pan until the butter begins to foam. Add the duck and fry for two minutes on each side, then transfer to the oven to roast for 5-6 minutes, or until just cooked. The duck should be rare, but cook according to your preference.",
      "Meanwhile, rub two of the whole pomegranates firmly on a work surface with the palm of your hand, then cut them in half and squeeze out the juice, as you would with a lemon, all over the cooked duck.",
      "Open up the remaining pomegranates and remove the seeds. Sprinkle the pomegranate seeds over the duck.",
      "Place the duck onto a plate and drizzle with the juices and seeds from the pan. Let the duck rest for 2-3 minutes then slice on the diagonal.",
      "For the escarole, blanch the escarole leaves for a couple of minutes in boiling salted water. Drain and set aside.",
      "Heat the olive oil in a frying pan, add the garlic and fry for one minute, or until soft, then add the escarole and gently sauté for 1-2 minutes. Reduce the heat, cover with a lid and cook for 5-6 minutes, or until the escarole is tender.",
      "To serve, place the escarole onto the plate alongside the duck and spoon any remaining pan juices over."
    ],
    "url": "www_bbc_com_food_recipes_anatraconmelagranadu_84995",
    "title":
      "Anatra con melagrana (duck with pomegranate) and sautéed escarole",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "isVegetarian": false,
    "recommendations": 0,
    "image":
      "https://assets.bonappetit.com/photos/57b03238f1c801a1038bd707/16:9/w_1000,c_limit/mare_roast_duck_breasts_with_pomegranate_chile_sauce_h.jpg",
    "categories": ["roast"],
    "cuisine": ["chinese"]
  },
  "An authentic ragù bolognese": {
    "ingredients": {
      "beef": { "quantity": 1, "type": "lb" },
      "pork": { "quantity": 1, "type": "lb" },
      "olive oil": { "quantity": 4, "type": "tbsp" },
      "chicken livers": { "quantity": 8, "type": "oz" },
      "onion": { "quantity": 2, "type": "" },
      "garlic": { "quantity": 4, "type": "" },
      "pancetta": { "quantity": 1, "type": "oz" },
      "tomatoes": { "quantity": 14, "type": "oz" },
      "red wine": { "quantity": 14, "type": "fl oz" },
      "basil": { "quantity": 1, "type": "oz" },
      "nutmeg": { "quantity": 1, "type": "oz" }
    },
    "method": [
      "Preheat the oven to 140C/275F/Gas 1.",
      "First take a large frying pan, the largest you have, heat 3 tbsp of the oil and gently fry the onion and garlic over a medium heat for about 10 minutes, moving it around from time to time.",
      "While the onion is softening, chop the pancetta: the best way to do this after opening the pack is to roll the contents into a sausage shape, then using a sharp knife slice it lengthways into four, then slice the lengths across as finely as possible. After 10 minutes, add this to the pan to join the onions and garlic and continue cooking them all for another 5 minutes. ",
      "Now transfer this mixture to the casserole. Add another tbsp of oil to the pan, turn the heat up to its highest then add the minced beef and brown it, breaking it up and moving it round in the pan. When the beef is browned tip it into the casserole. Heat another tbsp of the oil and do exactly the same with the minced pork. While the pork is browning, trim the chicken livers, rinse them under cold running water, dry them thoroughly with kitchen paper and chop them minutely small. When the pork is browned, transfer it to the casserole, then heat the remaining tbsp of oil and brown the pieces of chicken liver. Add these to the casserole.",
      "Now you've finished with the frying pan, so get rid of that and place the casserole over the direct heat, give everything a good stir together, then add the contents of the tins of tomatoes, the tomato purée, red wine and a really good seasoning of salt, pepper and nutmeg.",
      "Allow this to come up to simmering point. Then strip the leaves from half the basil, chop them very finely and add them to the pot. As soon as everything is simmering, place the casserole on the centre shelf of the oven and leave it to cook slowly, without a lid, for 4 hours.  It's a good idea to have a look after 3 hours to make sure all is well, but what you should end up with is a thick, concentrated sauce with only a trace of liquid left in it, then remove it from the oven, taste to check the seasoning, strip the leaves off the remainng basil, chop them small and stir them in.",
      "Then when the sauce is absolutely cold, divide it, using scales, by spooning 225g/8oz into polythene freezer bags. Seal them leaving a little bit of air at the top to allow room for expansion. Each 225g/8oz pack, thoroughly defrosted and re-heated, will provide enough ragù for 225g/8oz pasta, which will serve 2 people."
    ],
    "url": "www_bbc_com_food_recipes_anauthenticragubolog_66229",
    "title": "An authentic ragù bolognese",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "over 2 hoursover 2 hours",
      "cookingMins": 120,
      "totalMins": 240
    },
    "serves": "Makes 8 x 225g/8oz portionsMakes 8 x 225g/8oz portions",
    "isVegetarian": false,
    "recommendations": 0,
    "image":
      "https://assets.epicurious.com/photos/58a4bff7f43b8f08235e5588/master/pass/classic-ragu-bolognese-021517-2.jpg",
    "categories": ["pasta"],
    "cuisine": ["italian"]
  },
  "Pork chops with celeriac mash and apple and ale gravy": {
    "ingredients": {
      "celeriac": { "quantity": 1, "type": "" },
      "pork": { "quantity": 4, "type": "lb" },
      "olive oil": { "quantity": 2, "type": "tbsp" },
      "butter": { "quantity": 4, "type": "oz" },
      "onion": { "quantity": 1, "type": "" },
      "black pepper": { "quantity": 1, "type": "tbsp" },
      "apple": { "quantity": 3, "type": "" },
      "beer": { "quantity": 16, "type": "oz" },
      "vegetable oil": { "quantity": 2, "type": "tbsp" },
      "dijon mustard": { "quantity": 1, "type": "tbsp" },
      "vinegar": { "quantity": 1, "type": "tbsp" }
    },
    "method": [
      "Peel the celeriac, chop into 2.5cm/1-inch chunks and place in a pan of cold water. Place on the hob, bring to the boil and simmer until tender, about 20 minutes. Mash the celeriac with 100g/3½oz of the butter and season with salt and freshly ground black pepper. Keep covered and warm.",
      "Meanwhile, peel, halve and thinly slice the onion lengthways into semicircles. Heat the olive oil in a heavy-bottomed frying pan and cook the onions on a medium high heat until soft and lightly coloured. ",
      "Cut the apples into quarters and cut out the cores out, then cut them again into eighths. ",
      "Remove the onions from the pan, add the remaining 50g/1½oz butter and place the apples in. Cook over a medium heat. When they are golden brown turn them over so that they are beautifully coloured on both sides. ",
      "Return the onions to the pan with the apples, raise the heat and add the ale to the pan. Adjust the seasoning and continue cooking until the apples begin to break down a little and the liquid has reduced by at least half and has thickened somewhat.",
      "With a sharp knife score the skin of the chops and season them. This will help the chop to crisp when it is cooked.",
      "Heat a griddle pan until smoking hot. Rub the pork chops with some vegetable oil (this will help prevent sticking) and place the chops on the hot griddle. Cook, turning as necessary, until the meat is cooked through (cooking time will depend on the thickness of the chops; it will be cooked when the juices run clear when pierced with a sharp knife near the bone).",
      "For the salad, make the vinaigrette. Place the mustard, vinegar and olive oil in a bowl and whisk. Season to taste.",
      "When the chops are cooked, remove from the griddle, and put covered on a plate in a warm place for five minutes. Meanwhile, whisk a knob of butter into the sauce to thicken it slightly. ",
      "To serve, divide the mash among four plates, place a chop on each dollop of mash and pour the mustard and ale sauce over it. Dress the rocket with the vinaigrette and serve on the side."
    ],
    "url": "www_bbc_com_food_recipes_amershamporkchopswit_80661",
    "title": "Pork chops with celeriac mash and apple and ale gravy",
    "time": {
      "preparation": "30 mins to 1 hour30 mins to 1 hour",
      "preparationMins": 60,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 120
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/amershamporkchopswit_80661_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0,
    "categories": ["roast"],
    "cuisine": ["british"]
  },
  "Anardana chana (pomegranate and chickpea curry)": {
    "ingredients": {
      "chickpeas": { "quantity": 7, "type": "oz" },
      "chana dal": { "quantity": 3, "type": "oz" },
      "sunflower oil": { "quantity": 2, "type": "tbsp" },
      "root ginger": { "quantity": 1, "type": "in" },
      "cumin": { "quantity": 2, "type": "tbsp" },
      "cinnamon": { "quantity": 1, "type": "" },
      "cardamoms": { "quantity": 2, "type": "" },
      "cloves": { "quantity": 2, "type": "" },
      " chilli": { "quantity": 1, "type": "" },
      "salt": { "quantity": 1, "type": "tbsp" },
      "anardana": { "quantity": 1, "type": "tbsp" },
      "masala": { "quantity": 1, "type": "tsp" },
      "pomegranate": { "quantity": 1, "type": "" }
    },
    "method": [
      "Drain the chickpeas and place in a saucepan. Cover with water and bring to the boil. Reduce the heat and simmer for 45 minutes, or until tender. Drain and set aside.",
      "Meanwhile, heat the oil in a heavy bottomed saucepan over a medium heat. When hot, add the onions and cook for a few minutes until starting to soften. Add the ginger, spices, chilli and salt. ",
      "Drain the chana dal and add to the pan with 400ml/14fl oz water. Bring to the boil, then simmer for 35–40 minutes, or until the dal is tender. Add a little more water if needed. ",
      "Stir in the anardana, garam masala and chickpeas, heat through and adjust the seasoning.",
      "To serve, pick out the whole spices if you wish and garnish with the coriander and pomegranate seeds. "
    ],
    "url": "www_bbc_com_food_recipes_anardana_channa_chickpea_14037",
    "title": "Anardana chana (pomegranate and chickpea curry)",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 840
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anardana_channa_chickpea_14037_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0,
    "categories": ["quick"],
    "cuisine": ["italian"]
  },

  "Asparagus and puff pastry cigars": {
    "ingredients": {
      "pastry": { "quantity": 7, "type": "oz" },
      "flour": { "quantity": 3, "type": "tbsp" },
      "cream cheese": { "quantity": 1, "type": "oz" },
      "asparagus": { "quantity": 1, "type": "oz" },
      "eggs": { "quantity": 1, "type": "eggs" },
      "parmesan": { "quantity": 2, "type": "tbsp" }
    },
    "method": [
      "Preheat the oven to 200C/400F/Gas 6.",
      "Roll the puff pastry out on a floured surface into an 15cmx25cm/6inx10in rectangle and spread all over with the cream cheese.",
      "Using a sharp knife, cut the pastry into 10 long, thin strips.",
      "Wrap one pastry strip in a spiral around each asparagus spear and place onto a baking tray. Lightly brush each with beaten eggs then scatter over the parmesan.",
      "Bake the cigars in the oven for 15-20 minutes, or until the pastry has risen and is golden-brown."
    ],
    "url": "www_bbc_com_food_recipes_asparagus_and_puff_00402",
    "title": "Asparagus and puff pastry cigars",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 10Makes 10",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagus_and_puff_00402_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Asparagus and poached eggs puff tarts with parmesan and basil": {
    "ingredients": {
      "pastry": { "quantity": 1, "type": "lb" },
      "flour": { "quantity": 3, "type": "tbsp" },
      "cream cheese": { "quantity": 1, "type": "oz" },
      "asparagus": { "quantity": 1, "type": "oz" },
      "eggs": { "quantity": 7, "type": "eggs" },
      "parmesan": { "quantity": 2, "type": "tbsp" },
      "lemon": { "quantity": 2, "type": "" },
      "black pepper": { "quantity": 2, "type": "" },
      "basil ": { "quantity": 2, "type": "" },
      "olive oil": { "quantity": 2, "type": "" }
    },
    "method": [
      "Line a large baking tray with baking parchment and set aside.",
      "Dust a little flour on a clean work surface and roll out the puff pastry to a 28x30cm/11x12in rectangle about the thickness of a £1 coin. Trim the edges so that the sides are nice and straight and neat. Cut the pastry in half down the length and then into thirds across the width to give six 10x14cm/4x5½in rectangles.",
      "Put the pastry rectangles on the baking tray, cover with cling film and refrigerate for 20 minutes (or freeze for 10 minutes) for the pastry to firm up. It is important to do this so that when the puff pastry goes into the oven the flour cooks before the butter melts ensuring a much lighter pastry.",
      "Preheat the oven to 220C/425F/Gas 7 (200C fan).  Mix the cream cheese and lemon zest together in a small bowl and season to taste with salt and pepper. Trim the asparagus so that each stem is 10cm/4in long (you can use the trimmings to make a quick soup or add to a pasta sauce).",
      "Once firm, remove the pastry from the fridge (or freezer) and use a sharp knife to mark a 1cm/½in wide border around each rectangle. Then, using a crosshatch pattern, mark the border so each pastry shape resembles a picture frame. Take a fork and prick the centre of each shape about 10 times, right through to the baking tray. Brush the border with the beaten eggs (or milk), making sure that it does not go down the sides of the pastry (if this happens, wipe it away with your finger otherwise the eggs will stick the layers of the pastry together and stop the pastry from rising). ",
      "Divide the lemony cream cheese between the six tarts, spreading it out with the back of the spoon and making sure that it stays inside the ‘frame’. Lay five asparagus spears in a single layer, touching each other and pointing in the same direction on each tart, and push them down slightly. ",
      "Bake the tarts in the oven for 18-20 minutes, or until the pastry has puffed up nicely and is firm and golden-brown where it has risen.",
      "About 10 minutes before the tart is ready, pour about 4cm/1½in of water into a sauté pan or a deep frying pan and bring to the boil over a high heat. Turn the heat down to bring the water to a gentle simmer. Crack an eggs into a very small bowl or tea cup and then slide the eggs into the water. Repeat with all of the eggs, spacing them apart. Cook them for about 3-4 minutes, or until the white is cooked but the yolk still soft. Remove with a slotted spoon onto a warm plate. ",
      "Remove the tarts from the oven and divide between six serving plates. Sit a poached eggs on top of each tart and scatter over the parmesan and basil leaves. Sprinkle with a little salt and pepper and drizzle with a little olive oil, if liked, and serve."
    ],
    "url": "www_bbc_com_food_recipes_asparagus_and_poached_80127",
    "title": "Asparagus and poached eggs puff tarts with parmesan and basil",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asparagus_and_poached_80127_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Avocado salad": {
    "ingredients": {
      "onion": { "quantity": 1, "type": "oz" },
      "cannellini beans": { "quantity": 1, "type": "lb" },
      "avocado": { "quantity": 1, "type": "" },
      "cherry tomatoes": { "quantity": 1, "type": "oz" },
      "basil": { "quantity": 1, "type": "oz" },
      "lemon": { "quantity": 2, "type": "" },
      "olive oil": { "quantity": 1, "type": "tbsp" },
      "salt": { "quantity": 2, "type": "" }
    },
    "method": [
      "Soak the onion in a small bowl of cold water for 5 minutes to remove some of the heat.",
      "Toss the cannellini beans, avocado, cherry tomatoes and basil together in a bowl.",
      "Drain the onion and pat dry with kitchen paper then mix into the salad.",
      "Drizzle over the lemon juice and oil, season with salt and pepper and serve."
    ],
    "url": "www_bbc_com_food_recipes_avocado_salad_60227",
    "title": "Avocado salad",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 30
    },
    "serves": "Serves 1Serves 1",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/avocado_salad_60227_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Avocado pasta with peas and mint": {
    "ingredients": {
      "pasta": { "quantity": 13, "type": "oz" },
      "avocado": { "quantity": 1, "type": "" },
      "garlic": { "quantity": 2, "type": "" },
      "coconut": { "quantity": 2, "type": "tbsp" },
      "salt": { "quantity": 1, "type": "tsp" },
      "mint": { "quantity": 2, "type": "" },
      "peas": { "quantity": 5, "type": "oz" },
      "chilli": { "quantity": 1, "type": "" }
    },
    "method": [
      "Cook the pasta according to the packet instructions. Drain and set aside. ",
      "Destone the avocado, then put the avocado flesh, garlic, coconut oil, salt, lemon juice, zest and mint leaves into a blender with 4 tablespoons of water. (Alternatively, you can put everything in a bowl or pan and use a stick blender.)",
      "Blend until you get a smooth paste. If you find the mixture is struggling to move, add another tablespoon of water and try again. Put the pasta into a serving bowl and pour over the sauce. Add the peas and mix until all the pasta is coated in green goodness. ",
      "For a little kick, I like to take a red chilli and grate it over the top. This is optional, but worth doing if you like chilli!"
    ],
    "url": "www_bbc_com_food_recipes_avocado_pasta_with_peas_31700",
    "title": "Avocado pasta with peas and mint",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/avocado_pasta_with_peas_31700_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Simple baba ganoush": {
    "ingredients": {
      "aubergine": { "quantity": 2, "type": "oz" },
      "olive oil": { "quantity": 5, "type": "tbsp" },
      "onion": { "quantity": 2, "type": "" },
      "garlic": { "quantity": 2, "type": "" },
      "cibatta": { "quantity": 1, "type": "" }
    },
    "method": [
      "Heat the oil in an oven-proof frying pan over a medium heat. Add the aubergine and onion and fry for fifteen minutes to soften. Add the garlic and fry for two minutes",
      "Meanwhile, heat a griddle pan. Brush the ciabatta with oil and grill the bread on each side for 1-2 minutes, or until brown stripes appear.",
      "Place the aubergine mixture into a food processor with the basil and a splash of oil. Blend to a rough paste and pour out into a bowl.",
      "Serve the aubergine mixture with the griddled bread."
    ],
    "url": "www_bbc_com_food_recipes_babaganoush_78707",
    "title": "Simple baba ganoush",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/babaganoush_78707_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Bacon and eggs bites": {
    "ingredients": {
      "bacon": { "quantity": 12, "type": "" },
      "eggs": { "quantity": 12, "type": "eggs" },
      "cherry tomatoes": { "quantity": 12, "type": "" },
      "black pepper": { "quantity": 2, "type": "tbsp" },
      "bread": { "quantity": 5, "type": "" },
      "butter": { "quantity": 1, "type": "tbsp" }
    },
    "method": [
      "Preheat the oven to 220C/200C Fan/Gas 8 and lightly grease a 12-hole muffin tin. ",
      "Put the bacon medallions between two sheets of cling film and roll out using a rolling pin. Put them into the muffin tin, creating a case shape.",
      "Crack the eggs into the centre of each bacon case, season with black pepper and top with two tomato halves.",
      "Bake in the oven for 10 minutes until the bacon is cooked and the eggs just cooked on the inside. If you like your eggs well done, cook for 15 minutes.",
      "Toast the bread to your liking and then butter lightly. Serve two eggs bites with one piece of toast per person."
    ],
    "url": "www_bbc_com_food_recipes_bacon_and_eggs_bites_26820",
    "title": "Bacon and eggs bites",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_eggs_bites_26820_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Bacon and white bean soup": {
    "ingredients": {
      "bacon": { "quantity": 2, "type": "" },
      "olive oil": { "quantity": 1, "type": "tbsp" },
      "onion": { "quantity": 2, "type": "" },
      "garlic": { "quantity": 2, "type": "" },
      "thyme": { "quantity": 3, "type": "" },
      "cannellini beans": { "quantity": 2, "type": "lb" },
      "vegetable stock": { "quantity": 24, "type": "oz" },
      "parsley": { "quantity": 2, "type": "oz" },
      "black pepper": { "quantity": 2, "type": "tbsp" }
    },
    "method": [
      "Heat the oil in a large saucepan over a medium heat. Add the bacon, garlic and onion and fry for 3-4 minutes, or until the bacon begins to brown and the onion softens.",
      "Add the thyme and fry for a further minute. Add the beans and stock to the pan and bring to the boil, then reduce the heat and simmer for 10 minutes.",
      "Transfer the soup to a blender or food processor and blend with the parsley and pepper until smooth.",
      "Return the soup to the pan and heat through, then ladle into 4 bowls and serve immediately."
    ],
    "url": "www_bbc_com_food_recipes_bacon_and_white_bean_06748",
    "title": "Bacon and white bean soup",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_white_bean_06748_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Bacon and cheese straws": {
    "ingredients": {
      "bacon": { "quantity": 12, "type": "" },
      "eggs": { "quantity": 1, "type": "" },
      "black pepper": { "quantity": 2, "type": "tbsp" },
      "pastry": { "quantity": 13, "type": "oz" },
      "flour": { "quantity": 2, "type": "" },
      "mustard": { "quantity": 3, "type": "tbsp" },
      "cheddar": { "quantity": 2, "type": "oz" }
    },
    "method": [
      "Line a baking tray with greaseproof paper.",
      "Roll the pastry out on a lightly floured work surface to a large rectangle of 0.5cm/¼in thickness. ",
      "Turn the pastry so that the longest side is facing you, spread over the mustard, sprinkle with the cheese and season with freshly ground black pepper. Place the pieces of bacon onto the pastry, leaving a small gap between each piece. ",
      "Cut the pastry between each slice of bacon. Carefully twist each piece of pastry 4-5 times so it looks like a curly straw, then place on the baking tray.",
      "Repeat the process until all of the bacon has been used up. Chill the pastry twists in the fridge for 15-20 minutes.",
      "Preheat the oven to 220C/425F/Gas 7.",
      "Remove the twists from the fridge and brush with the beaten eggs. ",
      "Reduce the oven to 200C/400F/Gas 6 and bake the twists for 20-25 minutes, or until the pastry is well risen and golden-brown. Remove from the oven and set aside to cool."
    ],
    "url": "www_bbc_com_food_recipes_bacon_and_mature_cheddar_58920",
    "title": "Bacon and cheese straws",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 14 cheese strawsMakes 14 cheese straws",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bacon_and_mature_cheddar_58920_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Bacon and Brussels sprout salad": {
    "ingredients": {
      "olive oil": { "quantity": 1, "type": "tbsp" },
      "bacon": { "quantity": 3, "type": "oz" },
      "brussels sprouts": { "quantity": 1, "type": "lb" },
      "cranberries": { "quantity": 1, "type": "oz" },
      "marsala": { "quantity": 2, "type": "oz" },
      "mustard": { "quantity": 1, "type": "tbsp" },
      "honey": { "quantity": 1, "type": "tsp" },
      "walnut oil": { "quantity": 3, "type": "tbsp" },
      "pecans": { "quantity": 1, "type": "oz" },
      "sherry vinegard": { "quantity": 1, "type": "tsp" }
    },
    "method": [
      "Heat the olive oil in a large sauté pan. Add the bacon and cook until very crisp and the fat has rendered off. Remove with a slotted spoon and drain on kitchen paper.",
      "Thinly slice the Brussels sprouts and add to the pan. Cook on a high heat until the sprouts are starting to brown around the edges. Add 100ml/3½fl oz water and continue to cook, stirring regularly, until the water has evaporated off and the Brussels are just cooked – they should have wilted a little but still be a very fresh looking green. Keep warm.",
      "Meanwhile, put the cranberries in a small saucepan and cover with the marsala. Bring to the boil and simmer until all the liquid has been absorbed by the cranberries – they will be glossy and plump.",
      "Whisk the walnut oil and sherry vinegar together with the honey and mustard, if using. Season with salt and pepper. ",
      "To assemble the salad, arrange the leaves in a bowl or serving platter. Add the Brussels sprouts and most of the dressing and toss gently. Sprinkle over the bacon, pecans and cranberries and serve."
    ],
    "url": "www_bbc_com_food_recipes_baconbutteredbrussel_84617",
    "title": "Bacon and Brussels sprout salad",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 6Serves 6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/baconbutteredbrussel_84617_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Bagels": {
    "ingredients": {
      "flour": { "quantity": 1, "type": "lb" },
      "salt": { "quantity": 2, "type": "tsp" },
      "eggs": { "quantity": 1, "type": "" },
      "polenta": { "quantity": 2, "type": "tbsp" },
      "honey": { "quantity": 2, "type": "tbsp" },
      "vegetable oil": { "quantity": 1, "type": "tbsp" },
      "black treacle": { "quantity": 3, "type": "tbps" },
      "sesame seeds": { "quantity": 3, "type": "tbps" }
    },
    "method": [
      "Sift the flour and salt into a large mixing bowl, then add the yeast and mix well.",
      "Measure 250ml/9fl oz warm water in a measuring jug and then stir in the honey and oil.",
      "Make a well in the centre of the flour and pour the liquid in gradually, bringing the dough together with your hands.",
      "Turn the dough out onto a clean, dry and floured work surface. Start kneading the dough, stretching it away with the palm of one hand and folding it back again with the other. Knead for approximately 10 minutes, adding more flour if the dough becomes too sticky. Continue kneading until the dough is firm and elastic.",
      "Shape the dough into a large ball and place in a lightly oiled, large bowl. Turn the dough in the oil to coat. Cover with cling film or a plastic bag and put in a warm, dry place for 1–3 hours, or until the dough has doubled in size.",
      "When the dough has proved, bring a large saucepan of water to the boil and add the treacle or molasses. Cover and turn off the heat.",
      "Lightly oil two baking trays and sprinkle with polenta. Remove the dough from the bowl, then punch it down and knead it briefly. Roll it into a rough sausage shape and divide into seven equal chunks. As you work with one chunk, keep the others covered with a clean tea towel.",
      "Firmly roll out each chunk into a long, slender sausage shape. Bring the ends together, splash the ends with a tiny bit of water and squeeze them together to seal. Place on the prepared baking trays and repeat with the remaining the dough.",
      "Cover and set aside to prove for a further 10–20 minutes.",
      "Preheat the oven to 220C/425F/Gas 7.",
      "Bring the saucepan of molasses and water back to a gentle simmer. Gently drop each bagel into the water (do this in batches of no more than three at a time) and turn over after 1-2 minutes. Simmer for another 1-2 minutes, then remove the bagels from the water, and drain.",
      "Place the bagels on the prepared baking trays, spacing them widely apart. Brush the tops with the beaten eggs and sprinkle with sesame seeds, sea salt, poppy seeds or a savoury topping of your choice. Bake in the oven for 15 minutes, or until golden-brown, then turn them upside down for a further ten minutes to cook the bases. Transfer to a wire rack to cool before serving."
    ],
    "url": "www_bbc_com_food_recipes_bagels_47163",
    "title": "Bagels",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 180
    },
    "serves": "Serves 7Serves 7",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bagels_47163_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Chai muffins": {
    "ingredients": {
      "almond milk": { "quantity": 8, "type": "fl oz" },
      "eggs": { "quantity": 2, "type": "" },
      "chai": { "quantity": 2, "type": "" },
      "cinnamon": { "quantity": 1, "type": "tsp" },
      "flour": { "quantity": 2, "type": "tsp" },
      "baking powder": { "quantity": 3, "type": "tbsp" },
      "brown sugar": { "quantity": 5, "type": "oz" },
      "sunflower oil": { "quantity": 5, "type": "fl oz" }
    },
    "method": [
      "Warm the almond milk with the contents of the 2 teabags (I just rip them open over the pan) and cinnamon – stirring to mix – and leave to cool.",
      "While the milk’s cooling, preheat the oven to 200C/180C Fan/Gas 6 and line a 12-hole muffin tin with paper cases.",
      "In a large bowl, measure out the flour, baking powder, sugar and all but 2 tablespoons of the chopped almonds, and combine well.",
      "When the milk has cooled, add the eggs and oil, then whisk well. ",
      "Add the liquid ingredients to the dry ingredients, using a wooden spoon. Don’t be too efficient about this: a slightly lumpy batter makes for lighter muffins. Divide the mixture between the muffin cases (it will fill them well), then sprinkle equally with the remaining almonds and bake for 20–25 minutes, or until a cake tester comes out clean and the muffins are slightly risen and pleasingly golden-brown on top.",
      "Remove to a wire rack to cool for about 10 minutes before devouring."
    ],
    "url": "www_bbc_com_food_recipes_chai_muffins_06244",
    "title": "Chai muffins",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Makes 12 muffinsMakes 12 muffins",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chai_muffins_06244_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Chargrilled broccoli pasta with chilli and garlic": {
    "ingredients": {
      "spaghetti": { "quantity": 3, "type": "oz" },
      "olive oil": { "quantity": 3, "type": "tbps" },
      "broccoli": { "quantity": 3, "type": "oz" },
      "garlic": { "quantity": 1, "type": "" },
      "chilli": { "quantity": 1, "type": "" },
      "almonds": { "quantity": 1, "type": "tbsp" }
    },
    "method": [
      "Bring a large pan of salted water to the boil and cook the spaghetti for 8 minutes, until al dente. ",
      "Meanwhile, heat the olive oil in a saucepan over a high heat and add the broccoli. Leave it for 1 minute before moving so the broccoli chars, then turn and char on the other sides for about 3 minutes. ",
      "Add the garlic, chilli and almonds and stir-fry for a further 3 minutes. Season with salt and pepper. ",
      "Drain the spaghetti and add to the broccoli pan, stir well to combine and serve. "
    ],
    "url": "www_bbc_com_food_recipes_chargrilled_broccoli_69096",
    "title": "Chargrilled broccoli pasta with chilli and garlic",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 1Serves 1",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilled_broccoli_69096_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Chargrilled courgette with basil, mint, chilli and lemon": {
    "ingredients": {
      "olive oil": { "quantity": 1, "type": "tbsp" },
      "chilli": { "quantity": 1, "type": "" },
      "black pepper": { "quantity": 2, "type": "tbsp" },
      "lemon": { "quantity": 1, "type": "" },
      "mint": { "quantity": 1, "type": "" },
      "basil": { "quantity": 3, "type": "" },
      "courgettes": { "quantity": 2, "type": "oz" }
    },
    "method": [
      "Toss the courgette strips in a bowl with the olive oil (just enough to coat the courgette), chilli, sea salt and freshly ground black pepper.",
      "Heat a ridged grill pan until smoking hot and griddle the courgettes in batches, about four minutes per side, being careful not to crowd the grill pan. They should be tender, but with a crunch to them in the middle. If the strips are not quite cooked, leave them on the grill pan for longer, but watch the heat as you don't want them to burn. Don't be tempted to move the courgette while it is cooking or you won't get the chargrill marks across the flesh. Drain on kitchen paper.",
      "Toss the griddled courgettes in the lemon juice, mint, basil and a good slug of your best extra virgin olive oil."
    ],
    "url": "www_bbc_com_food_recipes_chargrilledcourgette_85172",
    "title": "Chargrilled courgette with basil, mint, chilli and lemon",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4-6Serves 4-6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilledcourgette_85172_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Chargrilled sweet and sour prawns": {
    "ingredients": {
      "prawns": { "quantity": 6, "type": "" },
      "salt": { "quantity": 1, "type": "" },
      "vegetable oil": { "quantity": 2, "type": "tbsp" },
      "coriander": { "quantity": 3, "type": "" },
      "lime": { "quantity": 2, "type": "" },
      "white vinegar": { "quantity": 5, "type": "tbsp" },
      "sugar": { "quantity": 2, "type": "tbsp" },
      "ginger": { "quantity": 2, "type": "in" },
      "chilli": { "quantity": 1, "type": "" }
    },
    "method": [
      "To butterfly the prawns, first remove the head by twisting it off, then discard. Don't remove the shell. Place the prawn on its back on a cutting board. Using a small, sharp knife, cut through the centre of the body from below the head down to the tail. Don't cut all the way through the flesh. Repeat with the remaining prawns.",
      "For the sweet and sour sauce, pour the vinegar into a small pan (not aluminium) over a medium heat. Add the sugar and heat through.",
      "Slice the ginger into thick slices and add to the sauce in the pan.",
      "Slice the chilli and add to the pan. Simmer the sauce until the sugar is dissolved and the sauce is reduced and sticky - about five minutes. Taste and adjust flavour as needed by adding a touch more sugar or vinegar, as necessary.",
      "Meanwhile, heat a ridged grill pan until hot. Sprinkle the sea salt over the prepared prawns. Pour over the oil, then rub it into the prawns.",
      "Place the prawns on the hot grill pan and grill until cooked through and slightly charred (this will take about 2-3 minutes). Press down lightly with tongs to ensure even cooking. Turn the prawns over and cook for another 2-3 minutes on the other side.",
      "Chop the fresh coriander. When the prawns are cooked, transfer them into the pan with the reduced sauce.",
      "Add the coriander and a squeeze of fresh lime juice to the pan.",
      "Stir together until the prawns are coated in the sauce. Serve straightaway."
    ],
    "url": "www_bbc_com_food_recipes_chargrilledsweetands_90198",
    "title": "Chargrilled sweet and sour prawns",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 2Serves 2",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chargrilledsweetands_90198_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Cheddar and bacon frittata": {
    "ingredients": {
      "bacon": { "quantity": 5, "type": "oz" },
      "eggs": { "quantity": 6, "type": "" },
      "red pepper": { "quantity": 2, "type": "tbsp" },
      "garlic": { "quantity": 3, "type": "oz" },
      "olive oil": { "quantity": 2, "type": "tbps" },
      "potatoes": { "quantity": 1, "type": "lb" },
      "cheddar": { "quantity": 2, "type": "oz" },
      "black pepper": { "quantity": 2, "type": "" },
      "parsley": { "quantity": 2, "type": "" }
    },
    "method": [
      "Parboil the potatoes in lightly salted water for 6–10 minutes, until almost cooked but still firm. Cut them into slices. Preheat your grill to medium–high. ",
      "Using a large ovenproof non-stick frying pan, fry the bacon in its own fat, stirring, for 4–5 minutes, or until cooked. Transfer to a plate and set aside. ",
      "Heat the oil in the same pan. Add the garlic and peppers and fry for 4–5 minutes, or until just cooked. ",
      "Add the potatoes to the pan, stir gently, then fry for 2–3 minutes, until lightly browned. Return the bacon to the pan and stir gently again. ",
      "Crack the eggs into a jug and lightly beat using a fork. Stir in the parsley and season well. Pour over the potato-and-bacon mixture, then sprinkle the cheese on top. Cook for 5 minutes.",
      "Transfer to the grill and cook for 5 minutes, or until cooked through. Serve in slices, with salad if you like. "
    ],
    "url": "www_bbc_com_food_recipes_cheddar_and_bacon_31049",
    "title": "Cheddar and bacon frittata",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 4–6Serves 4–6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheddar_and_bacon_31049_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },
  "French toast with ham and cheddar": {
    "ingredients": {
      "milk": { "quantity": 5, "type": "fl oz" },
      "eggs": { "quantity": 2, "type": "eggs" },
      "salt": { "quantity": 2, "type": "tsp" },
      "bread": { "quantity": 3, "type": "" },
      "olive oil": { "quantity": 2, "type": "tbps" },
      "dijon mustard": { "quantity": 1, "type": "tbsp" },
      "cheddar": { "quantity": 2, "type": "" },
      "black pepper": { "quantity": 2, "type": "" },
      "ham": { "quantity": 2, "type": "" }
    },
    "method": [
      "Preheat oven to 180C/350F/Gas 4.",
      "Place eggs, milk, salt and pepper into a large bowl. Whisk to combine.",
      "With a sharp, thin-bladed knife, carefully slit open one side of each slice of bread to form a pocket. Ensure that you leave 1cm/0.5in around the edges.",
      "Spread the mustard on one side of the pocket and place a slice of ham and cheese inside.",
      "Put the pockets into a shallow dish. Pour over the egg mixture and leave for five minutes, turning once.",
      "Heat a non-stick frying pan over a medium-high heat, add half of the olive oil and swirl to coat the base of the pan.",
      "Put the bread pocket into the pan and cook on one side for about two minutes until golden brown. Turn and cook for another minute.",
      "Remove from the pan and place on a baking tray. Put in the oven and cook for ten minutes, or until the filling has melted."
    ],
    "url": "www_bbc_com_food_recipes_cheddarandhameggybre_72058",
    "title": "French toast with ham and cheddar",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "less than 10 minsless than 10 mins",
      "cookingMins": 10,
      "totalMins": 40
    },
    "serves": "Serves 2Serves 2",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheddarandhameggybre_72058_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Cheese and ham quinoa bites": {
    "ingredients": {
      "rapeseed oil": { "quantity": 1, "type": "" },
      "eggs": { "quantity": 6, "type": "" },
      "quinoa": { "quantity": 1, "type": "lb" },
      "onion": { "quantity": 6, "type": "" },
      "tomatoes": { "quantity": 5, "type": "" },
      "potatoes": { "quantity": 1, "type": "lb" },
      "cheddar": { "quantity": 4, "type": "oz" },
      "black pepper": { "quantity": 2, "type": "" },
      "ham": { "quantity": 4, "type": "oz" },
      "salt": { "quantity": 1, "type": "" },
      "mustard": { "quantity": 1, "type": "tbsp" }
    },
    "method": [
      "Preheat the oven to 200C/180C Fan/Gas 6. Lightly grease a 12-hole muffin tin with a little rapeseed oil.",
      "Put the quinoa into a large saucepan, add 540ml/19fl oz cold water and bring to the boil over a high heat. Stir well then reduce the heat and simmer for 20 minutes, or until all the water has been absorbed and the quinoa is tender.",
      "Tip the quinoa into a sieve and rinse with cold running water to stop the cooking process. Use your hands to squeeze out any excess water.",
      "Beat together the eggs, vegetables, cheese and ham. Stir in the quinoa and mustard powder and season with salt and pepper.",
      "Divide the mixture between the muffin holes and bake for 18–20 minutes until golden brown."
    ],
    "url": "www_bbc_com_food_recipes_cheese_and_ham_quinoa_37074",
    "title": "Cheese and ham quinoa bites",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Makes 12Makes 12",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_ham_quinoa_37074_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Cheese and chorizo rolls": {
    "ingredients": {
      "flour": { "quantity": 2, "type": "oz" },
      "yeast": { "quantity": 1, "type": "oz" },
      "salt": { "quantity": 2, "type": "tbsp" },
      "sugar": { "quantity": 1, "type": "tbsp" },
      "olive oil": { "quantity": 2, "type": "tbps" },
      "chorizo": { "quantity": 2, "type": "oz" },
      "cheddar": { "quantity": 3, "type": "oz" },
      "chives ": { "quantity": 2, "type": "tbsp" },
      "eggs": { "quantity": 1, "type": "eggs" }
    },
    "method": [
      "Put the flour, yeast, salt and sugar (or honey) in a bowl and drizzle in the olive oil, then the water, mixing together until it comes together as a dough. Add the chorizo, 50g/1¾oz of the cheese and the chives (or other herbs).",
      "Knead in the bowl for a minute until the additions have worked in a little, then knead on a floured surface until the dough is smooth. Return to the bowl, cover with a damp cloth or cling film and leave to rest somewhere warm for 1½ –2 hours, until doubled in size.",
      "Preheat your oven to its highest setting. Knock back the risen dough and divide into 8–10 even pieces. Knead and shape into balls, then place in a 28cm/11in diameter cake tin or a small roasting tin, which has been lined with greaseproof paper. Cover with a damp towel again and leave to rise for another 20–30 minutes, or until risen and squashing together.",
      "Brush lightly with the egg glaze (you need a very light touch if the bread dough is at all puffy and springy), then sprinkle over the remaining 50g/1¾oz cheese. Bake in the oven for 20–25 minutes, or until cooked through and a golden-brown colour. They should feel slightly hollow. Serve warm from the oven or cold."
    ],
    "url": "www_bbc_com_food_recipes_cheese_and_chorizo_rolls_96145",
    "title": "Cheese and chorizo rolls",
    "time": {
      "preparation": "over 2 hoursover 2 hours",
      "preparationMins": 120,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 150
    },
    "serves": "Makes 8–10Makes 8–10",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cheese_and_chorizo_rolls_96145_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Cherry and chocolate mug cake": {
    "ingredients": {
      "chocolate": { "quantity": 3, "type": "oz" },
      "eggs": { "quantity": 2, "type": "" },
      "butter": { "quantity": 2, "type": "oz" },
      "sugar": { "quantity": 2, "type": "oz" },
      "flour": { "quantity": 2, "type": "oz" },
      "baking powder": { "quantity": 1, "type": "tsp" },
      "cherries": { "quantity": 2, "type": "oz" }
    },
    "method": [
      "Place the chocolate, butter, eggs and sugar into a bowl and mix together well.",
      "Add the flour, baking powder, cherries and cherry juice and fold together until smooth.",
      "Grease two mugs with butter, then spoon the mixture into each until three-quarters full. Cover each with cling film, place in the microwave and cook on full power for 2 minutes. Remove the cling film and cook for a further 30 seconds, or until risen and cooked through.",
      "To serve, top with the reserved cherries and drizzle with the melted chocolate."
    ],
    "url": "www_bbc_com_food_recipes_cherryandchocolateca_84273",
    "title": "Cherry and chocolate mug cake",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Serves 2Serves 2",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherryandchocolateca_84273_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Cherry tomato, marinated feta and basil skewers": {
    "ingredients": {
      "feta": { "quantity": 12, "type": "oz" },
      "olive oil": { "quantity": 2, "type": "tbps" },
      "lemon": { "quantity": 1, "type": "" },
      "oregano": { "quantity": 2, "type": "tsp" },
      "cherry tomatoes": { "quantity": 40, "type": "" },
      "basil": { "quantity": 1, "type": "" },
      "skewers": { "quantity": 40, "type": "oz" },
      "black pepper": { "quantity": 2, "type": "" }
    },
    "method": [
      "Cut the feta into 40 even squares and place in a bowl.  Pour over the olive oil; add the lemon zest, oregano and cracked black pepper.  Leave to marinate for at least 2 hours or preferably overnight.",
      "To assemble, take a skewer and place a cherry tomato first, follow with a cube of the feta.  You could prepare the skewers to this stage in advance, just keep refrigerated. ",
      "Finish each one with a basil leaf.  Skewer one tip of the leaf then the other tip so it looks like a little sail.  Repeat until you have forty skewers."
    ],
    "url": "www_bbc_com_food_recipes_cherrytomatomarinate_68101",
    "title": "Cherry tomato, marinated feta and basil skewers",
    "time": {
      "preparation": "overnightovernight",
      "preparationMins": 720,
      "cooking": "no cooking requiredno cooking required",
      "cookingMins": 0,
      "totalMins": 720
    },
    "serves": "Makes 40Makes 40",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cherrytomatomarinate_68101_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Chestnut stuffed mushrooms": {
    "ingredients": {
      "mushrooms": { "quantity": 6, "type": "" },
      "butter": { "quantity": 2, "type": "oz" },
      "olive oil": { "quantity": 2, "type": "tbps" },
      "thyme": { "quantity": 6, "type": "" },
      "madeira": { "quantity": 3, "type": "tbsp" },
      "onion": { "quantity": 2, "type": "" },
      "sausages": { "quantity": 6, "type": "" },
      "rosemary": { "quantity": 2, "type": "" },
      "breadcrumbs": { "quantity": 7, "type": "oz" },
      "chestnuts": { "quantity": 7, "type": "oz" }
    },
    "method": [
      "Pre heat the oven to 180C/350F/Gas 4.",
      "Remove the stalks from the mushrooms to allow them to be stuffed and lay in a large oven dish. Place a little knob of butter in each one and then drizzle the olive oil all over. Sprinkle the thyme into the mushrooms and finish with a few generous glugs of Madeira wine. Pop them in the oven for 20 minutes.",
      "Now for the stuffing, roughly chop your onions and soften in a frying pan with a little butter till golden. Remove the sausage skin and break the meat into the pan with the now golden onions. Tear in the remaining herbs, add the breadcrumbs and allow to cook through slightly. Chop the chestnuts and add to the pan and mix the contents well.",
      "After about 20 minutes remove the mushrooms and generously heap your stuffing into the mushrooms, piling it as high as you dare. Don’t worry about there being extra stuffing, simply shape them into little balls and place them around the mushrooms. ",
      "Now return the dish to the oven for a further half hour. Serve when the stuffing is crisp and golden."
    ],
    "url": "www_bbc_com_food_recipes_chestnut_stuffed_83323",
    "title": "Chestnut stuffed mushrooms",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 3-4Serves 3-4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chestnut_stuffed_83323_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Vegan coconut macaroons": {
    "ingredients": {
      "coconut": { "quantity": 2, "type": "oz" },
      "coconut milk": { "quantity": 6, "type": "fl oz" },
      "flour": { "quantity": 2, "type": "tbsp" },
      "maple syrup": { "quantity": 3, "type": "tbsp" },
      "vanila extract": { "quantity": 2, "type": "tbps" },
      "salt": { "quantity": 1, "type": "" }
    },
    "method": [
      "Preheat the oven to 180C/160C Fan/Gas 4. Line a baking tray with baking parchment.",
      "Stir all of the ingredients together in a saucepan over a medium heat until well combined. Continue to cook for 4-5 minutes until the coconut milk has been absorbed into the mixture and the mixture has thickened. Remove from the heat and set aside to cool slightly.",
      "Scoop tablespoonfuls of the macaroon mixture onto the prepared baking tray, to form small domes, leaving a gap between each. Bake in the middle of the oven for 12-15 minutes, or until toasted and golden-brown at the edges.",
      "Remove from the oven and set the macaroons aside to cool completely, then enjoy."
    ],
    "url": "www_bbc_com_food_recipes_chewy_coconut_macaroons_69782",
    "title": "Vegan coconut macaroons",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "10 to 30 mins10 to 30 mins",
      "cookingMins": 30,
      "totalMins": 60
    },
    "serves": "Makes 16Makes 16",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chewy_coconut_macaroons_69782_16x9.jpg",
    "isVegetarian": true,
    "recommendations": 0
  },

  "Chicken and chorizo paella": {
    "ingredients": {
      "oil": { "quantity": 12, "type": "tbsp" },
      "chicken pieces": { "quantity": 12, "type": "oz, with bone, raw" },
      "chorizo sausage": { "quantity": 1, "type": "oz" },
      "onion": { "quantity": 1, "type": "large" },
      "garlic cloves": { "quantity": 1, "type": "clove" },
      "red peppers": { "quantity": 2, "type": "cup, strips" },
      "chillies": { "quantity": 23, "type": "pepper" },
      "smoked paprika": { "quantity": 2, "type": "tsp" },
      "chicken stock": { "quantity": 0.5, "type": "pints" },
      "paella": { "quantity": 1, "type": "cup" },
      "rice": { "quantity": 1, "type": "cup" },
      "mussels": { "quantity": 36, "type": "oz" },
      "clams": { "quantity": 3, "type": "oz" },
      "shells": { "quantity": 1, "type": "cup shells" },
      "parsley roughly chopped": { "quantity": 2, "type": "oz" }
    },
    "method": [
      "Preheat the oven to 180C/350F/Gas 4.",
      "Heat the oil in a large, lidded, heatproof pan or paella pan. Fry the chicken until the pieces are evenly browned, turning them regularly as they cook. You may need to do this in two batches, depending on the size of your pan. Remove the chicken from the pan and set aside.",
      "Fry the slices of chorizo in the pan until crisp. They will release their juices into the pan, which adds a lot of flavour to the dish. Add the onion to the pan, and cook gently until soft, then add the garlic and fry for a further 2–3 minutes. Add the red peppers, chillies and smoked paprika, cook for another 2–3 minutes. Return the chicken pieces to the pan and pour in the stock. Simmer gently for 20–25 minutes until the chicken is tender. ",
      "Add the rice to the pan, cover with the lid and put into the preheated oven. Cook for 30 minutes, or until all the liquid has been absorbed and the rice is cooked. Alternatively, if using a paella pan which won’t fit in the oven, cover tightly with foil and continue cooking on the stove over a low heat for the same cooking time. If using mussels or clams, add them to the pan for the final 20 minutes cooking time. Discard any shells that remain closed after cooking. Check the chicken is cooked by piercing the thickest part of a piece with a skewer – if the juices run clear the chicken is cooked. ",
      "Sprinkle with parsley before bringing the pan to the table. Let your guests help themselves."
    ],
    "url": "www_bbc_com_food_recipes_chicken_and_chorizo_33509",
    "title": "Chicken and chorizo paella",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "1 to 2 hours1 to 2 hours",
      "cookingMins": 120,
      "totalMins": 150
    },
    "serves": "Serves 6Serves 6",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_and_chorizo_33509_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Mediterranean chicken with potatoes": {
    "ingredients": {
      "olive oil": { "quantity": 1, "type": "tbsp" },
      "chicken thighs": { "quantity": 2, "type": "oz" },
      "onion": { "quantity": 1, "type": "medium" },
      "carrot": { "quantity": 1, "type": "carrot" },
      "garlic cloves": { "quantity": 2, "type": "clove" },
      "tomatoes": { "quantity": 400, "type": "g" },
      "chicken stock": { "quantity": 1, "type": "cup" },
      "herbs": { "quantity": 1, "type": "tsp" },
      "potatoes": { "quantity": 5, "type": "oz" },
      "salt and pepper": { "quantity": 1, "type": "tbsp" }
    },
    "method": [
      "Heat a large saucepan over a medium heat. Add the oil and, once hot, add the chicken thighs, skin side down. Brown the chicken on each side for 3-4 minutes, or until nicely golden-brown all over. Remove the thighs from the pan and set to one side.",
      "Add the onion and carrot with a pinch of salt to the saucepan and stir over the heat. Fry for 6-7 minutes, or until the onions are soft and translucent. Add the garlic and continue to cook for two more minutes.",
      "Add the browned chicken back to the pan along with any juices from the meat. Pour over the tomatoes, stock and mixed herbs and mix well to make sure everything is evenly distributed. Season with a little salt and pepper, cover with a lid and gently simmer for 20 minutes, or until the chicken is cooked through and the sauce thickened slightly.",
      "Meanwhile boil the potatoes in a saucepan of boiling water for 10-12 minutes, or until tender and cooked through. Drain and serve alongside the cooked chicken."
    ],
    "url": "www_bbc_com_food_recipes_chicken_cacciatore_with_54620",
    "title": "Mediterranean chicken with potatoes",
    "time": {
      "preparation": "less than 30 minsless than 30 mins",
      "preparationMins": 30,
      "cooking": "30 mins to 1 hour30 mins to 1 hour",
      "cookingMins": 60,
      "totalMins": 90
    },
    "serves": "Serves 4Serves 4",
    "image":
      "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_cacciatore_with_54620_16x9.jpg",
    "isVegetarian": false,
    "recommendations": 0
  },

  "Coconut chilli chicken": {
    "ingredients": {
      "lemongrass": { "quantity": 3, "type": "cups" },
      "fresh ginger": { "quantity": 2, "type": "tsp" },
      "chillies": { "quantity": 2, "type": "pepper" },
      "cloves garlic": { "quantity": 2, "type": "clove" },
      "coriander": { "quantity": 1, "type": "tsp" },
      "limes": { "quantity": 1, "type": "lime" },
      "oil": { "quantity": 2, "type": "tbsp" },
      "tomatoes": {
        "quantity": 1,
        "type": "medium whole (2-3/5\" dia)",
        "fish sauce": { "quantity": 2, "type": "tbsp" },
        "dark soy sauce": { "quantity": 2, "type": "tbsp" },
        "chicken thighs": { "quantity": 8, "type": "thigh with skin" },
        "coconut milk": { "quantity": 1, "type": "can" },
        "apricots": { "quantity": 8, "type": "apricot" }
      },
      "method": [
        "Peel and discard the outer leaves of the lemongrass- they can sometimes be tough. Cut the inner leaves into short lengths and put in the food processor. Peel the ginger, then slice into thin pieces and add to the lemongrass. Chop the chillies, discarding their stems and add to the ginger with the peeled garlic. Roughly chop the stems and half of the leaves of the coriander to add to the food processor, reserving the rest for later.",
        "Grate the lime zest into the food processor, reserving the limes for later, then turn the machine on and let it chop everything to a coarse paste. Add a little groundnut oil and scrape the sides down with a spatula if it sticks. Add the fish sauce, soy sauce and the tomatoes and process for a few seconds longer.",
        "Warm a further tablespoon of groundnut oil in a deep pan over a moderate to high heat and use it to brown the chicken pieces, turning them so they colour nicely on both sides. Lift the chicken pieces out and pour away anything more than a tablespoon of oil and juices. Add the spice paste and let it fry over a moderate heat for two minutes till fragrant, stirring almost constantly, then return the chicken to the pan. Pour over the coconut milk, stir, cover and leave to simmer over a low heat for 15-20 minutes. Meanwhile halve and stone the apricots and leave them to one side.",
        "Test the chicken for doneness making certain it’s cooked right the way through, then add the apricots. Leave to simmer for a few minutes, then add the juice of the limes and the reserved coriander leaves. "
      ],
      "url": "www_bbc_com_food_recipes_chicken_curry_with_59058",
      "title": "Coconut chilli chicken",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 60
      },
      "serves": "Serves 4Serves 4",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_curry_with_59058_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0
    },
    "Chicken egg-fried rice": {
      "ingredients": {
        "vegetable oil": { "quantity": 1, "type": "tsp" },
        "egg": { "quantity": 1, "type": "large" },
        "spring onions": { "quantity": 2, "type": "medium (4-1/8\" long)" },
        "frozen peas": { "quantity": 0.75, "type": "oz" },
        "rice": { "quantity": 250, "type": "g" },
        "roast chicken": { "quantity": 3, "type": "oz" },
        "sesame oil": { "quantity": 1, "type": "tsp" },
        "dark soy sauce": { "quantity": 1, "type": "tbsp" }
      },
      "method": [
        "Heat half the oil in a wok or large frying pan over a high heat until it just starts to smoke. Add the egg and quickly stir-fry until just under-cooked. Remove from the wok and set aside.",
        "Heat the rest of the oil in the wok and add the spring onions and frozen peas. Stir-fry until the peas have defrosted.",
        "Squeeze the rice pouch a few times to break up the rice, then add the rice to the pan with the roast chicken. Stir-fry until the rice has started to crisp a little and the chicken is hot through.",
        "Stir in the cooked egg, toasted sesame oil and soy sauce and serve. "
      ],
      "url": "www_bbc_com_food_recipes_chicken_egg_fried_rice_50450",
      "title": "Chicken egg-fried rice",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "less than 10 minsless than 10 mins",
        "cookingMins": 10,
        "totalMins": 40
      },
      "serves": "Serves 1Serves 1",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_egg_fried_rice_50450_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0
    },

    "Chicken fajita drumsticks with Mexican corn salad": {
      "ingredients": {
        "chicken drumsticks": { "quantity": 12, "type": "drumstick with skin" },
        "paprika": { "quantity": 1, "type": "tbsp" },
        "ground cumin": { "quantity": 1, "type": "tbsp" },
        "garlic cloves": { "quantity": 4, "type": "clove" },
        "vegetable oil": { "quantity": 1, "type": "tbsp" },
        "tortilla wraps": {
          "quantity": 6,
          "type": "tortilla (approx 10\" dia)"
        },
        "sweetcorn": { "quantity": 200, "type": "g" },
        "red pepper": { "quantity": 1, "type": "cup, strips" },
        "spring onions": { "quantity": 2, "type": "medium (4-1/8\" long)" },
        "lemon juice": { "quantity": 0.5, "type": "tsp" },
        "salt and pepper": { "quantity": 0.25, "type": "tsp" }
      },
      "method": [
        "Preheat the oven to 200C/180C Fan/Gas 6. Tip the chicken into a large roasting tray and sprinkle over the spices. Lightly crush the garlic, leaving the skins on, and add to the tray with the chicken. Drizzle with the oil and season with salt and pepper. Roast for 30 minutes, turning halfway through cooking, until the chicken is lightly charred on the outside and perfectly cooked inside.",
        "While the chicken is cooking, make the salad. Tip the sweetcorn into a bowl then finely chop the pepper (removing the seeds) and add to the bowl. Finely slice the spring onions then add to the bowl along with a squeeze of lemon juice. Season to taste with salt and pepper.",
        "Shred the chicken from the bone and then wrap in tortilla wraps with the salad."
      ],
      "url": "www_bbc_com_food_recipes_chicken_drumsticks_with_66853",
      "title": "Chicken fajita drumsticks with Mexican corn salad",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 60
      },
      "serves": "Serves 6Serves 6",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chicken_drumsticks_with_66853_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0
    },

    "Chicken yakitori": {
      "ingredients": {
        "chicken breast": { "quantity": 1, "type": "breast" },
        "red pepper": { "quantity": 1, "type": "cup, strips" },
        "spring onions": { "quantity": 1, "type": "small" },
        "shiitake mushrooms": { "quantity": 6, "type": "piece whole" },
        "mirin": { "quantity": 3, "type": "tbsp" },
        "soy sauce": { "quantity": 3, "type": "tbsp" },
        "sake": { "quantity": 3, "type": "tbsp" },
        "sugar": { "quantity": 1, "type": "tsp" }
      },
      "method": [
        "Thread the chicken pieces onto pre-soaked bamboo skewers, interspersing each piece of chicken with spring onion, pepper and mushroom.",
        "Mix together the mirin, soy, rice wine and sugar and stir until the sugar dissolves.",
        "Heat a griddle pan and brush the chicken with the glaze. Griddle turning every 30 seconds or so, brushing the top each time until the chicken is cooked through and the meat burnished a to mahogany glaze."
      ],
      "url": "www_bbc_com_food_recipes_chickenyakitori_11599",
      "title": "Chicken yakitori",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 60
      },
      "serves": "Serves 4Serves 4",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chickenyakitori_11599_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0
    },

    "Chilli and garlic-spiced kale crisps": {
      "ingredients": {
        "chilli": { "quantity": 0.5, "type": "tsp" },
        "garlic": { "quantity": 1, "type": "tsp" },
        "sea salt": { "quantity": 0.25, "type": "tsp" },
        "kale": { "quantity": 1, "type": "cup, chopped" },
        "olive oil": { "quantity": 1, "type": "tbsp" }
      },
      "method": [
        "Preheat the oven to 120C/100C Fan/Gas ½ and line two large baking trays with baking paper.",
        "Mix together the chilli, garlic granules and sea salt.",
        "Put the kale in a large bowl and massage the oil into the leaves. Toss with the seasoning. ",
        "Spread the leaves out in a single layer on two large baking trays. Bake for 20 minutes, turning the trays halfway through cooking.",
        "Lift the leaves from the baking paper using a spatula. Return the trays to the oven, turn off the heat and leave for 12–15 minutes, or until crisp."
      ],
      "url": "www_bbc_com_food_recipes_chilli_and_garlic_spiced_00826",
      "title": "Chilli and garlic-spiced kale crisps",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 60
      },
      "serves": "Serves 4Serves 4",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_and_garlic_spiced_00826_16x9.jpg",
      "isVegetarian": true,
      "recommendations": 0
    },

    "Chilli and coriander fish parcel": {
      "ingredients": {
        "cod": { "quantity": 0.5, "type": "oz" },
        "haddock": { "quantity": 1, "type": "fillet" },
        "fillet": { "quantity": 3, "type": "oz" },
        "lemon juice": { "quantity": 2, "type": "tsp" },
        "fresh coriander leaves": { "quantity": 1, "type": "tbsp" },
        "garlic clove": { "quantity": 1, "type": "clove" },
        "chilli": { "quantity": 1, "type": "bowl (2 cups)" },
        "sugar": { "quantity": 0.25, "type": "tsp" },
        "yoghurt": { "quantity": 2, "type": "tsp" },
        "mangetout": { "quantity": 1, "type": "cup" }
      },
      "method": [
        "Preheat the oven to 200C/180C Fan/Gas 6. ",
        "Place the fish in a non-metallic dish and sprinkle with the lemon juice. Cover and leave in the fridge to marinate for 15-20 minutes.",
        "Put the coriander, garlic and chilli in a food processor or blender and process until the mixture forms a paste. Add the sugar and yoghurt and briefly process to blend.",
        "Lay the fish on a sheet of foil. Coat the fish on both sides with the paste. Gather up the foil loosely and turn over at the top to seal. Return to the fridge for at least 1 hour.",
        "Place the parcel on a baking tray and bake for about 15 minutes, or until the fish is just cooked. Serve with the mangetout."
      ],
      "url": "www_bbc_com_food_recipes_chilli_and_coriander_21270",
      "title": "Chilli and coriander fish parcel",
      "time": {
        "preparation": "1-2 hours1-2 hours",
        "preparationMins": 120,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 150
      },
      "serves": "Serves 1Serves 1",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chilli_and_coriander_21270_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0
    },

    "Steamed chilli soy tofu": {
      "ingredients": {
        "silken tofu": {
          "quantity": 2,
          "type": "piece (2-1/2\" x 2-3/4\" x 1\")"
        },
        "chilli": { "quantity": 1, "type": "bowl (2 cups)" },
        "spring onions": { "quantity": 1, "type": "medium (4-1/8\" long)" },
        "reduced sodium soy sauce": { "quantity": 1, "type": "tbsp" },
        "sesame oil": { "quantity": 1, "type": "tsp" },
        "oyster sauce": { "quantity": 1, "type": "tbsp" },
        "fresh coriander": { "quantity": 2, "type": "tbsp" },
        "steamed rice": { "quantity": 1, "type": "cup, loosely packed" }
      },
      "method": [
        "Fill the base of your steamer with water and bring to the boil. Drain the tofu and place it on a heatproof plate that will fit inside the steamer. Steam the tofu for 15 minutes, then drain off the excess water and carefully transfer to a serving plate.",
        "Heat the soy sauce, sesame oil and oyster sauce together in a small pan until hot. Pour the mixture over the tofu, scatter with the red chilli, spring onion and coriander leaves and serve with steamed rice alongside."
      ],
      "url": "www_bbc_com_food_recipes_chillisoytofu_13912",
      "title": "Steamed chilli soy tofu",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 60
      },
      "serves": "Serves 2Serves 2",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chillisoytofu_13912_16x9.jpg",
      "isVegetarian": true,
      "recommendations": 0
    },

    "Chocolate chip fluffy pancakes": {
      "ingredients": {
        "eggs": { "quantity": 2, "type": "large" },
        "milk": { "quantity": 5, "type": "tbsp" },
        "self raising flour": { "quantity": 1, "type": "cup" },
        "sugar": { "quantity": 2, "type": "tbsp" },
        "salt": { "quantity": 1, "type": "pinch" },
        "dark chocolate chips": { "quantity": 0.25, "type": "cup" },
        "sunflower oil": { "quantity": 1, "type": "tbsp" },
        "butterscotch ice cream": { "quantity": 1, "type": "cup" },
        "maple syrup": { "quantity": 1, "type": "tbsp" },
        "honey": { "quantity": 1, "type": "tbsp" }
      },
      "method": [
        "Whisk together the eggs and milk. ",
        "Place the plain flour, caster sugar and a pinch of salt in large bowl, then make a well in the centre, pour in the liquid and beat with a hand whisk until smooth. ",
        "Stir in the chocolate chips, then cook spoonfuls of the mixture in a non-stick pan, using just a tiny splash of sunflower oil, for 1-2 minutes on each side until puffed and golden. ",
        "Stack and serve with a scoop of butterscotch ice cream and a drizzle of maple syrup."
      ],
      "url": "www_bbc_com_food_recipes_chocchippuffypancake_65968",
      "title": "Chocolate chip fluffy pancakes",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "less than 10 minsless than 10 mins",
        "cookingMins": 10,
        "totalMins": 40
      },
      "serves": "Serves 2Serves 2",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocchippuffypancake_65968_16x9.jpg",
      "isVegetarian": true,
      "recommendations": 0
    },

    "Gluten-free chocolate cake": {
      "ingredients": {
        "dark chocolate": { "quantity": 1, "type": "oz" },
        "cocoa": { "quantity": 1, "type": "tbsp" },
        "unsalted butter": { "quantity": 1, "type": "tbsp" },
        "sugar": { "quantity": 1, "type": "tsp" },
        "eggs": { "quantity": 5, "type": "large" },
        "almonds": { "quantity": 1, "type": "almond" }
      },
      "method": [
        "Preheat the oven to 180C/160 Fan/Gas 4. Grease a 23cm/9in loose-bottomed round cake tin and line with greaseproof paper.",
        "Melt the chocolate in a small heatproof bowl set over a saucepan of gently simmering water, making sure the bowl doesn’t touch the water. ",
        "Put the butter and sugar in a large mixing bowl and beat until light and creamy. Whisk in the egg yolks. Mix in the almonds, then lightly fold in the melted chocolate. ",
        "Using an electric hand whisk, beat the egg whites in a large, clean glass bowl until stiff peaks form. Fold into the almond mixture. Spoon into the prepared tin and level out the top. ",
        "Bake for 30–40 minutes, or until a skewer inserted into the centre of the cake comes out clean. Leave to cool slightly in the tin, then transfer to a cooling rack."
      ],
      "url": "www_bbc_com_food_recipes_chocolate_almond_caprese_27893",
      "title": "Gluten-free chocolate cake",
      "time": {
        "preparation": "30 mins to 1 hour30 mins to 1 hour",
        "preparationMins": 60,
        "cooking": "30 mins to 1 hour30 mins to 1 hour",
        "cookingMins": 60,
        "totalMins": 120
      },
      "serves": "Serves 6-8Serves 6-8",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/chocolate_almond_caprese_27893_16x9.jpg",
      "isVegetarian": true,
      "recommendations": 0
    },

    "Christmas carrots": {
      "ingredients": {
        "carrots": { "quantity": 9, "type": "carrot" },
        "butter": { "quantity": 1, "type": "tbsp" },
        "sugar": { "quantity": 0.5, "type": "oz" },
        "salt": { "quantity": 3, "type": "tsp" },
        "star anise": { "quantity": 4, "type": "pod" }
      },
      "method": [
        "Use a clean scourer to smooth the carrots and remove any peel marks (optional).",
        "In a pan combine 400ml/14fl oz of water, the butter, sugar, salt and star anise. Bring to the boil, then reduce the heat to a gentle simmer and add the carrots. Cook until the carrots are tender (approximately 45 minutes) and the volume of liquid has reduced by half.",
        "Serve the carrots as a side dish with the reduced cooking liquid poured over."
      ],
      "url": "www_bbc_com_food_recipes_christmas_carrots_90489",
      "title": "Christmas carrots",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 60
      },
      "serves": "Serves 4Serves 4",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_carrots_90489_16x9.jpg",
      "isVegetarian": true,
      "recommendations": 0
    },

    "Christmas Martini": {
      "ingredients": {
        "ice": { "quantity": 1, "type": "oz" },
        "vodka": { "quantity": 1, "type": "oz" },
        "chambord": { "quantity": 1, "type": "oz" },
        "cocoa": { "quantity": 1, "type": "oz" },
        "liqueur": { "quantity": 1, "type": "shot (1.5 fl oz)" },
        "creme de cacao": { "quantity": 1.5, "type": "fl oz" },
        "rosemary": { "quantity": 1, "type": "tsp" }
      },
      "method": [
        "Tumble ice cubes generously into a cocktail shaker. Add the vodka, Chambord and cocoa liqueur and shake well. Pour into a martini glass (leaving the ice behind in the shaker) and add a sprig of rosemary. Drink, full of Christmas cheer."
      ],
      "url": "www_bbc_com_food_recipes_christmas_martini_77981",
      "title": "Christmas Martini",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "no cooking requiredno cooking required",
        "cookingMins": 0,
        "totalMins": 30
      },
      "serves": "Serves 1Serves 1",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/christmas_martini_77981_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0
    },

    "The Biker burger": {
      "ingredients": {
        "chuck steak": { "quantity": 12, "type": "oz" },
        "bone marrow": { "quantity": 0.75, "type": "oz" },
        "burger buns": { "quantity": 4, "type": "hamburger bun" },
        "sea salt and freshly ground black pepper": {
          "quantity": 0.25,
          "type": "tsp"
        },
        "mayonnaise": { "quantity": 0.5, "type": "oz" },
        "tomato ketchup": { "quantity": 2, "type": "tbsp" },
        "lemon juice": { "quantity": 1, "type": "tsp" },
        "gherkin": { "quantity": 1, "type": "gherkin" },
        "garlic powder": { "quantity": 1, "type": "tsp" },
        "chipotle paste": { "quantity": 0.5, "type": "tsp" },
        "hot sauce": { "quantity": 1, "type": "tsp" }
      },
      "method": [
        "Make sure the meat is well chilled – if you freeze it, then let it thaw partially, you’ll find it much easier to cut. Put it through a coarse mincer, or chop it very finely by hand. It should be fine enough to stick together when you squeeze a handful. Add the bone marrow, if using.",
        "Season the steak with salt and a little black pepper, then divide the mixture into four and shape each one into a round pattie 2–2.5cm/¾–1in thick. The mincing and chopping will help bring the meat to room temperature, but if it’s still cold, leave the burgers to stand for a while.",
        "For the burger sauce, mix together all the ingredients in a bowl.",
        "Heat a frying pan or your barbecue. When too hot to hold your hand over, add the burgers – there’s no need for oil, as some fat will render out of the meat. Cook for 4 minutes, or until the burgers are well seared and have a thick crust. Flip them and cook for another 3 minutes for rare meat, 4 minutes for medium-rare, 5 for medium and up to 6 for well done. Serve with the burger sauce."
      ],
      "url": "www_bbc_com_food_recipes_classic_burgers_58632",
      "title": "The Biker burger",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "less than 10 minsless than 10 mins",
        "cookingMins": 10,
        "totalMins": 40
      },
      "serves": "Serves 4Serves 4",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_burgers_58632_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0
    },

    "Chocolate and ginger oat biscuits": {
      "ingredients": {
        "unsalted butter": { "quantity": 2, "type": "tbsp" },
        "syrup": { "quantity": 0.5, "type": "oz" },
        "brown sugar": { "quantity": 1, "type": "tsp unpacked" },
        "flour": { "quantity": 0.5, "type": "oz" },
        "baking powder": { "quantity": 2, "type": "tsp" },
        "sea salt": { "quantity": 1, "type": "tsp" },
        "ground ginger": { "quantity": 4, "type": "tsp" },
        "ground cinnamon": { "quantity": 2, "type": "tsp" },
        "rolled oats": { "quantity": 0.5, "type": "cup" },
        "eggs": { "quantity": 1, "type": "large" },
        "ginger": { "quantity": 0.75, "type": "oz" },
        "dark chocolate": { "quantity": 1, "type": "oz" }
      },
      "method": [
        "Preheat the oven to 180C/350F/Gas 4. Line two baking trays with non-stick parchment. Melt the butter and the golden syrup in a pan over a low heat. Set aside to cool slightly.  ",
        "Combine the sugar, flour, baking powder, salt and spices and mix well to combine. Stir in the rolled oats and mix thoroughly. Pour in the melted butter and syrup and stir until well combined. Then stir in the beaten eggs and the stem ginger.",
        "Spoon in even, heaped teaspoons onto the lined baking trays, leaving room for them to spread. Bake in the oven for 8-10 minutes. Remove the biscuits from the oven and set aside to cool completely.",
        "Melt the chocolate in a bowl suspended over a pan of barely simmering water (do not let the bottom of the bowl touch the water). Dip the biscuits in the melted chocolate and place on a cooling rack until the chocolate has set."
      ],
      "url": "www_bbc_com_food_recipes_classic_stem_ginger_83286",
      "title": "Chocolate and ginger oat biscuits",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "30 mins to 1 hour30 mins to 1 hour",
        "cookingMins": 60,
        "totalMins": 90
      },
      "serves": "Makes 24 biscuitsMakes 24 biscuits",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/classic_stem_ginger_83286_16x9.jpg",
      "isVegetarian": true,
      "recommendations": 0
    },

    "Coconut chicken noodle soup": {
      "ingredients": {
        "egg noodles": { "quantity": 1, "type": "cup" },
        "spring onions": { "quantity": 3, "type": "medium (4-1/8\" long)" },
        "coconut milk": { "quantity": 2, "type": "oz" },
        "chicken stock": { "quantity": 1, "type": "oz" },
        "stock": { "quantity": 0.5, "type": "cup" },
        "chicken thighs": { "quantity": 1, "type": "thigh with skin" },
        "drumsticks": { "quantity": 1, "type": "drumstick with skin" },
        "salt and freshly ground black pepper": {
          "quantity": 0.25,
          "type": "tsp"
        }
      },
      "method": [
        "Boil the kettle. Break up the noodles and put into a bowl. Cover with boiling water, set aside, and allow the noodles to soften completely - about 10 minutes. ",
        "Meanwhile, add the white part of the spring onion to a saucepan with the coconut milk, stock and a twist of black pepper. Bring to a simmer, add the chicken thighs and cook for 15-20 minutes. Don’t boil it or the chicken will be tough and the coconut milk will separate (If you use boneless chicken thighs simmer for 8-10 minutes).",
        "Remove the chicken from the saucepan and check that it is completely cooked. If it’s pink near the bone, return it to the stock for another 5 minutes. When cooked, set the chicken thighs aside to cool slightly.",
        "Drain the noodles and add them to the coconut liquid. Chop the chicken from the bone and stir into the soup with the green part of the spring onion. Season with salt and black pepper."
      ],
      "url": "www_bbc_com_food_recipes_coconut_chicken_noodle_20610",
      "title": "Coconut chicken noodle soup",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 60
      },
      "serves": "Serves 1Serves 1",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coconut_chicken_noodle_20610_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0
    },

    "Coffee crème caramels": {
      "ingredients": {
        "coffee granules": { "quantity": 1, "type": "tbsp" },
        "sugar": { "quantity": 0.5, "type": "oz" },
        "milk": { "quantity": 1, "type": "oz" },
        "eggs": { "quantity": 3, "type": "large" },
        "egg yolks": { "quantity": 3, "type": "large" }
      },
      "method": [
        "Heat the oven to 150C/300F/Gas 2. Have ready four ovenproof ramekins.",
        "Put the coffee, caster sugar and milk in a saucepan and bring gently up to simmering point, stirring occasionally to dissolve the coffee. Do not boil. Remove from the heat and set aside while you make the caramel.",
        "For the caramel, put the sugar and 50ml/2fl oz of water in a heavy based-pan. Heat gently until the sugar has dissolved, then bring to the boil. Boil for a few minutes, or until the syrup has turned to a dark golden-brown caramel.",
        "As soon as the caramel has reached the right colour, pour it into the ramekins. Take care because it will be extremely hot. Leave to set (but do not put it in the fridge).",
        "Beat the eggs and egg yolks together in a bowl. Gently pour on the coffee-flavoured milk and whisk until well combined. Strain into a jug. Pour this mixture into the ramekins. Put the ramekins in a large, deep oven tray. Pour hot water into the tray so that it comes three-quarters of the way up the ramekins. Cover the tray with foil and place in the oven. Bake for 40-45 minutes, or until the custards are just set but still have a bit of wobble.",
        "Remove from the oven dish and leave to cool completely, then refrigerate for 24 hours.",
        "To turn out, first run a thin-bladed knife around the outside of the custard then put a plate over the top and invert the ramekin so that the custard and its lovely caramel juices come out onto the dish. Serve straight away."
      ],
      "url": "www_bbc_com_food_recipes_coffee_crme_caramels_75585",
      "title": "Coffee crème caramels",
      "time": {
        "preparation": "overnightovernight",
        "preparationMins": 720,
        "cooking": "30 mins to 1 hour30 mins to 1 hour",
        "cookingMins": 60,
        "totalMins": 780
      },
      "serves": "Makes 4Makes 4",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coffee_crme_caramels_75585_16x9.jpg",
      "isVegetarian": true,
      "recommendations": 0
    },

    "Coleslaw": {
      "ingredients": {
        "cabbage": { "quantity": 1, "type": "cup, shredded" },
        "onion": { "quantity": 1, "type": "small" },
        "carrot": { "quantity": 1, "type": "carrot" },
        "sugar": { "quantity": 1, "type": "oz" },
        "cayenne": { "quantity": 1, "type": "pinch" },
        "chilli": { "quantity": 1, "type": "bowl (2 cups)" },
        "flour": { "quantity": 1, "type": "oz" },
        "eggs": { "quantity": 2, "type": "large" },
        "yolks": { "quantity": 1, "type": "large" },
        "butter": { "quantity": 1, "type": "tbsp" },
        "whole milk": { "quantity": 1, "type": "cup" },
        "red wine vinegar": { "quantity": 1, "type": "tbsp" },
        "mustard": { "quantity": 2, "type": "tsp" }
      },
      "method": [
        "Grate or shred the cabbage and carrots and onions (if you're using them). Put them in a big bowl and set aside.",
        "Mix the sugar, cayenne and flour in a bowl that will go into your double boiler. Season well with salt and pepper. Now whisk in all remaining ingredients except the mustard, in the order in which they are listed. In the meantime, heat the water in the bottom of the double boiler. ",
        "Put the bowl over the heat and start whisking. Do not stop for more than a few moments while the mixture is cooking. Cooking will take something like 15 minutes, and you will know that the sauce is done when it's thick enough to coat the back of a spoon. Strain into a clean bowl to eliminate any lumps, and whisk in the mustard. (Use the larger amount if you want a hotter result, the smaller if you want just a mustardy accent.)",
        "Toss the slaw with half the dressing and toss. If it needs more, add it in small doses till you've reached the desired consistency. Serve immediately or leave, covered, in the fridge, for 1-2 days with 1 or 2 tosses every day."
      ],
      "url": "www_bbc_com_food_recipes_coleslaw_68108",
      "title": "Coleslaw",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 60
      },
      "serves": "Serves 4Serves 4",
      "image":
        "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/coleslaw_68108_16x9.jpg",
      "isVegetarian": true,
      "recommendations": 0
    }
  }
}
