{
  "Ten-minute pizza": {
    "ingredients": {
      "sugar" :       {"quantity" : 1, "type" : "tbsp"},
      "flour":        {"quantity": 1, "type": "cup"},
      "olive oil":    {"quantity": 8, "type": "tbsp"},
      "salt":         {"quantity": 1, "type": "tsp"},
      "tomato paste": {"quantity": 1, "type": "can"},
      "mushrooms":    {"quantity": 1, "type": "package"},
      "prosciutto":   {"quantity": 4, "type": "slices"},
      "gorgonzola":   {"quantity": 4, "type": "oz"},
      "egg":          {"quantity": 1, "type": "egg"}
    },
    "method":
      ["Preheat the oven to 200C/400F/Gas 6.","For the pizza base, place the flour, oil, water and salt into a food processor and blend together until a dough is formed. Tip out onto a floured work surface and knead. Shape into a round base about 20cm/8in wide. ","Place into a frying pan over a high heat and brown the base, then using a mini-blowtorch, crisp the top of the pizza. (Alternatively you can do this under the grill.) ","For the topping, spread tomato purée over the top of the base. ","Fry the mushrooms in a dry frying pan then scatter over the tomato purée. Arrange the prosciutto and cheese on top. ","Crack an egg into the middle, then place into the oven for five minutes to finish cooking. ","Serve on a large plate, and slice into wedges to serve."],
    "url":"www_bbc_com_food_recipes_10minutepizza_87314",
    "title":"Ten-minute pizza",
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a3/Eq_it-na_pizza-margherita_sep2005_sml.jpg",
    "time":{
        "preparationMins":30,
        "cookingMins":10,
        "totalMins":40},
    "serves":"Makes 1",
    "isVegetarian":false,
    "recommendations":0,
    "categories": ["italian","quick"]},
    "Schichttorte": {
      "ingredients": {
        "milk" : {"quantity":1, "type": "tbsp"},
        "rum": {"quantity": 1, "type": "tbsp"},
        "sugar": {"quantity":9, "type": "oz" },
        "chocolate": {"quantity":3, "type": "oz" },
        "vanila": {"quantity":1, "type": "tbsp" },
        "golden syrup": {"quantity":1, "type": "tbsp" },
        "butter": {"quantity":5, "type": "oz" },
        "apricot jam": {"quantity":6, "type": "tbsp" },
        "lemon": {"quantity":1, "type": "" },
        "egg": {"quantity":10, "type": "egg" },
        "flour": {"quantity":5, "type": "oz" }
      },
      "method": [
        "Whisk the egg yolks in the bowl of a freestanding mixer on a high speed for five minutes, until pale, thick and creamy.  ",
      "In a separate bowl, beat the butter and sugar together until pale and creamy. Add the lemon zest and vanilla paste and mix well. Add the whisked egg yolks and beat well. Add the flour and cornflour and mix.",
      "In a clean, grease-free bowl, whisk the egg whites until soft peaks form when the whisk is removed. Stir one-third of the egg whites into the batter to loosen the consistency. Then gently fold the remaining egg whites into the egg yolk mixture. ",
      "Preheat the grill to high.  ",
      "Grease a 20cm/8in round springform tin with oil and line the base with parchment paper.  ",
      "Spoon some of the batter into the base of the cake tin and spread evenly across the bottom. Give the tin a gentle side-to-side shake to even out the top of the batter. Place on a shelf 10cm/4in below the grill and cook for two minutes, or until light golden-brown.  ",
      "Remove from the grill, add another spoonful of batter, spread out with a pastry brush, and place under the grill for three minutes, or until dark golden-brown. Continue layering and grilling until you have 20 layers alternating in colour from light golden-brown to dark golden-brown. (Or continue until you have used all the batter.) ",
      "Remove from the grill and leave to cool in the tin for five minutes.  Carefully release from the tin and turn out onto a wire rack to cool.",
      "Melt the apricot jam in a small pan over a low heat. Pass through a fine sieve, then brush the top and sides of the cake with jam. This will help the glaze stick to the cake.",
      "For the chocolate glaze, melt the butter in a small pan with the golden syrup, rum and vanilla paste and bring to the boil. Remove from the heat, allow to cool for five minutes. Stir in the chocolate until melted. Transfer to a bowl and allow to cool to a coating consistency.  ",
      "Place a large piece of greaseproof paper under the wire rack holding the cake. Pour the glaze evenly over the cake to cover completely. Any excess glaze will be caught on the greaseproof paper and can be reused to fill in any unglazed areas of the cake.  ",
      "For the vanilla glaze, sieve the icing sugar into a bowl. Add the rum, vanilla paste and milk, stirring until completely smooth. Drizzle over the chocolate glaze. "
      ]  ,
      "url": "www_bbc_com_food_recipes__schichttorte_49934",
      "title": "Schichttorte",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "1 to 2 hours1 to 2 hours",
        "cookingMins": 120,
        "totalMins": 150
      },
      "serves": "Serves 8-10Serves 8-10",
      "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg",
      "isVegetarian": true,
      "recommendations": 0,
      "categories": ["dessert"]
    },
    "Ajitsuke tamago (Japanese pickled eggs)": {
      "ingredients": {
        "egg": {"quantity": 6, "type": "egg"},
        "soy sauce":{"quantity": 4, "type": "fl-oz"},
        "mirin":{"quantity": 4, "type": "fl-oz"},
        "sake":{"quantity": 4, "type": "fl-oz"},
        "sugar":{"quantity": 6, "type": "tbsp"}
      },
      "method": [
        "Three-quarters fill a medium saucepan with water and bring to the boil. Once boiling, carefully add the eggs to the pan and boil for exactly six minutes. Use a timer as the eggs want to be just perfect with a lovely runny yolk.",
        "Once cooked, transfer to a bowl of iced-cold water and carefully peel. Be aware that the eggs are still runny and that you need to handle with care. Add the remaining ingredients, including 100ml/3½fl oz water to another saucepan, gently bring to a simmer and cook until the sugar is dissolved. Remove from the heat and leave to cool.",
        "Place the eggs in a small container that will fit neatly as you want the liquid to nearly cover the eggs. Pour in the cold marinade and place a small piece of muslin or a jay cloth over the eggs - this helps to make sure the eggs get an even coating of the marinade as the liquid will soak in to the material as well as weighing the eggs down in the liquid.        ",
        "Marinate for at least 12 hours, but ideally 24."
      ],
      "url": "www_bbc_com_food_recipes_ajitsuke_tamago_japanese_65686",
      "title": "Ajitsuke tamago (Japanese pickled eggs)",
      "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg",
      "time": {
        "preparation": "overnightovernight",
        "preparationMins": 720,
        "cooking": "less than 10 minsless than 10 mins",
        "cookingMins": 10,
        "totalMins": 730
      },
      "serves": "Makes 6Makes 6",
      "isVegetarian": true,
      "recommendations": 0,
      "categories" : ["japanese"]
    },
    "Ale fruit loaf": {
      "ingredients": {
        "currants": {"quantity": 2, "type": "oz"},
        "rasins": {"quantity": 5, "type": "oz"},
        "peel": {"quantity": 5, "type": "oz"},
        "beer": {"quantity": 17,  "type": "fl-oz"},
        "sugar": {"quantity": 7, "type": "oz"},
        "flour": {"quantity": 6, "type": "oz"},
        "spice": {"quantity": 7, "type": "oz"},
        "egg": {"quantity": 3, "type": "egg"}
      },
      "method": [
        "Put the dried fruit into a large pan and cover with the bottled beer.",
        "Gently heat the fruit until the beer is hot, but not boiling. Remove from the heat, cover and leave overnight.",
        "When you are ready to cook the loaf, preheat the oven to 140C/275F/Gas 1.",
        "Add the sugar, flours, mixed spice and eggs to the fruit mixture. Stir well until all the ingredients are combined.",
        "Divide the mixture between two greased 500g/1Ib 2oz loaf tins. ",
        "Bake for 1¼ hours until risen, pale brown and firm to the touch.",
        "Cover with a tea towel and leave on a wire rack to cool.",
        "Wrap the loaves tightly in cling film and keep in a cool, dry place for up to 6 weeks. This loaf is delicious buttered with raspberry jam or served with a piece of Wensleydale cheese."
      ],
      "url": "www_bbc_com_food_recipes_alefruitloaf_83744",
      "title": "Ale fruit loaf",
      "image": "https://i.pinimg.com/originals/7f/26/d4/7f26d487f34123ebcf24b69d3a55ce82.jpg",
      "time": {
        "preparation": "overnightovernight",
        "preparationMins": 720,
        "cooking": "1 to 2 hours1 to 2 hours",
        "cookingMins": 120,
        "totalMins": 840
      },
      "serves": "Makes 2 loavesMakes 2 loaves",
      "isVegetarian": true,
      "recommendations": 0,
      "category": ["cake", "dessert"]
    },
    "Nigel Slater's all-in-one roast beef rib": {
      "ingredients": {
        "potatoes": {"quantity": 4, "type": "lb"},
        "beef": {"quantity": 8, "type": "lb"},
        "horseradish": {"quantity": 3, "type": "tbsp"},
        "peppercons": {"quantity": 2, "type": "tbsp"},
        "salt": {"quantity": 2, "type": "tbsp"},
        "carrots": {"quantity": 8, "type": "vegetable"},
        "parsnips": {"quantity": 8, "type": "vegetable"}
      },
      "method": [
        "Preheat the oven to 220C/425F/Gas 7.",
        "Boil the peeled and sliced potatoes in a large pan of salted water until soft to the point of a knife. ",
        "Drain the potatoes and shake in a colander so that the edges fluff up.",
        "In a saucepan, melt the dripping with the horseradish, salt and pepper.",
        "Score the beef all over with a sharp knife.",
        "Layer all the chopped vegetables in a large oven tray and place the beef on top. Tip the potatoes into another tray.",
        "Ladle most of the horseradish glaze over the top of the vegetables and meat (reserving some for the potatoes). Roast the meat in the oven for 20 minutes then reduce the temperature to 160C/325F/Gas 3 and baste the meat with the dripping.",
        "Pour the remaining horseradish glaze over the potatoes and place them in the oven to cook for the duration of the beef cooking time.",
        "Roast the meat for two hours,basting it with the dripping every half hour.",
        "Allow the meat to rest under foil for 30 minutes before serving.  If necessary, you could turn up the oven to crisp the potatoes while the meat is resting."
      ],
      "url": "www_bbc_com_food_recipes_all-in-one_rib_roast_75464",
      "title": "Nigel Slater's all-in-one roast beef rib",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "over 2 hoursover 2 hours",
        "cookingMins": 120,
        "totalMins": 150
      },
      "serves": "Serves 6-8Serves 6-8",
      "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-in-one_rib_roast_75464_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0,
      "category": ["meat", "roast"]
    },
    "All-day breakfast frittata":{
      "ingredients": {
        "bacon": {"quantity": 2, "type": ""},
        "mushrooms": {"quantity": 5, "type": "oz"},
        "spinach": {"quantity": 3, "type": "oz"},
        "potatoes": {"quantity": 8, "type": "oz"},
        "cherry tomatoes": {"quantity": 4,  "type": "oz"},
        "egg": {"quantity": 4, "type": "egg"}
      },
      "method": [
        "Preheat the grill to medium-high. Grill the bacon until it is browned on both sides. Remove from the grill and set aside. ",
        "Spray a small non-stick frying pan with spray oil and place on a medium-high heat. When the pan is hot, fry the mushrooms for 5 minutes, stirring frequently, until they are browned and softened. Set aside.",
        "Rinse the spinach under cold water and drain it in a sieve. Add it to the frying pan and cook for 1-2 minutes, stirring all the time, so that the leaves steam in the residual water. When the spinach is cooked, but still bright green, transfer back to the sieve and press with the back of a spoon to squeeze any remaining water from the leaves. Set aside.",
        "Wipe the frying pan clean, spray with oil and return to a medium heat. Fry the potatoes and tomatoes without stirring too much, so that the vegetables take on some colour but don’t fall apart – about 5 minutes.",
        "Meanwhile, beat the eggs in a fairly large bowl. Chop the cooked bacon and the spinach. Add to the eggs along with the cooked mushrooms. Season the eggs with salt and freshly ground black pepper. ",
        "When the tomatoes and potatoes are golden-brown in places, spoon them into the eggs with the other vegetables. Give the egg mixture a brief stir, then pour it back into the frying pan and place it back over the heat. Cook gently over a medium heat for 10 minutes, until the egg looks set around the edges (it may be a little runny on the top). ",
        "Place the pan under the grill for 2 minutes to finish cooking the frittata on top. Turn out the frittata onto a plate and let it cool slightly before cutting into wedges. Serve with a crunchy salad for maximum veggies."
      ],
      "url": "www_bbc_com_food_recipes_all-day_breakfast_12416",
      "title": "All-day breakfast frittata",
      "time": {
        "preparation": "less than 30 minsless than 30 mins",
        "preparationMins": 30,
        "cooking": "10 to 30 mins10 to 30 mins",
        "cookingMins": 30,
        "totalMins": 60
      },
      "serves": "Serves 2Serves 2",
      "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/all-day_breakfast_12416_16x9.jpg",
      "isVegetarian": false,
      "recommendations": 0,
      "category" : ["breakfast", "mexican"]
    },
"15 minute pasta":{
  "ingredients": {
    "flour":        {"quantity": 1, "type": "cup"},
    "olive oil":    {"quantity": 8, "type": "tbsp"},
    "penne pasta": {"quantity": 1, "type": "package"},
    "Parma ham": {"quantity": 2, "type": "package"},
    "small brown chestnut mushrooms": {"quantity": 1, "type": "package"},
    "crème fraîche": {"quantity": 7, "type": "oz"},
    "Parmesan": {"quantity": 3.5, "type": "oz"},
    "parsley": {"quantity": 2, "type": "tbsp"}
  },
  "method":
    ["Cook the pasta in a pan of boiling salted water according to the packet instructions. Drain and set aside","Heat a frying pan until hot. Add the pieces of Parma ham and fry until crisp, remove half of the ham onto a plate and set aside. Add the mushrooms to the pan and fry for two minutes. Add the crème fraîche and bring up to the boil. Add the pasta, Parmesan and parsley and toss together over the heat. Season well with salt and pepper.","Serve with a green salad and crunchy bread."],
  "url":"www_bbc_com_food_recipes_15_minute_pasta_33407",
  "title":"15 minute pasta",
  "time":{
      "preparation":"less than 30 minsless than 30 mins",
      "preparationMins":30,
      "cooking":"10 to 30 mins10 to 30 mins",
      "cookingMins":30,"totalMins":60},
  "serves":"Serves 6Serves 6",
  "image":"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/15_minute_pasta_33407_16x9.jpg",
  "isVegetarian":false,
  "recommendations":0,
  "categories": ["pasta","italian","quick"]
  },
  "Lemon curd ice cream":{
    "ingredients": {
      "heavy cream": {"quantity": 8, "type": "oz"},
      "lemon curd": {"quantity": 12, "type": "oz"},
      "lemon": {"quantity": 1 , "type" : ""}
    },
    "method":
      ["Whisk the cream until floppy,  then whisk in the lemon curd along with the lemon juice and zest. ","Spread in a serving dish and freeze for at least four hours."],
    "url":"www_bbc_com_food_recipes_3wayswithlemoncurd_67266",
    "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/_schichttorte_49934_16x9.jpg",
    "title":"Lemon curd ice cream",
    "time":{
      "preparation":"over 2 hoursover 2 hours",
      "preparationMins":120,
      "cooking":"no cooking requiredno cooking required",
      "cookingMins":0,
      "totalMins":120},
    "serves":"Makes 290ml/½ pintMakes 290ml/½ pint",
    "isVegetarian":true,
    "recommendations":0,
    "categories": ["dessert"]
  },
  "Mary Berry's mulled wine": {
    "ingredients": {
      "orange": {"quantity": 1, "type": ""},
      "lemon": {"quantity": 3, "type": ""},
      "cloves": {"quantity": 12 ,"type": ""},
      "clementines": {"quantity": 2, "type": ""},
      "red wine": {"quantity": 2,"type": "bottles"},
      "cinnamon": {"quantity": 2, "type": "sticks"}
    },

		"method": [
			"Carefully peel the zest very thinly from the orange and lemons using a vegetable peeler. Squeeze out the juice and reserve. ",
			"Stick the cloves into the satsumas. ",
			"Pour the wine, 1.2 litres/2 pints of cold water, and the citrus peel and juices into a large, heavy-based saucepan. Add the clove-studded satsumas and cinnamon sticks. Bring the mixture just to the boil, then reduce the heat until the mixture is simmering, cover the pan with the lid, and continue to simmer for about 1 hour. Stir in the sugar gradually during cooking, until the mulled wine is sweetened to your liking (you may not need all of the sugar). ",
			"Strain the mulled wine and serve hot in cups."
		],
		"url": "www_bbc_com_food_recipes_mulled_wine_46955",
		"title": "Mary Berry's mulled wine",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 12Serves 12",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/mulled_wine_46955_16x9.jpg",
		"isVegetarian": true,
		"categories": ["alcohol"]
	}
}
