{
	"Chicken in white wine sauce": {
		"ingredients": [
			"4 chicken breasts",
			"1 onion",
			"1 carrot",
			"1 stick celery",
			"1 bay leaf",
			"6 peppercorns",
			"30g/1oz butter",
			"30g/1oz plain flour",
			"140ml/5fl oz white wine",
			"1 free-range egg yolk",
			"2-3 tbsp double cream",
			"squeeze lemon juice",
			"salt and freshly ground black pepper ",
			"small handful fresh parsley, chopped"
		],
		"method": [
			"Place the chicken breasts in a pan with the vegetables and peppercorns and cover with water. ",
			"Bring gradually to the boil and simmer until the chicken is cooked all the way through - about 30 minutes. ",
			"Carefully remove the chicken breasts from the cooking liquid and keep them warm. ",
			"Strain the cooking liquid into a clean pan, discarding the cooked vegetables. Reserve about 450ml/16fl oz of the liquid.",
			"Melt the butter in a separate pan and add the flour. Cook until the mixture forms a smooth paste which leaves the sides and base of pan cleanly.",
			"Gradually add the reserved cooking liquid to the mixture, a ladle at a time, allowing to boil after each addition before beating well. Stir until the mixture blends smoothly.",
			"Pour the white wine into the sauce and reduce the heat to low. ",
			"In a small bowl, combine the egg yolk with the double cream. Stir the egg and cream into the sauce. ",
			"Add a squeeze of lemon juice and salt and freshly ground black pepper to taste.",
			"Cut the cooked chicken into bite-sized pieces and stir into the sauce. ",
			"Garnish with chopped fresh parsley and serve at once."
		],
		"url": "www_bbc_com_food_recipes_mirandaschickeninwhi_85673",
		"title": "Chicken in white wine sauce",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 4Serves 4",
		"isVegetarian": false,
		"recommendations": 0,
		"image":
			"https://www.monpetitfour.com/wp-content/uploads/2017/05/Chicken-in-White-Wine-Sauce_3-copy.jpg"
	},

	"Feijoada": {
		"ingredients": [
			"1kg/2lb 4oz dried black beans",
			"4 tbsp olive oil",
			"500g/1lb 2oz dry-smoked pork ribs, fat trimmed, cut into individual ribs",
			"1kg/2lb 4oz unsmoked pork ribs, fat trimmed, cut into individual ribs",
			"1 large onion, roughly chopped",
			"1 head garlic, cloves finely chopped",
			"500g/1lb 2oz smoked bacon, cut into medium-sized pieces",
			"500g/1lb 2oz pork belly, cut into medium-sized chunks",
			"200g/7oz smoked pork sausage, cut into medium-sized chunks",
			"salt and freshly ground black pepper",
			"2 tbsp dried chilli flakes (optional)"
		],
		"method": [
			"Soak the black beans in 2 litres/3½ pints of cold water overnight.",
			"When the beans have soaked, heat half of the oil in a lidded frying pan (large enough to fit all the ribs in at once) over a medium heat. ",
			"Season the smoked and unsmoked pork ribs all over with salt and freshly ground black pepper. Fry the ribs for 4-5 minutes on each side, or until browned on both sides.",
			"Add the onion and garlic and continue to fry for a further 2-3 minutes, stirring well, until softened.",
			"Add 250ml/9fl oz water and bring it to a simmer, then cover the frying pan with the lid and cook for 18-20 minutes, topping up the pan with water as necessary if the liquid evaporates too quickly. Transfer the pan contents to a large casserole and set aside.",
			"Wipe the frying pan clean with kitchen paper, then heat the remaining oil over a medium heat. Fry the bacon, pork belly and sausage, in batches, until browned all over (do not overcrowd the pan). Transfer the browned meat to the casserole.",
			"Add the soaked black beans and the soaking liquid to the casserole and stir well. Bring the mixture to the boil, then reduce the heat until the mixture is simmering gently. Simmer, half-covered, for about 2½ hours, topping up the casserole with water every so often to prevent it from drying out. The feijoada is ready when the ribs are tender and the meat is almost falling off the bone.",
			"Just before serving, season the feijoada with salt and freshly ground black pepper, if necessary, and with chill flakes, if desired."
		],
		"url": "www_bbc_com_food_recipes_andre_and_andersons_49427",
		"title": "Feijoada",
		"time": {
			"preparation": "overnightovernight",
			"preparationMins": 720,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 840
		},
		"serves": "Serves 6-8Serves 6-8",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/andre_and_andersons_49427_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Angel food cake with lemon curd": {
		"ingredients": [
			"125g/4½oz plain flour",
			"300g/10½oz caster sugar",
			"10 large free-range egg whites",
			"2 large lemons, grated zest only",
			"1 tbsp lemon juice",
			"1 tsp cream of tartar ",
			"½ tsp salt",
			"10 large free-range egg yolks",
			"400g/14oz caster sugar",
			"4 large lemons, juice only (approximately 200ml/7fl oz) ",
			"2 large lemons, grated zest only",
			"175g/6oz unsalted butter, cubed",
			"2 passion fruit",
			"300ml/10fl oz whipping cream",
			"½ tsp vanilla extract"
		],
		"method": [
			"Preheat the oven to 180C/350F/Gas 4 (fan 160C) and arrange an oven shelf in the bottom third of the oven. Sift the flour and 100g/3½oz of the caster sugar together in a bowl and set aside.",
			"Whisk the egg whites in a large bowl with an electric hand whisk or mixer on a high speed for one minute until frothy. Add the lemon zest, lemon juice, cream of tartar and salt and continue whisking for 2-3 minutes, or until soft peaks form when the whisk is removed from the bowl. Increase the speed and add the remaining 200g/7oz of caster sugar, one tablespoon at a time to form firm, but not stiff peaks. ",
			"Sprinkle over one-third of the flour mixture and fold gently to combine. Repeat with the remaining two-thirds of the flour mixture folding gently to keep as much air in the mixture as possible.",
			"Transfer the batter to a 25cm/10in angel food cake pan. Gently run a knife through the centre of the batter to remove any pockets of air. Cook for 45-50 minutes, or until a skewer inserted into the centre comes out clean. ",
			"Remove from the oven and immediately turn upside down onto the tin’s cooling legs, or place over the neck of a wine bottle. Leave to cool for at least one hour. ",
			"Run a knife around the inner and outer edges of cake to remove it from the pan. Invert onto a plate. Carefully use a palette knife to separate the cake from the base of the pan. Leave to cool on a wire rack.",
			"For the lemon curd, mix the egg yolks, sugar, lemon juice and lemon zest together in a large pan. Cook over a low heat, stirring with a wooden spoon, making sure to stir the sides and base of the pan.  Cook for 5-7 minutes, or until the mixture coats the back of a spoon. Remove from the heat and stir in the butter. Pass through a sieve into a large jug. Fill two 350g/12oz glass jars with the lemon curd and seal with lids. Cover the remaining curd with cling film and leave to cool. ",
			"For the topping, whisk the cream and vanilla extract in a bowl until soft peaks form when the whisk is removed. Spoon the topping over the angel food cake and, using a palette knife, coat the top and sides of the cake, smoothing as you go.",
			"Cut the passion fruit in half and scoop out the seeds. Stir the passion fruit into the reserved, cooled lemon curd and drizzle over the angel food cake before serving. You may want to use just one of the jars of lemon curd to serve with the cake and save the other to eat separately. "
		],
		"url": "www_bbc_com_food_recipes_angel_food_cake_with_04002",
		"title": "Angel food cake with lemon curd",
		"time": {
			"preparation": "1-2 hours1-2 hours",
			"preparationMins": 120,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 180
		},
		"serves":
			"Serves 12-15, and makes two 350g/12oz jars of lemon curdServes 12-15, and makes two 350g/12oz jars of lemon curd",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/angel_food_cake_with_04002_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Swedish Christmas Glögg": {
		"ingredients": [
			"1 bottle red wine (quality doesn’t matter) ",
			"1-2 sticks cinnamon ",
			"5g dried root ginger ",
			"5g dried Seville orange peel (or other orange if you can't get Seville) ",
			"7 green cardamom pods ",
			"15-16 whole cloves ",
			"80g/3oz sugar ",
			"flaked almonds  ",
			"raisins ",
			"splash of either vodka, aquavit, rum or cognac (optional)"
		],
		"method": [
			"Pour the wine into a pan, add the rest of the ingredients and heat to around 80C/176F, stirring to dissolve the sugar. ",
			"Remove from the heat and leave to infuse for at least an hour. ",
			"Strain the mixture and return the mulled wine to the bottle - use a funnel to make life easier for yourself. The wine can be kept for around a week. ",
			"To serve, pour the wine into a saucepan and heat it.",
			"Place a few flaked almonds and raisins in the bottom of your serving cups, and pour the glögg over the mixture. ",
			"If you want to give your glögg a kick, add a splash of either vodka, aquavit, rum or cognac just after you’ve reheated the wine. "
		],
		"url": "www_bbc_com_food_recipes_annikas_glgg_annikas_32356",
		"title": "Swedish Christmas Glögg",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "less than 10 minsless than 10 mins",
			"cookingMins": 10,
			"totalMins": 40
		},
		"serves": "Makes 1 bottleMakes 1 bottle",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/annikas_glgg_annikas_32356_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Angela's slow roasted ginger pork": {
		"ingredients": [
			"1 shoulder of pork weighing approximately 4kg/8lb 2oz skin scored",
			"4 garlic cloves, peeled and roughly chopped",
			"4cm/1½inch piece fresh root ginger, peeled and roughly chopped",
			"3 tbsp olive oil",
			"4 tbsp white wine vinegar"
		],
		"method": [
			"Preheat the oven to 220C/425F/Gas mark 7.",
			"Place the pork skin-side up on a rack over a roasting tin. Place the garlic and ginger in a pestle and mortar or food processor and pound or process until you get a rough paste then mix in the oil and vinegar. Rub the paste all over the scored skin of the pork. Place in the preheated oven and cook for 30 minutes.",
			"Remove the pork from the oven, reduce the temperature to 150C/300F/Gas 2. Turn the pork over with the skin side down on the rack and return to the oven and cook for 4-5 hours.",
			"Remove from the oven and turn up to the highest setting 220C/425F/Gas 7. Turn the pork over to the crackling side on the rack and roast in the hot oven for the final 20 minutes to crisp up the crackling. Leave to stand for 10-15 minutes before carving.",
			"To serve, cut away the crackling with a sharp knife and break it up into pieces then carve the meat. It should be very tender and succulent."
		],
		"url": "www_bbc_com_food_recipes_angelasslowroastedgi_71381",
		"title": "Angela's slow roasted ginger pork",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 6-8Serves 6-8",
		"isVegetarian": false,
		"recommendations": 0,
		"image":
			"https://www.eatwell101.com/wp-content/uploads/2016/02/best-Slow-Cooked-Pork-Shoulder.jpg"
	},
	"Easy cookies": {
		"ingredients": [
			"250g/9oz unsalted butter, softened",
			"150g/5oz golden granulated sugar",
			"2-3 drops vanilla extract",
			"1 free-range egg, beaten",
			"220g/½lb plain flour",
			"1 tsp baking powder",
			"pinch salt",
			"1-2 handfuls chocolate chips (optional)",
			"1-2 handfuls nuts (such as peanuts, macadamia nuts, or brazil nuts) (optional)",
			"1-2 handfuls crystallised ginger"
		],
		"method": [
			"In a large bowl, beat together the butter and sugar until pale, fluffy and well combined. ",
			"Beat in the vanilla extract and beaten egg, a little at a time, until well combined. ",
			"Sift the flour, baking powder and salt into the bowl and mix well until smooth and combined.",
			"Lay a large sheet of cling film (approx 30cm/12in square) onto a work surface and pour the cookie batter into the middle of it. ",
			"Bring the far edge of the cling film over the cookie batter and towards you, then use the side of a palette knife to press the batter against the length of cling film. Wrap the cling film around the dough to form a sausage shape 7–8cm/3–4in wide. Twist the ends to secure and chill in the fridge for one hour, or until firm. (NB: At this stage, the cookie dough can be frozen until needed.)",
			"Preheat the oven to 200C/180 Fan/Gas 6.",
			"When the cookie dough is firm, cut 1cm/½in slices from it and arrange them on a baking tray with enough space around each to allow for the mixture spreading.",
			"The cookies can be cooked as they are. Alternatively, sprinkle over toppings of your choice, such as chocolate chips, nuts or crystallised ginger before cooking. ",
			"Transfer the cookies to the oven and bake for 8–10 minutes, or until the edges are pale golden-brown.",
			"Set the cookies aside for 1–2 minutes, then transfer to a wire rack to cool."
		],
		"url": "www_bbc_com_food_recipes_anytimecookies_92185",
		"title": "Easy cookies",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "1 to 2 hours1 to 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Makes 30Makes 30",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/anytimecookies_92185_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},
	"Paul's apple and blackberry crumble": {
		"ingredients": [
			"500g/1lb 2oz cooking apples, peeled, cored and sliced",
			"25g/1oz butter                 ",
			"75g/2½oz caster sugar     ",
			"250g/9oz blackberries                                         ",
			"100g/3½oz plain wholemeal flour",
			"75g/2½oz porridge oats",
			"2 tsp shony (powdered seaweed)",
			"100g/3½oz soft dark brown sugar",
			"75g/2½oz unsalted butter, chilled, cut into roughly 1cm/½in cubes",
			"25g/1oz sunflower seeds",
			"15g/½oz pumpkin seeds"
		],
		"method": [
			"Preheat the oven to 180C/350F/Gas 4. ",
			"For the filling, put the apples, butter and sugar in a pan. Cook over a medium heat for about 10 minutes, stirring from time to time, until the sugar has dissolved and the fruit is just beginning to collapse. Taste and add more sugar if required. Stir in the blackberries and transfer the mixture to an oven dish and set aside.  ",
			"To make the crumble topping, combine the flour, oats, powdered seaweed and sugar in a bowl. Add the butter and rub in lightly with your fingertips until the mix resembles coarse breadcrumbs. ",
			"Using a pestle and mortar or a small food processor, crush the seeds so they break down a little. Do not reduce them to a fine powder. Stir the crushed seeds into the crumble mixture.",
			"Spoon the crumble mixture over the filling. Bake for 35-40 minutes, or until golden-brown and bubbling. Leave to settle for about 10 minutes before serving. "
		],
		"url": "www_bbc_com_food_recipes_apple_and_blackberry_33697",
		"title": "Paul's apple and blackberry crumble",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 6Serves 6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/apple_and_blackberry_33697_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},
	"Apple and cinnamon breakfast pot": {
		"ingredients": [
			"150g/5½oz fat-free Greek-style yoghurt",
			"1 tbsp rolled oats ",
			"1 small apple, grated",
			"25g/1oz blueberries ",
			"pinch ground cinnamon",
			"low-calorie sweetener, to taste (optional)"
		],
		"method": [
			"Mix the yoghurt and oats together in a bowl, cover and refrigerate overnight. ",
			"When ready to eat, stir in the apple, blueberries, cinnamon and sweetener, if using. Serve."
		],
		"url": "www_bbc_com_food_recipes_apple_and_cinnamon_79023",
		"title": "Apple and cinnamon breakfast pot",
		"time": {
			"preparation": "overnightovernight",
			"preparationMins": 720,
			"cooking": "no cooking requiredno cooking required",
			"cookingMins": 0,
			"totalMins": 720
		},
		"serves": "Serves 1Serves 1",
		"isVegetarian": true,
		"recommendations": 0,
		"image":
			"https://www.fivehearthome.com/wp-content/uploads/2015/10/Ovenight-Slow-Cooker-Apple-Pie-Steel-Cut-Oatmeal-Breakfast-Recipe-No-Sticking-Burning-Edges-by-Five-Heart-Home_700pxZoom.jpg"
	},

	"Arancini with tomato and olive tapenade": {
		"ingredients": [
			"100g/3½oz pitted black olives",
			"100g/3½oz sun-blush tomatoes, chopped",
			"2 garlic cloves",
			"1 lemon, zest and juice",
			"1 tbsp chopped fresh parsley",
			"100g/3½oz mayonnaise",
			"50g/2oz unsalted butter",
			"450g/1lb arborio rice",
			"splash white wine",
			"2 litres/3½pints warm vegetable stock",
			"100g/3½oz sun-dried tomatoes, chopped",
			"5 spring onions, finely chopped",
			"salt and freshly ground black pepper ",
			"1 free-range egg, beaten",
			"plain flour, for dusting",
			"1 litre/1¾ pints vegetable oil, for deep-frying  "
		],
		"method": [
			"For the tapenade, blend all of the ingredients except for the mayonnaise together until smooth. Stir in the mayonnaise. ",
			"For the arancini, melt the butter in a large heavy-bottomed saucepan. Add the rice and cook for 2-3 minutes on a low heat. When the rice starts to become a little translucent around the edges, add the wine and cook for another minute.",
			"Add a ladleful of warm stock and stir well. When the stock has almost been absorbed,  add another ladleful. Continue adding more stock until it has all been added and the rice is cooked. ",
			"Fold in the sun-dried tomatoes and spring onion and season with salt and freshly ground black pepper. Set aside to cool.",
			"Beat the egg in a bowl, sprinkle the flour onto a plate.",
			"Roll the rice into small balls, then dip into the beaten egg and dredge in the flour. ",
			"Half-fill a deep, heavy-based saucepan with vegetable oil and heat to 170C/325F (check using a digital thermometer). (CAUTION: Hot oil can be dangerous. Do not leave unattended).",
			"Deep-fry the arancini for 3-4 minutes, or until golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. ",
			"Serve the arancini with the tapenade. "
		],
		"url": "www_bbc_com_food_recipes_arancini_with_tomato_and_49993",
		"title": "Arancini with tomato and olive tapenade",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 6Serves 6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arancini_with_tomato_and_49993_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Arbroath-smokie cakes with chilli jam": {
		"ingredients": [
			"75g/3oz caster sugar",
			"2 red chillies, roughly chopped",
			"3 plum tomatoes, roughly chopped",
			"8 lime leaves",
			"2 lemongrass stems, tough outer leaves removed, finely chopped",
			"25g/1oz roughly chopped fresh ginger",
			"2 garlic cloves, peeled, left whole",
			"2 small shallots, roughly chopped",
			"4 tbsp Thai fish sauce (nam pla)",
			"40ml/1½fl oz sesame oil",
			"50ml/2fl oz dark soy sauce",
			"2 tbsp clear honey",
			"3 limes, juice and zest",
			"110g/4oz crème fraîche",
			"110g/4oz Arbroath smokie, skinned, boned and flaked into small pieces",
			"110g/4oz mashed potato",
			"1 red chilli, finely chopped",
			"1 tsp medium curry powder",
			"salt and freshly ground black pepper",
			"1 lime, juice only",
			"75g/3oz plain flour ",
			"2 free-range eggs, beaten",
			"90g/3½oz Panko breadcrumbs",
			"vegetable oil, for deep frying"
		],
		"method": [
			"For the chilli jam, heat the sugar in a heavy-based saucepan over a medium heat until it melts and forms a golden-brown caramel. (Do not stir and keep an eye on it so that it doesn’t burn.)",
			"Blend all of the remaining chilli jam ingredients, except the crème fraîche, in a food processor to a smooth purée.",
			"Once the sugar has caramelised, pour in the puréed chilli jam mixture and stir well. Bring the mixture to the boil, then reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool.",
			"Once the chilli jam mixture has cooled, stir in the crème fraîche until well combined.",
			"For the fish cakes, mix the Arbroath smokie, mashed potato, chilli and curry powder in a bowl until well combined. Season with salt and freshly ground black pepper and lime juice, to taste.",
			"Shape the mixture into 2cm/¾in diameter balls.",
			"Sprinkle the flour onto one plate, beat the egg in a bowl then place the breadcrumbs on another plate.",
			"Dredge each ball in the flour, then dip it in the beaten egg and roll in the breadcrumb until completely coated.",
			"Heat the oil in a deep-fat fryer to 190C/375F. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)",
			"Carefully lower the fish cakes into the hot oil and fry for 3-4 minutes, or until crisp and golden-brown and completely cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm until needed.",
			"Thread the cakes onto small skewers and arrange on a serving plate. Spoon the chilli jam into a bowl and serve alongside the cakes."
		],
		"url": "www_bbc_com_food_recipes_arbroath_smokie_cakes_32036",
		"title": "Arbroath-smokie cakes with chilli jam",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arbroath_smokie_cakes_32036_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Beef curry with shatkora": {
		"ingredients": [
			"2 tbsp vegetable oil, for frying",
			"2 pieces cinnamon stick",
			"4 bay leaves",
			"4–6 cardamom pods, lightly crushed",
			"1 star anise",
			"¼ tsp fenugreek seeds",
			"1 tsp salt",
			"2 onions, chopped",
			"1 tbsp garlic paste",
			"1 tbsp ginger paste",
			"1kg/2lb 4oz beef chuck or shoulder on the bone, diced into 2.5cm/1in pieces",
			"1 small shatkora, finely sliced rind only (alternatively use orange rind)    ",
			"1–2 tsp chilli powder",
			"1 tsp turmeric",
			"1 tsp ground coriander",
			"1 tsp ground cumin ",
			"1 tsp garam masala",
			"2 tsp tomato purèe",
			"2 tomatoes, cut into wedges",
			"handful freshly chopped coriander",
			"basmati rice, cooked according to packet instructions",
			"garnishes such as thinly sliced ginger, sliced chilli, coriander, dill, lemon slices or tomatoes"
		],
		"method": [
			"Heat the oil in a large, heavy bottomed, non-stick saucepan. Add the whole spices (cinnamon, bay leaves, cardamom, star anise and fenugreek seeds) and heat gently, swirling in the oil to release the flavours. Add the salt.",
			"Stir in the onions, garlic and ginger pastes, continuing to stir and cook on a medium heat until the onions are soft and just starting to colour. Add the meat and brown all over in the spice and onion mixture, this will take approximately 10 minutes.",
			"Add enough water to fully cover the meat (approximately 750ml/1¼ pint). Stir and bring to the boil before reducing the heat and simmering uncovered for 30 minutes, stirring frequently. ",
			"Add a generous pinch of shatkora or orange rind slices (around 6-8 little slithers) to the pan and stir. Add the chilli powder, turmeric, coriander, cumin and garam masala. Stir in the tomato purèe. Add a little more water, cover with a lid and cook on a gentle simmer for 1½–2 hours, or until the meat is tender.  Remove the lid for the last 10 minutes to reduce and thicken the sauce.  ",
			"Finally add the tomato wedges and a handful of coriander and simmer for a few minutes before serving. Serve with rice and your choice of garnishes. "
		],
		"url": "www_bbc_com_food_recipes_aromatic_beef_curry_with_63198",
		"title": "Beef curry with shatkora",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromatic_beef_curry_with_63198_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Aromatic beef curry": {
		"ingredients": [
			"125ml/4fl oz ghee or vegetable oil",
			"400g/14oz beef braising steak, diced into 3cm chunks",
			"1 medium onion, diced",
			"2 garlic cloves, finely chopped",
			"1 tsp ground cumin",
			"1 tsp ground coriander",
			"1 tsp ground turmeric",
			"1 tsp ground black pepper",
			"1 tsp chilli powder",
			"½ tsp ground ginger",
			"3 cloves",
			"3 cardamom pods (optional)",
			"½ tsp ground cinnamon",
			"½ x 400g/14oz can chopped tomatoes",
			"125g/4½oz natural yoghurt",
			"1 tbsp vinegar",
			"salt",
			"pinch sugar"
		],
		"method": [
			"Heat a lidded frying pan over a medium heat and add the ghee or oil. Fry the meat until lightly browned on all sides, then remove from the pan with a slotted spoon, cover and set aside.",
			"Add the onion and garlic to the pan and fry over a low heat until soft. Turn the heat up slightly, add the spices and fry for 1 minute, they should start to smell aromatic, without burning.",
			"Return the beef to the pan, add the tomatoes and bring to the boil. Take the pan off the heat and stir in the yoghurt and vinegar, then season to taste with the salt and the sugar. ",
			"Return the pan to the heat, bring back to the boil and simmer, covered, for 1½ hours, or until the meat is tender."
		],
		"url": "www_bbc_com_food_recipes_aromatic_beef_curry_90850",
		"title": "Aromatic beef curry",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromatic_beef_curry_90850_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Aromatic pork belly hotpot": {
		"ingredients": [
			"1.5kg/3lb 5oz belly pork, with rind still on",
			"570ml/1 pint pork or chicken stock (if available, otherwise water)",
			"12 spring onions",
			"100ml/3½fl oz light soy sauce",
			"75ml/2½fl oz Chinese rice wine",
			"25ml/1fl oz rice wine vinegar",
			"2 tbsp demerera (or light brown) sugar",
			"3 star anise",
			"10cm/4in piece of fresh ginger root, peeled and sliced in rounds",
			"a good pinch of dried chilli flakes"
		],
		"method": [
			"Cut the pork belly in large rectangular chunks (2.5x5cm/1x2in), put in a large pan, pour over enough boiling water just to cover, then bring back to the boil. Simmer gently for about 5 minutes, skimming off the scum that rises to the surface, then drain through a colander. ",
			"Rinse out the pan if necessary, return the pork to it and pour over enough boiling hot stock (if available) or water to cover it again. ",
			"Cut 5 of the spring onions in half and add to the pan with the soy sauce, rice wine, vinegar, sugar, star anise, ginger and chilli flakes. Cover tightly and simmer very slowly for about 2 hours, turning the meat occasionally, until the pork is very tender, soft and succulent.",
			"Remove the pork with a slotted spoon and set aside. Strain the cooking liquid, ideally through muslin or a fine chinois, into a clean pan. Skim off as much fat as you can (but dont worry about leaving a little), then boil the stock hard to reduce and concentrate the flavours. It should be lightly syrupy and intensely aromatic, but don't over reduce as the soy sauce may make it very salty.",
			"Thinly slice the remaining spring onions on the diagonal. Return the pork to the sauce and heat through.",
			"Serve over plain noodles in a warmed soup bowl, with plenty of the sauce ladled over, and the sliced spring onions scattered over the meat."
		],
		"url": "www_bbc_com_food_recipes_aromaticporkbellyhot_10468",
		"title": "Aromatic pork belly hotpot",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 6Serves 6",
		"isVegetarian": false,
		"recommendations": 0,
		"image":
			"https://lh5.googleusercontent.com/-eQUy0QwN2bQ/TXvUprVvSOI/AAAAAAAAA78/OQup7G1qy6o/s1600/porkbelly_hotpot2.jpg"
	},

	"Aromatic couscous": {
		"ingredients": [
			"1 courgette, sliced lengthways",
			"½ red pepper, cut into strips",
			"olive oil, for drizzling",
			"200g/7oz couscous, cooked according to packet instructions",
			"1 orange, juice and zest",
			"1 lemon, juice and zest",
			"small handful fresh mixed herbs such as parsley, mint, basil and coriander, chopped",
			"2 tbsp black olives, stones removed",
			"2 tbsp pine nuts",
			"salt and freshly ground black pepper"
		],
		"method": [
			"Rub the courgette and red pepper slices with olive oil. Heat a griddle pan and griddle the courgette and pepper pieces for 2-3 minutes, turning frequently, until softened and lightly charred all over. Remove from the heat and chop up into small pieces.",
			"Place the couscous into a large bowl. Add the courgette and pepper pieces and all the remaining ingredients and mix well.",
			"To serve, place into a serving dish."
		],
		"url": "www_bbc_com_food_recipes_aromaticcouscous_86271",
		"title": "Aromatic couscous",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "less than 10 minsless than 10 mins",
			"cookingMins": 10,
			"totalMins": 40
		},
		"serves": "Serves 2Serves 2",
		"isVegetarian": true,
		"recommendations": 0,
		"image": "http://loveyourgut.com/wp-content/uploads/cous-cous.jpg"
	},

	"Vegan blackeye bean curry": {
		"ingredients": [
			"2 x 410g/14oz tins of black eyed beans (or use 225g/8oz dried beans, soaked overnight and cooked)",
			"1 tbsp cumin seeds",
			"1 tbsp coriander seeds",
			"1 tsp fennel seeds",
			"¼ tsp fenugreek seeds",
			"1cm/½in stick cinnamon",
			"½ - 2 tsp crushed chilli flakes",
			"4 tbsp vegetable oil",
			"1 tsp black mustard seeds",
			"10 curry leaves (fresh or dried)",
			"1 medium onion, finely chopped",
			"2 garlic cloves, crushed",
			"5cm/2in piece fresh ginger, grated",
			"salt to taste",
			"550ml/1pint water",
			"2 tbsp coriander leaves",
			"2 tbsp fresh coconut, grated (optional, but do not use desiccated)"
		],
		"method": [
			"Drain and rinse the beans, and mash a few lightly with fork.",
			"Put the cumin, coriander, fennel and fenugreek seeds with the cinnamon stick into a small heavy-based frying pan. Roast on a medium heat, stirring frequently until the spices change colour and become aromatic, taking care not to burn them.",
			"Grind the roasted spices into a fine powder in a coffee grinder, and add crushed chilli flakes.",
			"Heat the oil over medium heat. When hot, add the mustard seeds and curry leaves. Remove the pan immediately from heat, cover, and let the seeds and leaves crackle and pop.",
			"Put the pan back on heat, add the onion and cook until light golden. Add the ginger and garlic, and cook for a further 30 seconds.",
			"Add the beans, ground spice mixture, salt, and water, and bring to the boil.",
			"Turn the heat to low, cover and simmer for 20 minutes. ",
			"Top with coriander leaves and fresh coconut, if using, and serve with rice or flatbreads."
		],
		"url": "www_bbc_com_food_recipes_aromaticblackeyebean_73019",
		"title": "Vegan blackeye bean curry",
		"time": {
			"preparation": "30 mins to 1 hour30 mins to 1 hour",
			"preparationMins": 60,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 90
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aromaticblackeyebean_73019_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Arrabiata pork meatball spaghetti": {
		"ingredients": [
			"2 x 400g/14oz cans tomatoes",
			"3 tbsp extra virgin olive oil",
			"2 garlic cloves, finely chopped",
			"1 tsp dried chilli flakes",
			"4 tbsp roughly chopped fresh basil",
			"salt and freshly ground black pepper",
			"1 tsp caster sugar",
			"500g/1lb 2oz pork mince",
			"90g/3oz streaky bacon, finely chopped",
			"2 tsp thyme leaves",
			"2 tbsp flatleaf parsley, roughly chopped",
			"300g/10½oz dried spaghetti"
		],
		"method": [
			"Heat a frying pan until hot, then add the tomatoes and olive oil and bring to a gentle simmer.",
			"Add the garlic, chilli and half of the basil and cook for 10 minutes, until reduced and thickened. Season, to taste, with salt, freshly ground black pepper and a little sugar.",
			"Place the pork mince, bacon, thyme and parsley into a bowl and mix thoroughly. Season with a little salt and plenty of freshly ground black pepper.",
			"Divide the mixture into 16 and shape each portion into a small ball, using your hands.",
			"Place the meatballs into the tomato sauce and simmer for 5-8 minutes, or until the meatballs are completely cooked through.",
			"Meanwhile, bring a large pan of salted water to the boil. Add the spaghetti and cook according to packet instructions.",
			"Drain the spaghetti, then add to the tomato and meatball sauce. Season, to taste, with salt and freshly ground black pepper and add the remaining basil.",
			"To serve, spoon equal portions of the spaghetti and meatballs into warmed bowls."
		],
		"url": "www_bbc_com_food_recipes_arrabiataporkmeatbal_90149",
		"title": "Arrabiata pork meatball spaghetti",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4Serves 4",
		"isVegetarian": false,
		"recommendations": 0,
		"image":
			"https://img.taste.com.au/iUkZjK9F/w720-h480-cfill-q80/taste/2016/11/spaghetti-and-meatballs-in-tomato-sauce-3867-1.jpeg"
	},

	"Arroz verde": {
		"ingredients": [
			"1kg/2lb 4oz fish bones, such as lemon sole, brill and plaice",
			"1 onion, roughly chopped",
			"1 fennel bulb, roughly chopped",
			"100g/3½oz celery, sliced",
			"100g/3½oz carrot, roughly chopped",
			"25g/1oz button mushrooms, sliced",
			"1 sprig fresh thyme",
			"4 tbsp olive oil",
			"60g/2¼oz shallots, finely chopped",
			"12 garlic cloves, finely chopped",
			"1 litre/1¾ pints fish stock (see above)",
			"100g/3½oz finely chopped flatleaf parsley ",
			"1½ tsp salt",
			"400g/14oz short-grain paella rice, such as calasparra",
			"30 raw clams, preferably palourdes (vongole), scrubbed",
			"200g/7oz raw small prawns, peeled",
			"4 garlic cloves, crushed",
			"½ tsp fine table salt",
			"1 medium free-range egg yolk",
			"175ml/6fl oz extra virgin olive oil"
		],
		"method": [
			"For the fish stock, put all the ingredients and 2½ litres/4½ pints water in a large pan and simmer gently for 30 minutes. Strain through a fine or muslin-lined sieve. If not using immediately, leave to cool, then refrigerate or freeze.",
			"For the arroz verde, heat the oil in a 28–30cm/11–12in shallow flameproof casserole over medium heat. Add the shallots and fry for 5 minutes, or until soft. Add the garlic and fry for 40–60 seconds, then stir in the fish stock, parsley and salt and bring to the boil.",
			"Sprinkle in the rice, stir once, then leave to simmer vigorously over medium–high heat for 6 minutes. Put the clams and prawns on top and shake the pan briefly so they sink into the rice a little. Lower the heat and simmer gently for 12 minutes. Almost all the liquid should be absorbed and the rice should be pitted with small holes. Discard any clams that do not open after cooking.",
			"Meanwhile, for the aioli, mix the garlic and salt together to form a paste. Put in a food processor and add the yolk. Turn on the machine and very slowly trickle the oil through the hole in the lid until you have a thick emulsion. ",
			"Serve the arroz verde with the aioli. "
		],
		"url": "www_bbc_com_food_recipes_arroz_verde_49624",
		"title": "Arroz verde",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 4-5Serves 4-5",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/arroz_verde_49624_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Artichoke pasta": {
		"ingredients": [
			"110g/4oz artichokes, marinated in oil",
			"1 clove garlic, peeled and crushed",
			"1 tbsp finely chopped parsley ",
			"1 tbsp  finely chopped thyme, leaves only",
			"450g/1lb linguine pasta, cooked ",
			"½ lemon, juice only ",
			"parmesan shavings, to serve (or similar vegetarian hard cheese)"
		],
		"method": [
			"Pour the artichokes, with their oil into a pan and mash them down with a fork. ",
			"Add the garlic, parsley and thyme and heat through for a couple of minutes and then pour over the warm pasta. ",
			"Add the lemon juice and toss thoroughly.",
			"Serve in bowls topped with shavings of parmesan cheese."
		],
		"url": "www_bbc_com_food_recipes_artichokepasta_1398",
		"title": "Artichoke pasta",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/artichokepasta_1398_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Asian-style sticky chicken": {
		"ingredients": [
			"¼ tsp garlic granules",
			"1 tsp toasted sesame oil",
			"1 tsp mirin ",
			"1 tbsp dark soy sauce",
			"1 tbsp honey",
			"pinch dried red chilli flakes",
			"3 boneless chicken thighs, skin removed, halved",
			"3 spring onions, finely sliced",
			"1 tsp sesame seeds",
			"1 lime, cut into wedges, to serve"
		],
		"method": [
			"Preheat the oven to 200C/180C Fan/Gas 6.",
			"Put the garlic granules, sesame oil, mirin, soy sauce, honey and chilli flakes into a resealable food bag and shake well.",
			"Add the chicken thigh strips and mix around to coat totally - you can do this by holding the outside of the bag and squishing around. ",
			"Tip out onto a small baking tray, pouring over all the marinade, then bake for 15-20 minutes, or until the chicken is golden brown and cooked through. ",
			"Toss the cooked chicken in any remaining sauce and transfer to a serving plate. Sprinkle with the spring onions and sesame seeds and serve with the lime wedges to squeeze over. "
		],
		"url": "www_bbc_com_food_recipes_asian-style_sticky_23400",
		"title": "Asian-style sticky chicken",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 2Serves 2",
		"isVegetarian": false,
		"recommendations": 0,
		"image":
			"https://www.kitchensanctuary.com/wp-content/uploads/2016/06/Crispy-Sesame-Chicken-Tall-FS.jpg"
	},

	"Asian-braised shin of beef with hot and sour shredded salad": {
		"ingredients": [
			"2 onions, peeled, quartered",
			"5cm/2in piece fresh root ginger, peeled, sliced",
			"4 garlic cloves, peeled",
			"2 tsp ground coriander",
			"3 tbsp vegetable oil",
			"250ml/9fl oz Chinese cooking wine (or dry sherry)",
			"4 tbsp soy sauce",
			"4 tbsp dark brown sugar",
			"2 litres/3½ pints beef stock, preferably organic",
			"2 tbsp oyster sauce",
			"4 tbsp rice wine vinegar",
			"2 cinnamon sticks",
			"2 star anise",
			"3.5kg/7½lb beef shin, on the bone, cut by the butcher into thick slices (or 1kg/2¼lb beef shin off the bone, cut into large cubes)",
			"3 carrots, peeled, cut into matchsticks",
			"4 spring onions, cut into matchsticks",
			"1 long red chilli, seeds removed, cut into matchsticks",
			"1 long green chilli, seeds removed, cut into matchsticks",
			"20g/¾oz bunch fresh coriander, finely chopped",
			"1 lime, juice only",
			"4 tbsp Thai fish sauce",
			"1 tsp caster sugar"
		],
		"method": [
			"Preheat the oven to 150C/300F/Gas 2. ",
			"For the beef, blend the onions, ginger, garlic and coriander in a food processor until well combined and finely chopped.",
			"Heat the oil in a large casserole or ovenproof frying pan and fry the mixture over a medium heat, stirring regularly, until soft and beginning to catch in the pan; this should take about 10 minutes.",
			"Pour in the Chinese wine (or sherry) and let it bubble up. Add the soy sauce, brown sugar, stock, oyster sauce and rice wine vinegar and bring to a boil, then drop in the cinnamon sticks and star anise.",
			"Add the pieces of beef shin and let everything come up to a bubble again, then clamp on a lid and put into the oven for 2 hours (or longer if using regular stewing steak).",
			"Take the casserole carefully out of the oven and, using a slotted spatula, remove the beef to an ovenproof dish. Cover with foil and keep warm in the oven while you vigorously boil the sauce in the casserole (or pan) on the hob, without a lid, until it has reduced by about half.",
			"For the salad, combine all the julienned vegetables and the chopped coriander in a bowl. ",
			"For the salad dressing, mix the lime juice, fish sauce and caster sugar in another bowl and dress the vegetables with this.",
			"To serve, arrange the beef on a serving platter and pour the reduced sauce over the meat. If you are using cubes of stewing steak, rather than slices of shin, you’d probably do better to use a deeper dish. Dress the top of the beef with the hot and sour shredded salad. "
		],
		"url": "www_bbc_com_food_recipes_asian-braised_shin_of_98140",
		"title": "Asian-braised shin of beef with hot and sour shredded salad",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 6Serves 6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/asian-braised_shin_of_98140_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Noodle soup": {
		"ingredients": [
			"300ml/10fl oz hot chicken stock (vegetarians can substitute vegetable stock)",
			"150g/5½oz egg noodles",
			"1 carrot, cut into julienne",
			"2 spring onions, shredded",
			"1 clove garlic, finely chopped",
			"1 free-range egg, beaten",
			"salt and freshly ground black pepper",
			"1 tsp chopped coriander"
		],
		"method": [
			"Bring the chicken or vegetable stock to a simmer in a saucepan. Add the noodles, carrot, spring onions and garlic and simmer for 5 minutes.",
			"Gently pour the beaten egg into the stock, stir and season with salt and freshly ground black pepper.",
			"To serve, pour into a bowl and sprinkle with coriander."
		],
		"url": "www_bbc_com_food_recipes_asiannoodlesoup_81146",
		"title": "Noodle soup",
		"time": {
			"preparation": "",
			"preparationMins": null,
			"cooking": "",
			"cookingMins": null,
			"totalMins": 0
		},
		"serves": "Serves 1Serves 1",
		"isVegetarian": true,
		"recommendations": 0,
		"image":
			"https://www.errenskitchen.com/wp-content/uploads/2014/04/Quick-Easy-Chinese-Noodle-Soup-e1524076353502.jpg"
	},

	"Easy tofu stir-fry": {
		"ingredients": [
			"2 tbsp olive oil",
			"½ lime, zest and juice",
			"large pinch chilli flakes",
			"2 tbsp soy sauce",
			"2 tbsp honey or agave syrup",
			"2 tbsp vegetable oil",
			"150g/5½oz tofu, cut into pieces",
			"2 tbsp vegetable oil",
			"¼ onion, finely sliced",
			"1 garlic clove, crushed",
			"¼ red pepper, chopped",
			"handful spinach leaves",
			"150g/5½oz basmati rice, cooked according to packet instructions and drained"
		],
		"method": [
			"For the marinated tofu, combine all the marinade ingredients, except the vegetable oil, in a bowl and mix well. Add the tofu, coat in the mixture and allow to marinate for 5-10 minutes, or longer if possible. ",
			"Heat a wok over a medium heat. Remove the tofu from the marinade, setting the marinade aside. Fry the tofu for 5-10 minutes until golden-brown all over. Strain the marinade to remove any small pieces of tofu.",
			"For the rice, heat the oil in a pan and fry the onions and garlic for 2-3 minutes until softened, then add the pepper and fry until the tofu for 2 minutes. Add the spinach, rice and reserved marinade and heat through for a further 3-4 minutes. ",
			"Serve the rice with the marinated tofu on top."
		],
		"url": "www_bbc_com_food_recipes_asianstyletofustirfr_92503",
		"title": "Easy tofu stir-fry",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"image":
			"https://pinchofyum.com/wp-content/uploads/Honey-Ginger-Tofu-Veggie-Stir-Fry-53-Square.jpg"
	},

	"Crab and courgette pasta": {
		"ingredients": [
			"350g/12oz spaghetti or linguine",
			"600g/1lb 5oz courgettes, cut into ribbons using a vegetable peeler",
			"2 tbsp olive oil",
			"2 garlic cloves, finely chopped",
			"2 x 240g tins crab meat, drained",
			"½ unwaxed lemon, finely grated zest and juice ",
			"2 tbsp dried dill",
			"salt and freshly ground black pepper",
			"4 tbsp freshly grated Parmesan, to serve"
		],
		"method": [
			"Bring a large pan of salted water to the boil. Cook the pasta for 8 minutes, or until al dente. ",
			"Place the courgettes in a steamer or colander and sit above the pan of pasta. Cover and steam for 1–2 minutes, or until tender. ",
			"Drain the pasta, retaining a little of the cooking water, and tip into a large bowl. ",
			"Pour the oil into the pasta pan over a low heat. Add the garlic and cook briefly, to flavour the oil. Pour the oil over the pasta.",
			"Toss the pasta with the crab, lemon zest and juice, dill and courgettes. Serve topping each portion with 1 tablespoon Parmesan and a grind of pepper."
		],
		"url": "www_bbc_com_food_recipes_crab_and_courgette_pasta_55917",
		"title": "Crab and courgette pasta",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "less than 10 minsless than 10 mins",
			"cookingMins": 10,
			"totalMins": 40
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crab_and_courgette_pasta_55917_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Cranberry sauce": {
		"ingredients": [
			"100g/3½oz light brown sugar",
			"100ml/3½fl oz fresh orange juice",
			"250g/9oz fresh or frozen cranberries",
			"1 clementine, finely grated zest only (optional)"
		],
		"method": [
			"Combine the sugar and orange juice in a large saucepan and bring to the boil. ",
			"Stir in the cranberries and clementine zest (if using), then simmer until the cranberries are tender but still holding their shape – this will take about 5 minutes if using frozen cranberries and a little longer if using fresh. ",
			"Refrigerate until needed, the sauce will thicken as it cools.",
			"Remove from the fridge an hour before serving."
		],
		"url": "www_bbc_com_food_recipes_cranberry_sauce_77431",
		"title": "Cranberry sauce",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 6-8Serves 6-8",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cranberry_sauce_77431_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Creamed Brussels sprouts with bacon": {
		"ingredients": [
			"1 kg/2lb 3¼oz Brussels sprouts, trimmed",
			"8 rashers cured bacon, cut into lardons",
			"250ml/8¾fl oz double cream ",
			"2 garlic cloves, crushed ",
			"salt and freshly ground black pepper"
		],
		"method": [
			"Cook the Brussels sprouts in a saucepan of boiling salted water for 8-10 minutes. Drain and refresh in a bowl of ice and water. Drain again when the sprouts have cooled.",
			"Add the bacon lardons to a non-stick frying pan, and fry over a medium heat until crisp. ",
			"Add the cream and crushed garlic to a small pan and bring to the boil. ",
			"Stir the sprouts into the crisp bacon; then stir in the hot cream. ",
			"Season with salt and pepper and serve straightaway."
		],
		"url": "www_bbc_com_food_recipes_creamedbrusselssprou_84835",
		"title": "Creamed Brussels sprouts with bacon",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4-6Serves 4-6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamedbrusselssprou_84835_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Lighter carbonara": {
		"ingredients": [
			"100g/3½oz dried tagliatelle or spaghetti",
			"50g/1¾oz frozen peas",
			"2 tsp extra virgin olive or sunflower oil",
			"½ onion, finely chopped",
			"2 smoked back bacon rashers, cut into 15mm/⅝in-wide strips",
			"100g/3½oz small closed cup mushrooms, sliced",
			"1 courgette, cut into 1-cm/½-in slices",
			"3 tbsp single cream",
			"15g/½oz Parmesan, finely grated",
			"sea salt and freshly ground black pepper"
		],
		"method": [
			"Half-fill a large, non-stick saucepan with water and bring to the boil. Add the pasta to the pan and cook for 10 minutes, or according to the packet instructions, until tender. Add the peas and cook for 2 minutes more.",
			"Meanwhile, heat the oil in a large, non-stick frying pan or wok. Add the onion, bacon, mushrooms and courgette to the pan and season with salt and pepper. Fry over a medium–high heat for 5 minutes, stirring often. ",
			"Drain the pasta and peas and return to the saucepan. Add the cream and the bacon mixture to the saucepan and place over a low heat. Toss the mixture with a couple of forks for a few seconds until the cream is hot and everything is well mixed. Sprinkle with the Parmesan and serve immediately. "
		],
		"url": "www_bbc_com_food_recipes_creamy_carbonara_74567",
		"title": "Lighter carbonara",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 2Serves 2",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamy_carbonara_74567_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Creamy parsnip and apple soup": {
		"ingredients": [
			"25g/1oz butter",
			"1 tbsp sunflower oil",
			"2 medium onions, chopped",
			"600g/1lb 5oz parsnips, cut into 2cm/1in pieces",
			"2 garlic cloves, crushed",
			"600g/1lb 5oz Bramley apples, peeled, quartered and cut into chunks",
			"1 litre/1¾ pints vegetable or chicken stock",
			"150ml/5fl oz milk",
			"flaked sea salt and freshly ground black pepper"
		],
		"method": [
			"Melt the butter and oil in a large saucepan.  Gently fry the onions and parsnips for 15 minutes, or until the onions are softened. Add the garlic and apples and cook for a further two minutes, stirring regularly.",
			"Pour over the stock and bring to the boil. Reduce the heat to a simmer and cook for about 20 minutes, or until the parsnips are very soft. Remove from the heat and season with salt and freshly ground black pepper.  Blend the mixture in a food processor until smooth. ",
			"Stir in the milk, adding a little extra if required. Season to taste with salt and freshly ground black pepper. "
		],
		"url": "www_bbc_com_food_recipes_creamy_parsnip_and_apple_35005",
		"title": "Creamy parsnip and apple soup",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 6Serves 6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/creamy_parsnip_and_apple_35005_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Crisp bacon rosti with fried eggs": {
		"ingredients": [
			"sunflower oil, for frying",
			"2 rashers smoked back bacon, cut into small pieces",
			"1 small onion, thinly sliced",
			"500g/1lb 2oz floury potatoes, coarsely grated ",
			"2 free-range eggs",
			"salt and freshly ground black pepper"
		],
		"method": [
			"Heat 1 tablespoon oil in a 20cm/8in lidded frying pan, add the bacon and fry over a high heat until crisp. Remove the bacon and set aside. Add the onion to the pan and fry for 1 minute. Cover, lower the heat and cook for 15 minutes, until soft and tender.",
			"Put the potatoes inside a clean tea towel and wring out as much water as possible by squeezing the towel – this prevents the rosti from being soggy. Put the potato in a bowl, add the onion and bacon. Season with salt and pepper and mix well.",
			"Return the pan to the heat and add 1 tablespoon oil. When the oil is hot add the potato mixture. Using the back of a spoon press the mixture into the pan so there is an even layer covering the whole pan.  ",
			"Cook over a low heat for 5–10 minutes, then carefully turn over. The easiest way is to turn it upside down onto a plate and then slide it back into the pan (you may need to add a little more oil into the pan first). Cook the other side for 5–10 minutes, until golden and crisp.",
			"Heat oil in a frying pan and fry the eggs until cooked to your liking. ",
			"Cut the rosti into wedges and divide between plates, top with the eggs and serve. "
		],
		"url": "www_bbc_com_food_recipes_crisp_bacon_rosti_with_84695",
		"title": "Crisp bacon rosti with fried eggs",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 2Serves 2",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crisp_bacon_rosti_with_84695_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Crispy duck salad": {
		"ingredients": [
			"4 large duck legs",
			"½ chilled watermelon, skin removed, flesh chopped",
			"1 fresh pomegranate, seeds only",
			"½ bunch fresh mint, leaves picked and roughly torn",
			"large bunch coriander, leaves picked and stalks chopped",
			"1-2 red chillies (to taste)",
			"2 tbsp dark soy sauce",
			"2 tbsp Thai fish sauce",
			"2 limes, juice only",
			"½ tsp ground Sichuan pepper"
		],
		"method": [
			"Preheat the oven to 160C/350F/Gas 4.",
			"Place a wire rack on a roasting tin and place the duck legs on top, skin-side up. Roast the duck legs on the rack for 1¾-2 hours, or until the skin is crisp and the meat is cooked through (when the duck is cooked, the juices should run clear when a skewer is inserted into the thickest part of the leg). Set aside to cool for 10-15 minutes, reserving the duck fat on the baking tray.",
			"In a large bowl, mix together the chopped watermelon and pomegranate seeds. Stir in the mint leaves and coriander and the sliced chillies, to taste.",
			"When the duck legs have cooled, flake the meat from the bone and add it to the watermelon and pomegranate mixture. Add the soy sauce, fish sauce, lime juice and a little of the reserved duck fat, to taste, if desired. Season with Sichuan pepper and gently toss.",
			"Serve the salad immediately, while the watermelon is cold and the duck meat still warm."
		],
		"url": "www_bbc_com_food_recipes_crispy_duck_salad_03934",
		"title": "Crispy duck salad",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_duck_salad_03934_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Crispy fish fingers": {
		"ingredients": [
			"1-2 tbsp vegetable oil",
			"1 slice day-old bread, grated",
			"2 tbsp quick-cook dried polenta",
			"freshly ground black pepper",
			"3 tbsp plain flour",
			"pinch paprika",
			"1 free-range egg",
			"½ lemon, juice only",
			"1 white fish fillet, such as cod or plaice, skin and bones removed, cut into 3cm/1in strips"
		],
		"method": [
			"Preheat the oven to 220C/450F/Gas 7. Line a baking tray with baking parchment and brush the parchment all over with a little vegetable oil.",
			"In a bowl, mix together the breadcrumbs and polenta, and season well with freshly ground black pepper.",
			"Put the plain flour into another bowl and season with the paprika. Beat the egg in a bowl.",
			"Squeeze the lemon juice over the strips of fish.",
			"Roll each strip of fish first in the flour mixture, then dip it into the beaten egg, then coat it in the polenta mixture. Place each fish finger onto the prepared baking tray.",
			"Drizzle a little more vegetable oil onto each fish finger, then bake in the oven for 10-12 minutes, or until the fish is cooked through and the coating is crisp. Serve with salad or steamed vegetables."
		],
		"url": "www_bbc_com_food_recipes_crispy_fish_fingers_34974",
		"title": "Crispy fish fingers",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 1-2Serves 1-2",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crispy_fish_fingers_34974_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Crunchy banana yoghurt": {
		"ingredients": [
			"340g/12oz fat-free natural Greek-style yoghurt",
			"1 banana, peeled and sliced",
			"15g/½oz mixed seeds (pumpkin, sesame and sunflower) (or use toasted flaked almonds) "
		],
		"method": [
			"Divide the yoghurt between two small bowls. Scatter the banana on top.",
			"Sprinkle with seeds or nuts and serve."
		],
		"url": "www_bbc_com_food_recipes_crunchy_banana_yoghurt_48211",
		"title": "Crunchy banana yoghurt",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "no cooking requiredno cooking required",
			"cookingMins": 0,
			"totalMins": 30
		},
		"serves": "Serves 2Serves 2",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/crunchy_banana_yoghurt_48211_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Cucumber and mint raita": {
		"ingredients": [
			"250ml/8fl oz natural yoghurt",
			"½ cucumber, grated or finely chopped",
			"large handful mint leaves, chopped",
			"large pinch salt",
			"½-1 green chilli, de-seeded and finely chopped (optional)"
		],
		"method": [
			"Wrap the grated cucumber in a tea towel and squeeze out any excess water.",
			"Mix together all the ingredients and serve chilled as an accompaniment to any curry or as a dip for poppadoms."
		],
		"url": "www_bbc_com_food_recipes_cucumberandmintraita_67787",
		"title": "Cucumber and mint raita",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "no cooking requiredno cooking required",
			"cookingMins": 0,
			"totalMins": 30
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cucumberandmintraita_67787_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Cumin roast carrots": {
		"ingredients": [
			"150g/5½oz Chantenay carrots, or other small carrots",
			"drizzle olive oil",
			"2 garlic cloves, unpeeled",
			"1 sprig rosemary",
			"1 tsp cumin seeds",
			"salt and freshly ground black pepper",
			"2 tbsp chopped fresh chives, to garnish"
		],
		"method": [
			"Preheat the oven to 200C/400F/Gas 6.",
			"Place the carrots onto a baking sheet, add the garlic cloves, rosemary and cumin seeds and season generously with salt and freshly ground black pepper. Mix together.",
			"Place in the oven and roast for 10-15 minutes, or until the carrots are tender and golden-brown. ",
			"To serve, transfer the carrots to a serving bowl and garnish with the chopped chives."
		],
		"url": "www_bbc_com_food_recipes_cuminroastcarrots_89088",
		"title": "Cumin roast carrots",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 2Serves 2",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cuminroastcarrots_89088_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Curly kale (or cavolo nero) with rosemary and chilli": {
		"ingredients": [
			"3 tbsp extra virgin olive oil",
			"1 large onion, sliced",
			"2 sprigs fresh rosemary",
			"1 medium or hot fresh red chilli, deseeded and thinly sliced",
			"4 garlic cloves, sliced",
			"250g/9oz curly kale or cavolo nero, trimmed of tough stems, rinsed and cut into 1cm/½in thick slices",
			"salt and freshly ground black pepper"
		],
		"method": [
			"Heat the olive oil in a deep, heavy-bottomed lidded pan over a medium heat. Add the onion, turn down the heat and fry gently until very tender.",
			"Add the rosemary, chilli and garlic and fry for one more minute.",
			"Add the kale or cavolo nero and season with salt. Cover with a tight-fitting lid, reduce the heat to its absolute minimum and leave to cook gently for about 20 minutes. Stir once after five minutes, then again ten minutes later.",
			"Remove the rosemary stalks, then taste and adjust the seasoning. Serve at once."
		],
		"url": "www_bbc_com_food_recipes_curlykaleorcavoloner_85608",
		"title": "Curly kale (or cavolo nero) with rosemary and chilli",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curlykaleorcavoloner_85608_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Curried cauliflower with spinach": {
		"ingredients": [
			"1 tbsp vegetable oil, for frying",
			"800g/1lb 12oz cauliflower, cut into florets",
			"225g/8oz paneer or halloumi, cut into 2cm/¾in cubes",
			"1 onion, thinly sliced",
			"4cm/1½in fresh root ginger, peeled and grated",
			"2 garlic cloves, grated",
			"2 tsp curry powder",
			"2 tsp ground turmeric",
			"500g/1lb 2oz broad-leaf spinach, tough stalks removed",
			"200g/7oz natural yoghurt",
			"salt"
		],
		"method": [
			"Heat a heavy-bottomed saucepan over a medium heat and pour in a teaspoon of the oil. Add the cauliflower and sauté for 15–20 minutes, or until golden. Take your time and don’t stir too much or you will create steam, which will hinder the colouring. Drain on kitchen paper.",
			"Add another teaspoon of oil to the pan and fry the paneer until browned. Drain on kitchen paper.",
			"Pour another teaspoon of oil into the pan and add the onion, ginger and garlic. Reduce the heat to medium-low and fry, stirring from time to time, for 10–15 minutes, or until softened. Add the curry powder and turmeric and cook, stirring, for 1 minute. ",
			"Return the cauliflower to the pan and add 200ml/7floz water. Simmer for 2 minutes, or until tender. Add the paneer, then the spinach, and stir just until wilted. ",
			"Season with salt and serve with some dollops of yoghurt."
		],
		"url": "www_bbc_com_food_recipes_curried_cauliflower_with_57222",
		"title": "Curried cauliflower with spinach",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curried_cauliflower_with_57222_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Curry and lime spiced popcorn": {
		"ingredients": [
			"½ tsp cumin seeds",
			"2 tsp light olive oil",
			"45g/1½oz popping corn",
			"1 tsp mild curry powder",
			"¼ tsp ground cinnamon",
			"¼ tsp finely grated lime zest",
			"pinch sea salt"
		],
		"method": [
			"Place a lidded saucepan over a medium heat. Lightly toast the cumin seeds for 1–2 minutes, then tip into a bowl.",
			"Add the oil and popping corn to the pan and stir well. Cover with the lid and cook for a few minutes, shaking the pan every few seconds, until the corn starts to pop. Keep shaking constantly while popping to avoid burning the corn.",
			"Mix together the toasted cumin seeds, curry powder, cinnamon and lime zest. ",
			"Sprinkle the seasoning and a little sea salt over the popcorn and serve immediately."
		],
		"url": "www_bbc_com_food_recipes_curry_and_lime-spiced_58305",
		"title": "Curry and lime spiced popcorn",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "less than 10 minsless than 10 mins",
			"cookingMins": 10,
			"totalMins": 40
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/curry_and_lime-spiced_58305_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Custard": {
		"ingredients": [
			"600ml/1 pint full-fat milk",
			"1 vanilla pod",
			"3 free-range eggs, yolks only",
			"25g/1oz caster sugar",
			"2 tsp cornflour"
		],
		"method": [
			"Heat the milk with the vanilla pod until just boiling.",
			"Mix together the egg yolks, sugar and cornflour in a bowl to get a smooth paste.",
			"Pour the milk into the paste and stir well.",
			"Strain the mixture back into a clean saucepan and, stirring constantly, cook gently until the custard thickens."
		],
		"url": "www_bbc_com_food_recipes_custard_1293",
		"title": "Custard",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/custard_1293_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Dauphinoise potatoes": {
		"ingredients": [
			"1 kg/2lb 4oz baking potatoes, peeled and placed in a bowl of cold water to prevent them from browning (use floury potatoes such as Russet, King Edward, Maris Piper or Desiree)",
			"3–4 cloves garlic",
			"500ml/17½fl oz double cream (you may need a bit extra)",
			"salt and freshly ground black pepper"
		],
		"method": [
			"Preheat the oven to 160C/140C Fan/Gas 2.",
			"Slice the potatoes into thin slices, about 3mm/⅛in thick. Place the slices into a bowl as you cut them.",
			"Trim the ends off the garlic cloves but don't peel. Grate the cloves on a grater. The flesh will go through the fine holes and the skins will be left behind. Scrape the grated garlic flesh into the bowl with the potatoes.",
			"Season the potatoes, to taste, with salt and freshly ground black pepper. Pour the cream over the potatoes and mix well again.",
			"Place the potato slices into the gratin dish. They should come to just below the top of the dish. Press the potato down with the back of a spoon or your hands so it forms a solid layer. The cream should come to just below the top layer of potato (top up with more double cream if necessary).",
			"Place the potatoes in the oven and bake for 1-1½ hours, or until the potatoes are completely tender. (If the cream looks like it's splitting, your oven is too hot, so turn it down a bit.) Serve the dauphinoise as a side dish to roasted meat or poultry."
		],
		"url": "www_bbc_com_food_recipes_dauphinoisepotatoes_90205",
		"title": "Dauphinoise potatoes",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 6Serves 6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/dauphinoisepotatoes_90205_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Devilled eggs": {
		"ingredients": [
			"12 large free-range eggs, at room temperature (see recipe tip below)",
			"4 tbsp mayonnaise ",
			"1–2 tsp English mustard ",
			"1 tsp sea salt flakes ",
			"¼ paprika, plus extra for sprinkling",
			"few drops Tabasco ",
			"2 tbsp extra virgin olive oil ",
			"2–3 tbsp water from a freshly boiled kettle ",
			"2 tsp finely chopped chives "
		],
		"method": [
			"Bring some water to the boil in a large saucepan and, once it’s boiling, add the eggs, one by one, into the pan and bring back to the boil. Boil for 1 minute, then turn the heat off and leave the eggs to stand in the pan for 12 minutes.",
			"While you’re waiting for the eggs to cook, fill a large bowl with very cold water, and throw in a handful of ice cubes if you have them. As soon as the eggs have had their 12 minutes, spoon them into the cold water and leave for 15 minutes – no longer – before peeling patiently and carefully.",
			"Halve the eggs lengthways and gently prise the yolk out of each half and pop them into a mixing bowl. Place the neatest looking 18 halved whites on a plate or two. ",
			"Add the mayonnaise, a teaspoon of English mustard, the salt and paprika to the egg yolks, and shake a few drops of Tabasco on top. Stir and mash with a fork, then blend with a stick blender or in a food processor. Add the oil and blend again until smooth. It will be very thick. Check for seasoning and also taste to see if you want this hotter. I generally go up to 2 teaspoons of mustard and quite a bit more Tabasco, but it’s best to proceed slowly. Now, by hand, stir in as much of the water as you need to help form a piping consistency.",
			"Spoon the golden mixture into a piping bag with a star icing nozzle, making sure it is densely packed at the bottom of the bag. Then pipe away, filling the hollowed-out whites with golden rosettes. Or you can mound the yolk mixture using a pair of teaspoons. Sprinkle with paprika and chopped chives and serve with a flourish."
		],
		"url": "www_bbc_com_food_recipes_devilled_eggs_96275",
		"title": "Devilled eggs",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Makes 18Makes 18",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/devilled_eggs_96275_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Disco pops": {
		"ingredients": [
			"4 drops vanilla extract",
			"2 tsp runny honey",
			"270g/9½oz Greek-style yoghurt",
			"50g/2oz fresh raspberries, mashed",
			"100g/4oz fresh strawberries, mashed"
		],
		"method": [
			"In a bowl, mix the vanilla extract and honey into the yoghurt. Stir in the fruit and fruit juices with a spatula to create a swirling pattern. ",
			"Divide the mixture equally among four lollipop moulds. Cover with the lids or with aluminium foil.",
			"Freeze the disco pops overnight. "
		],
		"url": "www_bbc_com_food_recipes_disco_pops_02468",
		"title": "Disco pops",
		"time": {
			"preparation": "1-2 hours1-2 hours",
			"preparationMins": 120,
			"cooking": "no cooking requiredno cooking required",
			"cookingMins": 0,
			"totalMins": 120
		},
		"serves": "Makes 4Makes 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/disco_pops_02468_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Irish beef stew": {
		"ingredients": [
			"2 tbsp vegetable oil ",
			"1kg/2lb 4oz beef stewing steak, cut into 2.5cm/1in chunks",
			"2 onions",
			"3 celery stalks",
			"4 large carrots",
			"1 litre/1¾pint beef stock (from stock cubes)",
			"900g/2lb potatoes",
			"25g/1oz unsalted butter",
			"sea salt and freshly ground black pepper"
		],
		"method": [
			"Preheat the oven to 200C/180C Fan/Gas 6. Place a large saucepan over a high heat, add 1 tablespoon of the oil and brown the beef in batches so the pan isn't too full. Remove the beef from the pan and set aside on a plate. Don't clean the pan, as you'll need it to fry the vegetables.",
			"While the beef is frying, peel and chop the onions and carrots and slice the celery.",
			"Heat the remaining oil in the same saucepan and fry the onion, celery and carrot for 4–5 minutes, or until the onions have softened. Scrape any cooked on bits from the bottom of the pan; this will add flavour to the stew. Season with salt and pepper. ",
			"Mix the beef with the vegetables, then take the pan off the heat. Tip the meat and vegetables into a large ovenproof dish and pour the stock over the top.",
			"Peel and slice the potatoes into ½cm/¼in-thick slices and arrange over the top of the beef. Dot the butter over the top, then cover tightly with foil. Bake for 1 hour, then remove the foil and bake for a further 15 minutes, until the potatoes are crisp and golden-brown. Serve in deep bowls. "
		],
		"url": "www_bbc_com_food_recipes_donals_irish_beef_stew_85494",
		"title": "Irish beef stew",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "1 to 2 hours1 to 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 6Serves 6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/donals_irish_beef_stew_85494_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Duck burger and chips": {
		"ingredients": [
			"2 large duck breasts",
			"2 tbsp Vacherin cheese, scooped from the middle",
			"2 banana shallots, peeled and sliced into thin strips",
			"1 tbsp butter",
			"250g/9oz girolle mushrooms, cleaned",
			"2 brioche buns",
			"vegetable oil, for deep frying",
			"2 King Edward potatoes, cleaned and chipped"
		],
		"method": [
			"For the duck burger, roughly remove about two-thirds of the fat from each duck breast and then chop them into chunks and pass through a mincer. Season the meat well and form into two balls using your hands.",
			"Take one ball of meat and push a scoop of Vacherin into the centre. Form the meat around the Vacherin and pat down a little to make a classic burger shape. Repeat with the remaining ball and scoop of cheese.",
			"Preheat the oil in a deep fat fryer to 160C/325F (CAUTION: hot oil can be dangerous: Do not leave unattended.)",
			"Rinse the chipped potatoes under cold running water to remove any excess starch. Dry thoroughly on a clean tea towel and then place into the hot oil to cook for about 8-10 minutes. The chips should begin to lightly colour on the outside and be soft enough to crush between your fingers.",
			"Carefully remove the chips from the oil with a slotted spoon and drain on a plate lined with kitchen paper. Increase the oil temperature to 180C/350F",
			"In the meantime, heat a griddle pan over a high heat. Once hot, add the burgers and fry for 3-4 minutes on each side until nicely cooked on each side and just cooked through in the middle. If you like your burger fully cooked through, place in a hot oven for a few minutes to finish. Otherwise, place the burgers on to a plate to rest.",
			"Place the sliced shallots onto the hot griddle to caramelise. Cook for about two minutes.",
			"Heat the butter in a separate pan over a high heat. Add the mushrooms and fry for 3-4 minutes, or until just softened.",
			"When you are ready to eat, add the chips to the hot oil and cook for 2-3 minutes, or until golden-brown and crisp. Remove and drain on a plate lined with kitchen paper. ",
			"Serve the duck burgers with the shallots and mushrooms in a brioche bun."
		],
		"url": "www_bbc_com_food_recipes_duck_burger_and_chips_40267",
		"title": "Duck burger and chips",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 2Serves 2",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/duck_burger_and_chips_40267_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Duck pancakes with hoisin sauce": {
		"ingredients": [
			"4 duck breasts, about 175g/6oz each, skin removed",
			"½ tsp Chinese five spice",
			"freshly ground black pepper",
			"2 tbsp sesame oil",
			"100ml/3½fl oz hoisin sauce",
			"8-10 ready-made Chinese-style pancakes (or mini flour torillas), warmed ",
			"1 bunch spring onions, cut into matchsticks",
			"½ cucumber, halved, seeds removed and cut into matchsticks"
		],
		"method": [
			"Cut the duck into thin strips and toss in the five spice and pepper. Heat the sesame oil in a frying pan or wok and add the duck. Stir-fry for 3-4 minutes until cooked through, then add the hoisin sauce. Continue to cook for about 1 minute, until the duck is thickly coated with the sauce.",
			"Transfer the duck to a warmed dish, arrange the spring onions and cucumber in a bowl, unwrap the warmed pancakes and allow everyone to dig in and help themselves. The pancakes should be topped with some duck, spring onions and cucumber, then rolled up to resemble the Chinese classic."
		],
		"url": "www_bbc_com_food_recipes_duckpancakeswithhois_67779",
		"title": "Duck pancakes with hoisin sauce",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "less than 10 minsless than 10 mins",
			"cookingMins": 10,
			"totalMins": 40
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/duckpancakeswithhois_67779_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Earl Grey tea bread": {
		"ingredients": [
			"175g/6oz currants",
			"175g/6oz sultanas",
			"300ml10fl oz strong hot Earl Grey tea",
			"275g/9¾oz self-raising flour",
			"225g/8oz light muscovado sugar",
			"1 large free-range egg, beaten",
			"butter, for greasing, plus extra to serve"
		],
		"method": [
			"Put the currants and sultanas in a bowl and pour over the hot tea. Stir, cover and leave to soak overnight for the liquid to absorb.",
			"Preheat the oven to 150C/130C Fan/Gas 3½. Grease a 900g/2lb loaf tin and line with non-stick baking paper.",
			"Add the flour, sugar and egg to the bowl of soaked fruit (if there is a little excess liquid this is fine) and mix thoroughly.  ",
			"Spoon into the prepared tin and level the top. Bake for 1¾ hours, or until the cake is risen and just firm to the touch, but check it after 1¼ hours to see how it is doing. Leave to cool in the tin for about 10 minutes.  ",
			"Turn out the cake and remove the paper. To serve, cut into fairly thick slices and spread with butter to serve."
		],
		"url": "www_bbc_com_food_recipes_earl_grey_tea_bread_48452",
		"title": "Earl Grey tea bread",
		"time": {
			"preparation": "overnightovernight",
			"preparationMins": 720,
			"cooking": "1 to 2 hours1 to 2 hours",
			"cookingMins": 120,
			"totalMins": 840
		},
		"serves": "Makes 1 loafMakes 1 loaf",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/earl_grey_tea_bread_48452_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Easy chicken and pea risotto": {
		"ingredients": [
			"2 tbsp mild olive oil or sunflower oil",
			"1 onion, cut in half, coarsely grated",
			"2 garlic cloves, grated",
			"250g/9oz arborio risotto rice ",
			"100ml/3½fl oz white wine, dry vermouth or water",
			"1 litre/1¾ pints chicken stock cube, made with 1 stock cube",
			"250g/9oz cooked leftover chicken, skin removed, cut into small pieces",
			"200g/7oz frozen peas",
			"75g/2¾oz Grana Padano or other hard Italian-style cheese, finely grated ",
			"25g/1oz butter",
			"freshly ground black pepper"
		],
		"method": [
			"Heat the oil in a large, non-stick saucepan over a medium heat. Add the onion and garlic and fry for 2-3 minutes, stirring occasionally, until softened and just beginning to colour. ",
			"Add the risotto rice to the pan and stir well for 30-40 seconds, until the oil has coated the grains of rice. ",
			"Pour in half of the wine and allow to bubble for 30-40 seconds, then add all of the stock and bring to the boil, stirring well. Reduce the heat and simmer, uncovered, for 8-10 minutes, stirring frequently, until the rice is almost tender and the risotto is creamy in appearance. ",
			"Stir in the remaining wine, the chicken and the frozen peas, then continue to cook, stirring constantly, for a further 4-5 minutes, or until the chicken and peas are heated through and the rice is tender with a slight bite. ",
			"Remove the pan from the heat, then stir in the butter and cheese. Season with black pepper. Cover the pan with a lid and set aside for 5 minutes before serving. "
		],
		"url": "www_bbc_com_food_recipes_easy_chicken_and_pea_31687",
		"title": "Easy chicken and pea risotto",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_chicken_and_pea_31687_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Easy lemon drizzle cake": {
		"ingredients": [
			"225g/8oz unsalted butter, softened, plus extra for greasing",
			"225g/8oz caster sugar",
			"4 free-range eggs",
			"225g/8oz self-raising flour",
			"1 unwaxed lemon, zest and juice",
			"85g/3oz icing sugar"
		],
		"method": [
			"Preheat the oven to 170C/150C Fan/Gas 3½. Grease a loaf tin with a little butter and line with baking paper.",
			"Tip the remaining butter and caster sugar into a food processor and blend for a few seconds. Add the eggs one at a time, blending after each addition. Add the flour and lemon zest and blend until smooth.",
			"Pour the batter into the lined baking tin, flatten the top with the back of a spoon and bake for 40 minutes. ",
			"Meanwhile, stir together the lemon juice and icing sugar. When the cake has cooled a little, poke holes in the top using a skewer, chopstick or a piece of raw spaghetti. Drizzle over the icing, set aside for a few minutes and serve."
		],
		"url": "www_bbc_com_food_recipes_easy_lemon_drizzle_cake_78533",
		"title": "Easy lemon drizzle cake",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 8–10Serves 8–10",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_lemon_drizzle_cake_78533_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Easy roast chicken with gravy": {
		"ingredients": [
			"2 carrots, cut into chunks",
			"2 celery stalks, trimmed, cut into chunks",
			"1 onion, cut into six ",
			"1 x 2kg/4½lb whole chicken",
			"½ lemon, cut into quarters",
			"small bunch fresh mixed herbs (sage, thyme and rosemary)",
			"dash vegetable oil ",
			"salt and freshly ground black pepper",
			"potatoes and roasted vegetables, to serve",
			"275ml/½ pint chicken stock ",
			"30g/1¼oz butter ",
			"1 tbsp plain flour "
		],
		"method": [
			"Preheat the oven to 140C/120C Fan/Gas 1. ",
			"Put the carrots, celery and onion in a roasting tray and place the chicken on top. Stuff the cavity of the chicken with the lemon and herbs, then drizzle with the oil, rubbing it into the skin. Season, to taste, with salt and pepper. ",
			"Roast the chicken for 3 hours, basting the skin with the juices halfway through. Increase the oven temperature to its highest setting and continue to roast the chicken for 5-10 minutes to crisp up the skin. Remove it from the roasting tray and check it is cooked through (see tips), then set aside on a platter to rest for 10-15 minutes. Reserve the vegetables and cooking juices in the roasting tray. ",
			"Meanwhile, for the gravy, strain the reserved vegetables and cooking juices through a fine sieve into a saucepan, squeezing the vegetables with the back of a wooden spoon to extract maximum flavour. Add the stock to the pan and bring to the boil.",
			"Put the roasting tray over a low heat and add the butter. As the butter melts, scrape up any burned bits from the bottom of the tray using a wooden spoon. Whisk in the flour until it forms a paste. ",
			"Gradually pour the hot roasting juices and stock back into the roasting tray, whisking after each addition, until all the liquid is incorporated and the gravy has thickened. Season with a little salt. Heat until just bubbling, then continue to cook the gravy, stirring well, for 5 minutes. Season with a pinch of salt. ",
			"Strain the gravy through a sieve into a serving jug. Keep warm. Just before serving, stir any juices released by the rested chicken in to the gravy. ",
			"To serve, carve the roast chicken at the table and serve with roasted vegetables and potatoes. Drizzle with the gravy."
		],
		"url": "www_bbc_com_food_recipes_easy_roast_chicken_with_29774",
		"title": "Easy roast chicken with gravy",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "over 2 hoursover 2 hours",
			"cookingMins": 120,
			"totalMins": 150
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_roast_chicken_with_29774_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Easy spaghetti Bolognese": {
		"ingredients": [
			"2 tbsp olive oil ",
			"400g/14oz beef mince  ",
			"1 onion, diced ",
			"2 garlic cloves, chopped ",
			"100g/3½oz carrot, grated",
			"2 x 400g tin chopped tomatoes ",
			"400ml/14fl oz stock (made from stock cube. Ideally beef, but any will do)",
			"400g/14oz dried spaghetti ",
			"salt and pepper"
		],
		"method": [
			"Heat a large saucepan over a medium heat. Add a tablespoon of olive oil and once hot add the beef mince and a pinch of salt and pepper. Cook the mince until well browned over a medium-high heat (be careful not to burn the mince. It just needs to be a dark brown colour). Once browned, transfer the mince to a bowl and set aside.",
			"Add another tablespoon of oil to the saucepan you browned the mince in and turn the heat to medium. Add the onions and a pinch of salt and fry gently for 5-6 minutes, or until softened and translucent. Add the garlic and cook for another 2 minutes. Add the grated carrot then pour the mince and any juices in the bowl back into the saucepan.",
			"Add the tomatoes to the pan and stir well to mix. Pour in the stock, bring to a simmer and then reduce the temperature to simmer gently for 45 minutes, or until the sauce is thick and rich. Taste and adjust the seasoning as necessary.",
			"When ready to cook the spaghetti, heat a large saucepan of water and add a pinch of salt. Cook according to the packet instructions. Once the spaghetti is cooked through, drain and add to the pan with the bolognese sauce. Mix well and serve."
		],
		"url": "www_bbc_com_food_recipes_easy_spaghetti_bolognese_93639",
		"title": "Easy spaghetti Bolognese",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_spaghetti_bolognese_93639_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Easy spinach soup with a poached egg": {
		"ingredients": [
			"2 tbsp olive oil",
			"3 fat garlic cloves, finely chopped",
			"2 x 260g bags baby spinach",
			"1 litre/1¾ pints hot vegetable stock",
			"4 medium free-range eggs",
			"300ml/½ pint double cream",
			"salt and freshly ground black pepper"
		],
		"method": [
			"Heat the oil over a medium heat in a large, heavy-based saucepan. Add the garlic and fry for 1 minute. Add the spinach, a few handfuls at a time, stirring, and cook for 2 minutes. Pour in the stock, bring to the boil and simmer for 10 minutes.",
			"Meanwhile, half-fill a medium saucepan with water and bring to the boil. Crack the eggs into four small bowls. Turn the heat down so that the water is bubbling very gently. Slowly add the eggs to the water two at a time and cook for 3 minutes, or until the white is set but the yolk remains runny.",
			"Remove the soup from the heat and blitz with a stick blender until smooth. Return to the heat and stir in the cream. Heat through and season to taste with salt and pepper. ",
			"Divide the soup between four serving bowls and top each with a poached egg."
		],
		"url": "www_bbc_com_food_recipes_easy_spinach_soup_with_a_85543",
		"title": "Easy spinach soup with a poached egg",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/easy_spinach_soup_with_a_85543_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Egg-fried rice": {
		"ingredients": [
			"1 egg",
			"2 tsp sesame oil",
			"2 tbsp vegetable oil",
			"200g/7oz long-grain rice (uncooked weight), cooked and left to go cold",
			"100g/4oz frozen peas, defrosted (rinse under warm water to do this quickly)",
			"4 spring onions, finely chopped",
			"100g/4oz beansprouts (optional)",
			"1-2 tsp soy sauce",
			"ground white pepper"
		],
		"method": [
			"Beat together the egg and sesame oil and put to one side.",
			"Heat the vegetable oil in a wok or large frying pan. When it's shimmering and almost smoking, add the rice and stir-fry for about 3-4 minutes until completely heated through.",
			"Add the peas, spring onions and beansprouts, if using. Stir-fry, turning the rice constantly around the pan, for about 3 minutes. Season well with soy sauce and pepper, then push to one side of the pan. Pour the beaten egg mixture into the other side and leave for about 10 seconds so it begins to set. Using a chopstick, briskly swirl around the egg to break it up and then toss around with the rice. Stir-fry for a further minute and serve straight away."
		],
		"url": "www_bbc_com_food_recipes_eggfriedrice_67782",
		"title": "Egg-fried rice",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggfriedrice_67782_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	},

	"Egg fu yung wrap with chilli sauce": {
		"ingredients": [
			"2 tbsp groundnut oil",
			"1 small handful shiitake mushrooms or chestnut mushrooms, sliced",
			"1 red pepper, de-seeded and diced",
			"75g/3oz smoked bacon, diced",
			"5 free-range eggs, lightly beaten",
			"dash light soy sauce",
			"pinch freshly ground white pepper",
			"handful leftover chicken and/or ham, chopped",
			"2 spring onions, shredded",
			"handful mixed salad leaves",
			"sweet chilli sauce"
		],
		"method": [
			"Heat a wok until smoking and add a tablespoon of the oil. Add the mushrooms, red pepper and bacon and stir-fry for one minute, or until crisp and golden-brown.",
			"Add the stir-fry mixture to the beaten eggs and stir to combine.",
			"Carefully wipe out any excess oil from the wok with kitchen paper. Place the wok over a high heat and add the remaining oil, swirling to coat the wok. Add half the beaten egg mixture and cook for 1-2 minutes, or until golden-brown on the underside. Flip the omelette over and cook for another minute on the other side, or until golden-brown and cooked through. Season with soy sauce and freshly ground white pepper. Slide onto on a warmed plate and cover with foil. Repeat with the remaining egg mixture. ",
			"To serve, fill the omelette with the spring onion, cooked chicken or ham and salad leaves. Spoon over the sweet chilli sauce and serve immediately."
		],
		"url": "www_bbc_com_food_recipes_eggfuyoungwithroaste_89264",
		"title": "Egg fu yung wrap with chilli sauce",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "less than 10 minsless than 10 mins",
			"cookingMins": 10,
			"totalMins": 40
		},
		"serves": "Makes 2 omelette wrapsMakes 2 omelette wraps",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/eggfuyoungwithroaste_89264_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Everyday roast chicken": {
		"ingredients": [
			"a small, free-range roasting chicken",
			"75ml/3fl oz olive oil",
			"4 cloves of garlic, squashed",
			"a large lemon",
			"6 sprigs thyme",
			"salt and freshly ground black pepper"
		],
		"method": [
			"Preheat the oven to 220C/200C Fan/Gas 8.",
			"Place the chicken onto a chopping board and cut in half down the backbone using a large and very sharp cooks’ knife. Flatten the chicken as much as you can buy pressing down with the palm of your hand.",
			"Pour the olive oil into a mixing bowl large enough to take the chicken, add the squashed garlic cloves, the juice from the lemon and then the squeezed lemon shells. Put in the sprigs of thyme, a good seasoning of salt and black pepper, then turn the chicken over in the oil. (If you have the time, you can leave the chicken like this for an hour or so in the fridge.) ",
			"Place the chicken in a roasting tin, skin-side up. Roast for about 30 minutes or until the skin is golden and the bird cooked right through. "
		],
		"url": "www_bbc_com_food_recipes_everyday_roast_chicken_91003",
		"title": "Everyday roast chicken",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "30 mins to 1 hour30 mins to 1 hour",
			"cookingMins": 60,
			"totalMins": 90
		},
		"serves": "Serves 2-3Serves 2-3",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/everyday_roast_chicken_91003_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Express bacon and pesto pasta": {
		"ingredients": [
			"150g/5½oz broccoli head, thick stem removed",
			"1 onion, roughly chopped",
			"350g/12oz penne",
			"300g/10½oz smoked back bacon, cut into small pieces",
			"150g/5½oz basil pesto",
			"150g/5½oz cherry tomatoes, halved",
			"25g/1oz pine nuts, to serve",
			"salt and freshly ground black pepper",
			"25g/1oz Parmesan shavings, to serve"
		],
		"method": [
			"Cut the broccoli into florets and chop the green stems into small chunks.",
			"Heat a small frying pan until hot. Add the pine nuts and dry fry over a medium-low heat for a few minutes, until toasted and golden brown.",
			"Bring a pan of salted water to the boil, then add the onion and penne. Cook according to the pasta packet instructions, adding the broccoli 3 minutes before the end. Drain the pasta and vegetables, refreshing the broccoli separately in cold water to stop the cooking and to set the colour. Set aside the pasta to cool. ",
			"Meanwhile, fry the bacon in a large, dry pan over a medium-high heat for about 10 minutes, or until crisp and golden-brown, stirring often. Reserve 2 tablespoons of the cooked bacon and add the remainder to the pasta.",
			"Add the pesto, tomatoes and broccoli to the cooked pasta mixture. Season with black pepper and stir.",
			"Tip into a serving dish, scatter with toasted pine nuts, the reserved bacon and Parmesan and serve."
		],
		"url": "www_bbc_com_food_recipes_express_bacon_and_pesto_15099",
		"title": "Express bacon and pesto pasta",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "10 to 30 mins10 to 30 mins",
			"cookingMins": 30,
			"totalMins": 60
		},
		"serves": "Serves 4-6Serves 4-6",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/express_bacon_and_pesto_15099_16x9.jpg",
		"isVegetarian": false,
		"recommendations": 0
	},

	"Fennel beetroot slaw": {
		"ingredients": [
			"2 fennel bulbs, shredded",
			"½ small red cabbage, shredded",
			"4 beetroot, peeled and shredded",
			"4 spring onions, chopped",
			"6 tbsp soured cream",
			"3 tbsp nigella seeds"
		],
		"method": [
			"Combine all the vegetables in a bowl with the soured cream and nigella seeds. ",
			"Stir and serve."
		],
		"url": "www_bbc_com_food_recipes_fennel_beetroot_slaw_05158",
		"title": "Fennel beetroot slaw",
		"time": {
			"preparation": "less than 30 minsless than 30 mins",
			"preparationMins": 30,
			"cooking": "no cooking requiredno cooking required",
			"cookingMins": 0,
			"totalMins": 30
		},
		"serves": "Serves 4Serves 4",
		"image":
			"https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/fennel_beetroot_slaw_05158_16x9.jpg",
		"isVegetarian": true,
		"recommendations": 0
	}
}
