{
  "Simple layered salad": {
  "ingredients": [
    "250g/9oz salad potatoes, diced",
    "½ small bunch spring onions",
    "½ apple, grated or finely chopped",
    "fresh horseradish (to taste), peeled and finely chopped",
    "25g/1oz anchovies or pickled herring",
    "half a head of lettuce, shredded",
    "2 carrots, grated",
    "4 medium cooked beetroot",
    "2 free-range eggs, hard boiled",
    "6 cornichons, finely chopped",
    "a few sprigs of dill, finely chopped",
    "half large cucumber, seeds removed and finely chopped",
    "salt and freshly ground black pepper"
  ],
  "method": [
    "Bring a pot of salted water to the boil and add the potatoes. Cook until soft, then drain and leave to cool. When cool, put in a bowl with the spring onions, apple, horseradish and anchovies and fold all of the ingredients gently together.",
    "Separate the egg yolk from the egg white and finely chop both. ",
    "To assemble the salad, put a layer of the lettuce at the bottom of a large glass bowl. Top the lettuce with a layer of potato salad (reserve a little potato salad), followed by a layer of carrots, beetroot, cucumber and a final layer of potato salad. As you are building up the layers, sprinkle the dill and cornichons throughout each layer and season with a little salt and pepper. ",
    "Top the salad with the chopped egg and a final sprinkling of dill. "
  ],
  "url": "www_bbc_com_food_recipes_a_simple_layered_salad_21760",
  "title": "Simple layered salad",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 4-6Serves 4-6",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/a_simple_layered_salad_21760_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"A classic sponge cake (with passion fruit filling)": {
  "ingredients": [
    "175g/6oz self-raising flour ",
    "1 rounded tsp baking powder ",
    "3 large eggs at room temperature ",
    "175g/6oz very soft butter  ",
    "175g/6oz golden caster sugar ",
    "½ tsp vanilla extract ",
    "a little sifted icing sugar, for dusting ",
    "6 passion fruit ",
    "250g/9oz mascarpone  ",
    "1 level dessertspoon golden caster sugar ",
    "1 tsp vanilla extract ",
    "200ml/7fl oz fromage frais "
  ],
  "method": [
    "Preheat the oven to 170C/325F/Gas 3.",
    "Take a very large mixing bowl, put the flour and baking powder in a sieve and sift it into the bowl, holding the sieve high to give it a good airing as it goes down. Now all you do is simply add all the other cake ingredients (except the icing sugar) to the bowl and, provided the butter is really soft, just go in with an electric hand whisk and whisk everything together until you have a smooth, well-combined mixture, which will take about one minute. If you do not have an electric hand whisk, you can use a wooden spoon, using a little bit more effort. What you will now end up with is a mixture that drops off a spoon when you give it a tap on the side of the bowl. If it seems a little too stiff, add a little water and mix again. ",
    "Now divide the mixture between the two tins, level it out and place the tins on the centre shelf of the oven. The cakes will take 30-35 minutes to cook, but do not open the oven door until 30 minutes have elapsed. ",
    "To test whether the cakes are cooked or not, touch the centre of each lightly with a finger: if it leaves no impression and the sponges spring back, they are ready. ",
    "Next, remove them from the oven, then wait about five minutes before turning them out on to a wire cooling rack. Carefully peel off the base papers, which is easier if you make a fold in the paper first, then pull it gently away without trying to lift it off. Now leave the sponges to get completely cold, then add the filling. ",
    "To make this, first slice the passion fruit into halves and, using a tsp, scoop all the flesh, juice and seeds into a bowl. ",
    "Next, in another bowl, combine the mascarpone, fromage frais, sugar and vanilla extract, using a balloon whisk, which is the quickest way to blend them all together. After that, fold in about two-thirds of the passion fruit. ",
    "Now place the first sponge cake on the plate or cake stand you are going to serve it on, then spread half the filling over it, drizzle the rest of the passion fruit over that, then spread the remaining filling over the passion fruit. Lastly, place the other cake on top, press it gently so that the filling oozes out at the edges, then dust the surface with a little sifted icing sugar."
  ],
  "url": "www_bbc_com_food_recipes_aclassicspongecakewi_9406",
  "title": "A classic sponge cake (with passion fruit filling)",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "30 mins to 1 hour30 mins to 1 hour",
    "cookingMins": 60,
    "totalMins": 90
  },
  "serves": "Serves 8Serves 8",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/aclassicspongecakewi_9406_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"A creamy, crunchy fruit sundae": {
  "ingredients": [
    "1 pot double cream (about 250ml/7fl oz)",
    "1 or 2 large meringues",
    "1 good handful blackberries, or any soft fruit works well ",
    "1 small handful shelled unsalted pistachio nuts",
    "vanilla ice cream, to serve",
    "icing sugar, to serve"
  ],
  "method": [
    "Whisk the double cream in a bowl. I like to do this by hand as I have complete control over it and I beat the cream until it just starts to feel heavy on my whisk - but don't over-whisk it. ",
    "Break the meringues into the cream - rough chunks are good. Scatter in the blackberries (they work perfectly with the meringue as they cut through the sweetness). To break up the smoothness of this sundae I add some pistachio nuts. Gently fold together so that the fruits burst through the cream. ",
    "Place a large scoop of vanilla ice cream in the bottom of two sundae glasses and top with spoonfuls of the blackberry cream and dust with icing sugar. This dessert has something soft, something crisp, something sweet and something sharp, which makes it perfection."
  ],
  "url": "www_bbc_com_food_recipes_acreamycrunchyfruits_92490",
  "title": "A creamy, crunchy fruit sundae",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "no cooking requiredno cooking required",
    "cookingMins": 0,
    "totalMins": 30
  },
  "serves": "Serves 2Serves 2",
  "isVegetarian": true,
  "recommendations": 0,
  "image": "https://keyassets-p2.timeincuk.net/wp/prod/wp-content/uploads/sites/50/2009/08/09042-033.jpg"
},

"Aglio e peperoncino": {
  "ingredients": [
    "3 tbsp olive oil",
    "2 garlic cloves, finely chopped",
    "1 red chilli, chopped",
    "200g/7oz dried linguine, cooked according to packet instructions",
    "6 fresh basil leaves, torn"
  ],
  "method": [
    "Heat the oil in a pan and fry the garlic and chilli for 1-2 minutes, or until softened. Add the cooked linguine to the pan and toss to coat, then stir in the basil leaves.",
    "To serve, place the linguine onto a serving plate."
  ],
  "url": "www_bbc_com_food_recipes_aglioepeperoncino_90110",
  "title": "Aglio e peperoncino",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 1Serves 1",
  "isVegetarian": true,
  "recommendations": 0,
  "image":"http://www.oliviascuisine.com/wp-content/uploads/2017/02/garlic-oil-spaghetti.jpg"
},

"Aged sirloin steak with Thai salad and toasted hazelnuts": {
  "ingredients": [
    "4 x 300g/10½oz aged sirloin steaks ",
    "4 tbsp olive oil",
    "salt and freshly ground black pepper",
    "¼ red cabbage, thinly sliced",
    "1 small red onion, thinly sliced",
    "1 Asian pear, peeled and finely chopped",
    "½ coconut, ¼ shaved, ¼ grated",
    "2 tbsp fresh coriander leaves",
    "2 tbsp fresh mint leaves",
    "4 tbsp sesame seeds",
    "2 limes, juice only",
    "4 garlic cloves, crushed",
    "2 tbsp finely grated ginger",
    "2 tbsp palm sugar",
    "4 tbsp fish sauce",
    "6 tbsp soy sauce",
    "2 red chillies, 1 finely chopped, 1 sliced",
    "2 tbsp chopped fresh mint leaves",
    "2 tbsp chopped fresh coriander leaves",
    "2 tbsp toasted hazelnuts, roughly chopped",
    "1 lime, halved"
  ],
  "method": [
    "Season the steaks with salt and pepper and rub the oil all over. Heat a griddle pan and cook the steaks to your liking. Remove from the heat, and leave to rest for around the same time you cooked it for.",
    "To make the salad, put all the ingredients into a bowl and mix well.",
    "Put all the ingredients for the dressing into a pestle and mortar and pound to a rough paste. Just before serving, add the dressing to the salad and mix well.",
    "To serve, cut the steak into slices and lay on a serving dish. Add the salad over the slices of steak, and garnish with the chopped nuts and the lime on the side."
  ],
  "url": "www_bbc_com_food_recipes_aged_sirloin_steak_with_62354",
  "title": "Aged sirloin steak with Thai salad and toasted hazelnuts",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "less than 10 minsless than 10 mins",
    "cookingMins": 10,
    "totalMins": 40
  },
  "serves": "Serves 4Serves 4",
  "isVegetarian": false,
  "recommendations": 0,
  "image": "https://www.wholefoodsmarket.com/sites/default/files/styles/header_recipe/public/media/1138-1.jpg?itok=e5x91VQk"
},

"Aji de gallina": {
  "ingredients": [
    "2 chicken breasts",
    "50g fresh white breadcrumbs",
    "200ml whole milk",
    "2-3 tbsp olive oil or vegetable oil",
    "1 large onion, chopped",
    "3 cloves garlic, chopped",
    "1 large mild green chilli, seeds removed, finely chopped",
    "1 tsp paprika",
    "¼ tsp turmeric",
    "salt and freshly ground black pepper",
    "35g ground walnuts",
    "20g grated parmesan"
  ],
  "method": [
    "Place the chicken in a saucepan, add just enough boiling water to cover, then bring to the boil and simmer for 8-10 minutes, or until opaque and cooked through. Remove from the water and set aside on a plate to cool, reserve the cooking liquor. When cool enough to handle, shred the chicken.",
    "Meanwhile, soak the breadcrumbs in the milk.",
    "Heat the oil in a large frying pan over a medium-high heat and fry the onion for 7-8 minutes, or until softened and golden. Add the garlic and chilli and fry for a further minute until fragrant. Stir in the paprika, turmeric and seasoning and fry for a minute, adding a little more oil if the mixture looks dry.",
    "Add the shredded chicken and stir to coat in the spices for a minute, then pour in the soaked breadcrumbs and milk. Add 200ml of the reserved stock, bring to a boil then lower the heat and simmer gently for five minutes. Stir in the nuts and simmer for a further 5 minutes, or until the sauce is rich and creamy, adding a little more stock if it gets too thick.",
    "Stir in the parmesan, season to taste with salt and freshly ground black pepper."
  ],
  "url": "www_bbc_com_food_recipes_aji_de_gallina_78858",
  "title": "Aji de gallina",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "30 mins to 1 hour30 mins to 1 hour",
    "cookingMins": 60,
    "totalMins": 90
  },
  "serves": "Serves 2Serves 2",
  "isVegetarian": false,
  "recommendations": 0,
  "image": "https://www.enmicocinahoy.cl/wp-content/uploads/2010/05/aji-gallina-h.jpg"
},

"Almond cake with pears poached in red wine": {
  "ingredients": [
    "110g/3½oz butter, softened, plus extra for greasing",
    "280g/9½oz caster sugar",
    "3 free-range eggs, beaten",
    "2–3 drops almond extract",
    "110g/3½oz ground almonds",
    "40g/1½oz plain flour",
    "2 oranges, rind only, cut into thin strips, to decorate",
    "50g/1¾oz flaked almonds, to decorate",
    "50g/1¾oz mixed nuts, to decorate",
    "crème fraîche, to serve",
    "300ml/10fl oz red wine ",
    "130g/4½oz caster sugar",
    "pared rind of 1 unwaxed lemon ",
    "1 cinnamon stick",
    "4 dessert pears"
  ],
  "method": [
    "Preheat the oven to 160C/140C Fan/Gas 3. Lightly butter and line a 20cm/8in loose-bottomed sandwich tin.",
    "Beat the butter with a wooden spoon or in a food processor to soften. Add 130g/4½oz sugar gradually, beating constantly, until soft and light. Add the eggs and almond extract and beat well. Fold in the ground almonds and flour.",
    "Tip the cake mixture into the prepared tin and bake for 35 minutes. Test if the cake is cooked by inserting a skewer into the centre; if it comes out clean the cake is ready. Leave the cake to cool in the tin for 10 minutes, then turn out onto a wire rack. ",
    "Turn the oven temperature up to 200C/180C Fan/Gas 6. Line a baking tray with baking paper.",
    "Meanwhile, for the poached pears, place a large saucepan over a medium heat. Pour in the wine and 300ml/10fl oz water. Stir in the sugar, lemon rind and cinnamon stick. Bring to the boil and allow to bubble for 1 minute.",
    "Keeping the stalks on the pears, peel and remove the eye from the base of each pear. Place the pears in the wine syrup and poach for 30 minutes, or until tender to the point of a knife.",
    "To make the cake decoration, put the orange rind in a saucepan of water over a high heat. Bring to the boil, change the water and bring back to the boil. Meanwhile, make a sugar syrup by heating 50g/1¾oz sugar and 100ml/3½fl oz water in a saucepan. Place the rind in the sugar syrup and boil for 20 minutes. Transfer to the prepared baking tray and bake for 15 minutes.",
    "To make the nut brittle for the cake, put the remaining 100g/3½oz sugar in a saucepan over a low heat and slowly melt until it caramelises. Stir in the nuts, then pour the mixture onto baking paper to cool. Chop up into brittle. ",
    "Decorate the cake with the orange strips and nut brittle and serve with the poached pears and crème fraîche."
  ],
  "url": "www_bbc_com_food_recipes_almond_cake_and_pears_45958",
  "title": "Almond cake with pears poached in red wine",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "1 to 2 hours1 to 2 hours",
    "cookingMins": 120,
    "totalMins": 150
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/almond_cake_and_pears_45958_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Ajwain parathas": {
  "ingredients": [
    "250g/9oz wholemeal flour, plus extra for dusting",
    "¼ tsp salt",
    "7 tsp olive oil",
    "1½ tsp ajwain seeds "
  ],
  "method": [
    "Place the flour in a large bowl and make a well in the centre. Add the salt and one teaspoon of the oil to the well, then gradually add 150ml/5fl oz warm water. Stir until the mixture forms a soft dough. If the dough is dry and does not come together, add an extra 1-2 tablespoons of water.",
    "Knead the dough by clenching your hand into a fist, then wet your knuckles and press them repeatedly into the dough, pressing against the side of the bowl, until a soft, smooth dough forms. This should take about 10 minutes. ",
    "Divide the dough into six balls of equal size. Dust each ball with a little flour to prevent it sticking, then roll out on a lightly floured surface into 15cm/6in circles. ",
    "Sprinkle ¼ teaspoon of ajwain seeds over the circles and press the seeds into each paratha. ",
    "Smear one teaspoon of olive oil over each paratha. With a sharp knife, slit the paratha to make two semi-circles and fold, then fold again to make a quarter circle (or triangle). ",
    "Flatten the triangle with your fingers and roll it out again. Use circular motions to do this to try to keep to the shape. While rolling do not press down too hard as this will cause the layers to stick together and the paratha will not be flaky. About 5mm/¼in in thickness is good. ",
    "Heat a shallow frying pan over a medium heat until a splash of water sizzles on the surface.",
    "Place a paratha in the pan and cook for 20 seconds, or until the top starts to brown and slightly bubble. Turn the paratha over using a spatula and continue cooking for about 30 seconds, or until brown spots appear. Flip it over one more time and, using the spatula, carefully press down all over. Turn over again and repeat on the other side until you have the desired crispiness. ",
    "Keep each paratha warm, while you repeat to cook them all. Serve hot."
  ],
  "url": "www_bbc_com_food_recipes_ajwain_parathas_37143",
  "title": "Ajwain parathas",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Makes 10 small parathasMakes 10 small parathas",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/ajwain_parathas_37143_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Albanian baked lamb with rice (Tavë kosi)": {
  "ingredients": [
    "70g/2½oz butter",
    "1 tbsp olive oil",
    "1.2kg/2lb 12oz boned lamb shoulder, cut into 5cm/2in cubes",
    "4 garlic cloves, grated",
    "1 tsp dried oregano",
    "60g/2¼oz long-grain rice, rinsed",
    "50g/1¾oz plain flour",
    "600ml/20fl oz Greek-style yoghurt",
    "4 free-range eggs, beaten",
    "freshly grated nutmeg, to finish",
    "salt and freshly ground black pepper"
  ],
  "method": [
    "Preheat the oven to 180C/160C Fan/Gas 4.",
    "Heat 20g/¾oz of the butter and the olive oil in a large lidded pan over a high heat. Brown the lamb in batches.",
    "Return all the lamb to the pan. Add the garlic, oregano and 200ml/7fl oz water. Bring to a simmer and cook, covered with a lid, for about 45–60 minutes until the lamb is tender.",
    "Stir in the rice, and season with salt and pepper. Transfer to a 3 litre/5¼ pint earthenware or other ovenproof dish.",
    "Melt the remaining butter in a small saucepan, add the flour and make a roux, cook for 2 minutes, then take off the heat. Add the yoghurt and mix well, then return to the heat and cook gently for a couple of minutes. Take off the heat, add the beaten eggs and season with salt and pepper.",
    "Pour the sauce over the lamb and rice mixture, grate fresh nutmeg on top and bake for 40–45 minutes until starting to turn golden-brown.",
    "Remove from the oven and allow to sit for 5 minutes before serving. Serve with a simple lettuce salad. "
  ],
  "url": "www_bbc_com_food_recipes_albanian_baked_lamb_with_92485",
  "title": "Albanian baked lamb with rice (Tavë kosi)",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "1 to 2 hours1 to 2 hours",
    "cookingMins": 120,
    "totalMins": 150
  },
  "serves": "Serves 8Serves 8",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/albanian_baked_lamb_with_92485_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},
"Prawns al cremat with a Little Gem, dandelion and watercress salad served with aioli": {
  "ingredients": [
    "2 tbsp olive oil",
    "1 shallot, peeled, finely chopped",
    "1 anchovy fillet, chopped",
    "½ tsp finely chopped red chilli",
    "1 garlic, peeled, finely chopped",
    "5 king prawns, peeled, heads and tails left on",
    "100ml/3½fl oz dry white wine",
    "200ml/7¼fl oz fish soup ",
    "1 tbsp chopped fresh flatleaf parsley",
    "1 tbsp persillade (equal quantities of finely chopped garlic and parsley)",
    "1 tbsp breadcrumbs",
    "6 garlic cloves, cut in half",
    "1 tbsp Dijon mustard",
    "125ml/4½fl oz extra virgin olive oil",
    "pinch ground espelette pepper (or pinch paprika and cayenne pepper)",
    "1 lemon, juice only",
    "50ml/1¾fl oz sherry vinegar",
    "200ml/7¼fl oz olive oil",
    "1 tsp Dijon mustard",
    "1 shallot, peeled, finely diced",
    "2 Little Gem lettuces, leaves separated",
    "25g/1oz dandelion leaves",
    "1 bunch watercress",
    "1 tbsp chopped fresh tarragon",
    "1 tbsp chopped fresh chervil",
    "1 tbsp chopped fresh mint",
    "4 slices toasted sourdough bread"
  ],
  "method": [
    "For the al cremat, heat the oil in a lidded frying pan and fry the shallot, anchovy, chilli and garlic for 30 seconds. Stir in the prawns.",
    "Add the wine and stir well. Continue to cook until the volume of the liquid has reduced by three-quarters. Add the fish soup, cover with a lid and cook for three minutes.",
    "Remove the lid and add the parsley and persillade; cover and cook for a further 30 seconds. Set aside.",
    "For the aioli, crush the garlic and salt in a pestle and mortar to a paste. Transfer the mixture to a bowl and whisk in the Dijon mustard. Gradually whisk in the olive oil, a little at a time, until the mixture resembles mayonnaise. Set aside.",
    "For the Little Gem, dandelion and watercress salad, whisk the sherry vinegar, olive oil, Dijon mustard, shallot and salt and freshly ground black pepper in a small bowl. Place the Little Gem lettuce, dandelion, watercress and herbs into a large bowl, pour over the dressing and mix until well combined.",
    "To serve, add the espelette pepper and lemon juice to the aioli and mix until well combined. Spoon into a small bowl.",
    "Spoon the al cremat onto each of two serving plates. Serve the the Little Gem, dandelion and watercress salad, aioli and toast alongside."
  ],
  "url": "www_bbc_com_food_recipes_alcrematwithalittleg_94027",
  "title": "Prawns al cremat with a Little Gem, dandelion and watercress salad served with aioli",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "1 to 2 hours1 to 2 hours",
    "cookingMins": 120,
    "totalMins": 150
  },
  "serves": "Serves 4Serves 4",
  "isVegetarian": false,
  "recommendations": 0,
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_320/recipes/jumbo_prawns_with_15297_16x9.jpg"
},

"Basic tortellini with ricotta and pine nuts": {
  "ingredients": [
    "200g/7oz ‘00’ pasta flour, plus extra for dusting",
    "2 free-range eggs, lightly beaten",
    "12 large fresh basil leaves, plus 18-20 small basil leaves, plus extra to serve",
    "225g/8oz buffalo-milk ricotta (or cows’ milk ricotta)",
    "60g/2¼oz toasted pine nuts, to serve",
    "grated parmesan (or a similar vegetarian hard cheese), to serve",
    "50g/1¾oz fresh basil leaves, chopped",
    "10g/¼oz toasted pine nuts",
    "25g/1oz parmesan, grated",
    "1 garlic clove, crushed",
    "25ml/1fl oz extra virgin olive oil",
    "50ml/2fl oz olive oil",
    "salt and freshly ground black pepper"
  ],
  "method": [
    "Blend the flour and eggs together in a food processor until the mixture resembles breadcrumbs. Turn the mixture out onto a lightly floured work surface and squash the crumbs into a ball of dough. Knead the dough for 4-5 minutes, or until smooth and elastic. Wrap the dough in cling film and chill in the fridge for 20 minutes.",
    "For the pesto, grind the basil, pine nuts, parmesan and garlic to a rough paste in a pestle and mortar. Gradually pour in both the oils, stirring as you add them. Season, to taste, with salt and freshly ground black pepper. Set aside, covered, until needed.",
    "To prepare the pasta, dust the rollers of a pasta machine with flour. Cut the chilled pasta into three pieces and flatten each out to a thickness of about 1cm/½in. ",
    "Set the pasta machine to its widest setting and feed one piece of dough through the machine, turning the handle with one hand and collecting the rolled dough as it comes through the machine with the other.",
    "Change the setting on the pasta machine to the next thickest setting, dust the rollers with a little flour, then feed the same pasta sheet through the machine again, as before. Repeat this process three or four more times, flouring the machine and changing the setting down each time, until you reach the penultimate setting. As your pasta sheet becomes longer, cut it in half so that the rolling process is more manageable. ",
    "Repeat the rolling process with the remaining two pieces of dough. Once all of the dough has been rolled out, you should have six long sheets of pasta. ",
    "To make the tortellini, place one long sheet of the pasta onto the work surface with the longest side facing you. Place two large basil leaves in the bottom half of the pasta, then fold the top half over the basil leaves. Set the pasta machine to its finest setting and pass the sheet through the machine again. Repeat the process with the remaining pasta sheets and large basil leaves.",
    "Cut the pasta sheets into 9cm/4in discs using a cookie cutter. Place one small basil leaf into the centre of each, and top with one teaspoonful of ricotta.",
    "One by one, brush the edges of each pasta disc with a little water. Bring the edges of each disc together to form a semi-circular shape, pressing the edges together with your fingertips to seal. Bring the pointed ends of the tortellini towards each other around your fingertip to form a ring, then press the corners together using your other hand. ",
    "Repeat the process with the remaining pasta discs, basil and ricotta; you should end up with 20 tortellini.",
    "Bring a large pan of salted water to the boil. Carefully lower the tortellini into the boiling water, in batches, and cook for 3-4 minutes, or until they float to the surface of the water. Remove from the pan using a slotted spoon and set aside in a bowl, keeping warm. Cook the remaining tortellini. ",
    "Add the pesto to the tortellini and mix gently until coated. Sprinkle over the pine nuts.",
    "To serve, spoon the tortellini and pesto onto serving plates. Sprinkle some grated parmesan over each and garnish with a few small basil leaves."
  ],
  "url": "www_bbc_com_food_recipes_basic_tortellini_with_38575",
  "title": "Basic tortellini with ricotta and pine nuts",
  "time": {
    "preparation": "1-2 hours1-2 hours",
    "preparationMins": 120,
    "cooking": "less than 10 minsless than 10 mins",
    "cookingMins": 10,
    "totalMins": 130
  },
  "serves": "Makes 20Makes 20",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basic_tortellini_with_38575_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Basque chicken and chorizo pie": {
  "ingredients": [
    "4 boneless, skinless chicken thighs, cut into bite-sized pieces",
    "2 tsp smoked paprika",
    "2 tsp flaked sea salt",
    "freshly ground black pepper",
    "2 tbsp olive oil",
    "2 medium onions, cut into 12 wedges",
    "1 green pepper, halved, seeded and sliced",
    "1 red pepper, halved, seeded and sliced",
    "3-4 sprigs fresh thyme",
    "2 bay leaves",
    "150g/5½oz chorizo sausage, skinned and cut into thin slices",
    "3 garlic cloves, crushed",
    "4 large ripe tomatoes (each about 100g/4½oz), skinned and roughly chopped",
    "2 tbsp flour",
    "225g/8oz plain flour, plus extra for dusting",
    "1 tsp baking powder",
    "½ tsp fine sea salt",
    "75g/2¾oz unsalted butter, plus extra for greasing",
    "1 medium egg yolk",
    "4–5 tbsp cold water",
    "1 egg, beaten, or full-fat milk, to glaze"
  ],
  "method": [
    "Put the chicken pieces in a bowl and sprinkle over the paprika, salt and plenty of freshly ground black pepper. Rub the seasoning into the meat and set aside.",
    "Heat the oil in a large frying pan and fry the onions and peppers with the thyme and bay leaves for 3 minutes, while stirring. Add the chicken and seasoning and cook for another 3 minutes, turning the chicken regularly until it is starting to colour. Add the chorizo and garlic and fry for 2 minutes more. Add the tomatoes and cook for 5 minutes or until they are softened and juicy, stirring regularly.",
    "Tilt the pan so that the liquid runs to one side and sprinkle the flour over the vegetables, chicken and chorizo. Stir it in quickly, then set the pan level and stir the cooking liquor into the flour. Doing it this way should prevent little clumps of flour – but don’t worry if you do have a few, no-one will notice. Add more salt and pepper if necessary and continue to cook for one minute, stirring until the sauce thickens. Remove from the heat and tip everything into a roasting tin or ovenproof dish, measuring about 25x30cm/10x12in and at least 4cm/1½in deep. Leave to cool.",
    "For the pastry, pulse the flour, baking powder, salt, butter and egg yolk in a food processor until the mixture resembles breadcrumbs. Slowly pour in the water with the motor running, blending until the mixture just comes together as a dough (you may not need to use all of the water). Form the dough into a ball. ",
    "Preheat the oven to 200C/400F/Gas 6.",
    "Roll the pastry out into a rectangle about the same size as the tin. Place it over the pie filling and tuck the sides of the pastry down around the filling. Brush with beaten egg or milk to glaze.",
    "Bake for about 30 minutes or until the pastry is golden and the filling is hot."
  ],
  "url": "www_bbc_com_food_recipes_basque_chicken_pie_70267",
  "title": "Basque chicken and chorizo pie",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "30 mins to 1 hour30 mins to 1 hour",
    "cookingMins": 60,
    "totalMins": 90
  },
  "serves": "Serves 4 - 5Serves 4 - 5",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/basque_chicken_pie_70267_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"BBQ chicken with coleslaw": {
  "ingredients": [
    "100ml/3½fl oz cider vinegar",
    "2 tbsp dark brown sugar",
    "1 tsp smoked paprika",
    "1 tbsp Dijon mustard",
    "1 tbsp dark soy sauce",
    "½ tsp sea salt and black pepper",
    "4 boneless chicken thighs, skin on",
    "½ small red cabbage, finely sliced",
    "2 carrots, coarsely grated",
    "1 small/½ large red onion, finely sliced",
    "8 radishes, sliced",
    "3 spring onions, very finely sliced",
    "2 limes, juice only ",
    "2 tsp black onion seeds",
    "1 tbsp sunflower seeds ",
    "1 tbsp pumpkin seeds  ",
    "small bunch fresh coriander, finely chopped",
    "small bunch fresh mint, finely chopped"
  ],
  "method": [
    "To make the glaze for the chicken, combine the vinegar with 100ml/3½fl oz water in a saucepan. Add the sugar, smoked paprika, mustard and soy sauce. Stir to combine then bring to the boil. Reduce the heat and simmer for 10 minutes, or until thickened. Remove from the heat and season to taste with salt and pepper.",
    "Meanwhile, add the ingredients for the coleslaw to a large bowl, toss to combine and season to taste.",
    "Heat a griddle pan over a high heat until smoking hot. Open the chicken thighs out and season with salt and pepper. Place the chicken skin-side down on the griddle and fry for 3-4 minutes. ",
    "Brush the chicken with a little glaze then turn and cook for a further 3-4 minutes, brushing occasionally with the glaze as you cook. Turn off the heat and rest for five minutes. ",
    "Slice thickly and serve with the coleslaw. Drizzle with any sticky cooking juices before serving."
  ],
  "url": "www_bbc_com_food_recipes_bbq_chicken_with_52315",
  "title": "BBQ chicken with coleslaw",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbq_chicken_with_52315_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"BBQ ‘beer-can’ chicken": {
  "ingredients": [
    "4 tbsp light golden ale, plus 500ml/17floz to marinade the chicken, plus 300ml/10½fl oz light golden ale for roasting (reserve the empty beer can)",
    "90g/3oz malt extract",
    "½ tsp chilli powder",
    "½ tsp English mustard powder",
    "½ tsp crushed garlic",
    "½ tsp smoked paprika",
    "½ tsp muscovado sugar",
    "1 x 2kg/4lb 4oz chicken, preferably free-range",
    "160g/5½oz butter",
    "pinch salt"
  ],
  "method": [
    "For the chicken, mix four tablespoons of the ale, the malt extract, chilli powder, mustard, garlic, smoked paprika and sugar together in a bowl to make a paste.",
    "Rub the paste all over the chicken and set aside to marinate for three hours. Pour over 500ml/18fl oz of ale and leave to marinade overnight",
    "Preheat the barbecue (it is best to use a barbecue with a lid) or alternatively preheat the oven to 190C/375F/Gas 5.",
    "Rinse the marinade off the chicken and pat dry. Carefully smear the butter under the chicken skin and over the thighs and season with salt. Pour the 300ml/10½fl oz ale into the reserved beer can, then carefully place the chicken onto the beer can, so that the chicken is sitting upright, with the can in its cavity.",
    "Roast the chicken for 40-45 minutes, basting a couple of times. Remove the chicken from the barbecue or oven and set aside to rest for 15 minutes."
  ],
  "url": "www_bbc_com_food_recipes_bbq_beer-can_chicken_80142",
  "title": "BBQ ‘beer-can’ chicken",
  "time": {
    "preparation": "overnightovernight",
    "preparationMins": 720,
    "cooking": "1 to 2 hours1 to 2 hours",
    "cookingMins": 120,
    "totalMins": 840
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bbq_beer-can_chicken_80142_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Beef and horseradish sausage rolls": {
  "ingredients": [
    "2 tbsp olive oil ",
    "1 garlic clove, crushed ",
    "½ tsp salt ",
    "300g/10½oz chestnut mushrooms, thinly sliced",
    "3 tbsp horseradish purée",
    "800g/1lb 12oz beef sausages, skins removed ",
    "500g/1lb 2oz ready-made puff pastry",
    "1 free-range egg, beaten ",
    "little plain flour, for dusting"
  ],
  "method": [
    "Heat the oil in a medium saucepan over a medium heat. Add the garlic, salt and mushrooms and cook until all the moisture from the mushrooms has evaporated. Transfer to a bowl and leave to cool completely. ",
    "Stir the horseradish purée into the mushrooms. Add the beef sausage meat and mix until well combined using your hands. ",
    "Preheat the oven to 200C/180C Fan/Gas 6. Line a baking tray with baking paper.",
    "Lightly dust a work surface with flour. Roll out the pastry to 25x35cm/10x14in, then cut it into three equal rectangles lengthways. Roll out each rectangle a little more, to create more width. ",
    "Divide the beef mixture into three equal parts. Spread one part down one side of a pastry rectangle in a long, thin sausage shape. Brush the long edge with a little beaten egg and roll the pastry up over the sausage meat to seal. Repeat with the remaining sausage meat and pastry.",
    "Cut each long piece into eight to ten sausage rolls and place on the prepared baking tray.  Brush each pastry with a little more beaten egg, then bake for 15–20 minutes. ",
    "Leave to cool for 10 minutes before eating as they will be very hot."
  ],
  "url": "www_bbc_com_food_recipes_beef_and_horseradish_44048",
  "title": "Beef and horseradish sausage rolls",
  "time": {
    "preparation": "30 mins to 1 hour30 mins to 1 hour",
    "preparationMins": 60,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 90
  },
  "serves": "Makes 24–30 sausage rollsMakes 24–30 sausage rolls",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beef_and_horseradish_44048_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Beef stroganoff with sautéed potatoes": {
  "ingredients": [
    "75g/3oz butter",
    "1 onion, finely sliced",
    "150g/5oz white mushrooms, finely sliced",
    "2 tbsp tomato purée",
    "1½ tsp Dijon mustard",
    "½ tsp hot smoked paprika",
    "110ml/4fl oz beef stock",
    "500g/1lb 2oz beef fillet, cut into strips",
    "salt and freshly ground black pepper ",
    "150ml/5fl oz brandy",
    "200ml/7fl oz soured cream",
    "2 tbsp flatleaf parsley",
    "3 tbsp olive oil",
    "3 large potatoes, peeled and cubed",
    "½ onion, finely chopped"
  ],
  "method": [
    "Heat a frying pan until hot, then add half the butter. When foaming, add the onion and fry for 2–3 minutes, or until just softened.",
    "Add the mushrooms and cook for 1–2 minutes.",
    "Add the tomato purée, mustard and paprika and cook for a further minute.",
    "Add the beef stock and bring to the boil, then reduce the heat and simmer for 3–4 minutes.",
    "Season the beef with salt and freshly ground black pepper.",
    "Heat a separate frying pan and add the remaining butter. When foaming, add the beef and fry for 2–3 minutes on both sides, until browned all over.",
    "Add the brandy and carefully allow to flambé in the pan. (CAUTION: make sure there are no flammable materials above the pan when flaming.)",
    "Add the soured cream to the onion and mushroom mixture and mix well.",
    "When the flames have subsided, add the beef to the soured cream and mushroom mixture and cook for one minute. Season, to taste, with salt and freshly ground black pepper and add the parsley.",
    "For the sautéed potatoes, heat the oil in a frying pan until hot, then add the potatoes and cook for 2–3 minutes on each side, or until tender and golden-brown all over. Season well with salt and freshly ground black pepper and add the onions. Stir gently to combine.",
    "To serve, place two spoonfuls of the sautéed potatoes onto each plate and spoon equal portions of the beef stroganoff alongside."
  ],
  "url": "www_bbc_com_food_recipes_beefstroganoffwithsa_89439",
  "title": "Beef stroganoff with sautéed potatoes",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/beefstroganoffwithsa_89439_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Bengali butternut squash with chickpeas": {
  "ingredients": [
    "3 tbsp vegetable oil",
    "large pinch ground asafoetida",
    "1 bay leaf",
    "½ tsp panch phoran (a blend of equal quantities of fenugreek, nigella seeds, fennel seeds, cumin and mustard seeds), available from Asian supermarkets, also known as Bengali five-spice ",
    "1-2 mild dried red chillies",
    "1 small onion, chopped",
    "½ tsp ground turmeric",
    "2 level tsp ground cumin",
    "1 heaped tsp ground coriander",
    "2 tsp ginger paste (available from Asian supermarkets, or make your own by crushing or blending fresh ginger to a rough paste, adding water if necessary to loosen)",
    "500g/1lb 2oz butternut squash, peeled, seeds removed, flesh cut into 4cm/1½in cubes",
    "200ml/7fl oz boiling water",
    "200g/7oz canned chickpeas, drained and washed",
    "1 tsp ground garam masala",
    "1 tsp ground fennel seeds",
    "salt, to taste",
    "sugar, to taste"
  ],
  "method": [
    "Heat the oil in a large non-stick pan over a medium heat. Add the asafoetida, bay leaf, panch phoran and chillies and fry for 1-2 minutes, stirring well to combine.",
    "Add the onion, stir to coat in the spices, and fry for 2-3 minutes, or until softened and golden-brown. ",
    "Add the ground turmeric, cumin and coriander, the salt, sugar and ginger paste and stir well. Add a splash of water, stir and cook for a further 1-2 minutes.",
    "Add the butternut squash pieces and the boiling water. Bring the mixture to the boil, then reduce the heat to a simmer, cover the pan with a lid and simmer for 10-15 minutes, or until the butternut squash is tender.",
    "Add the chickpeas, ground garam masala and fennel seeds and another splash of water if necessary to keep the mixture loose. Add the salt and sugar, if using. Stir well and continue to cook for 1-2 minutes, or until warmed through. Serve immediately."
  ],
  "url": "www_bbc_com_food_recipes_bengalibutternutsqua_89988",
  "title": "Bengali butternut squash with chickpeas",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bengalibutternutsqua_89988_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Berry ice cream": {
  "ingredients": [
    "½ unwaxed lemon, finely grated zest and juice",
    "450g/1lb mixture of berries (e.g. strawberries, raspberries, blackcurrants, blackberries)",
    "397g tin condensed milk ",
    "600ml/1 pint whipping cream "
  ],
  "method": [
    "Put the lemon zest and juice in a large bowl, making sure you remove any pips. Add the berries and mash into a purée using a potato masher. Pour in the condensed milk.",
    "In a separate large bowl, pour in the cream and whisk using an electric hand whisk or balloon whisk, until soft peaks form and curl over a little when you lift the whisk out of the mixture. Make sure you don’t whisk past this point.",
    "Pour the fruit purée into the cream and carefully mix together using a big spoon, until the mixture is all the same colour.",
    "Spoon the mixture into a large tub and cover with a lid or cling film. Freeze for at least 4 hours, or overnight."
  ],
  "url": "www_bbc_com_food_recipes_berry_ice_cream_03943",
  "title": "Berry ice cream",
  "time": {
    "preparation": "over 2 hoursover 2 hours",
    "preparationMins": 120,
    "cooking": "no cooking requiredno cooking required",
    "cookingMins": 0,
    "totalMins": 120
  },
  "serves": "Makes 20 scoopsMakes 20 scoops",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/berry_ice_cream_03943_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Best-ever banoffee pie": {
  "ingredients": [
    "75g/2½oz butter",
    "300g/10½oz chocolate oaty biscuits",
    "115g/4oz butter",
    "115g/4oz soft dark brown sugar",
    "397g/14oz can sweetened condensed milk",
    "450ml/16fl oz double cream",
    "5 ripe but firm bananas",
    "1 tsp fresh lemon juice",
    "25g/1oz coarsely grated plain chocolate or chocolate curls"
  ],
  "method": [
    "To make the base, melt the butter in a small saucepan. Break the biscuits into chunky pieces and put in a food processor. Blend into crumbs, then add the melted butter and, with the motor running, blend well. Alternatively, put the biscuits in a strong polythene food bag and bash with a rolling pin. Tip into a bowl and stir in the melted butter.",
    "Tip the crumbs into the centre of a deep, 23cm/9in fluted loose-based tart tin or quiche dish and press firmly into the base and sides. Make sure it is evenly distributed, especially where the base meets the sides. Cover and chill in the fridge for 30 minutes, or until set.",
    "To make the filling, melt the butter in a medium saucepan, then stir in the sugar. Cook over a low heat, stirring constantly, until the butter and sugar look smooth and no oil floats to the surface. Add the condensed milk and bring to a gentle simmer, stirring constantly. Cook for 3 minutes, stirring, until the mixture turns a deep, creamy caramel brown. ",
    "Pour the toffee gently onto the biscuit base and quickly smooth the surface. Leave to chill for 1 hour (or up to 8 hours).",
    "Just before serving, lightly whip the cream in a bowl. It should stand in soft peaks, any thicker and it will look over-whipped when mixed with the bananas. Peel and diagonally slice four bananas and scatter half of them over the toffee. Fold the rest lightly into the cream and spoon gently on top. ",
    "Peel and slice the remaining banana and put it in a bowl. Pour the lemon juice over and gently toss (this will stop the banana turning brown). Decorate the top with the lemony banana, poking into the cream randomly, and sprinkle the pie with grated chocolate or decorate with chocolate curls. Serve in fairly thin slices as it is very rich."
  ],
  "url": "www_bbc_com_food_recipes_best-ever_banoffee_pie_75984",
  "title": "Best-ever banoffee pie",
  "time": {
    "preparation": "1-2 hours1-2 hours",
    "preparationMins": 120,
    "cooking": "less than 10 minsless than 10 mins",
    "cookingMins": 10,
    "totalMins": 130
  },
  "serves": "Serves 12Serves 12",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/best-ever_banoffee_pie_75984_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Sausage rolls": {
  "ingredients": [
    "30g/1oz butter",
    "100g/3½oz button mushrooms, finely chopped ",
    "1 tbsp Worcestershire sauce",
    "1 tbsp Tabasco sauce",
    "1 tbsp dried thyme",
    "450g/1lb sausage meat (you can easily push the meat out from the skins of readymade sausages)",
    "salt and freshly ground black pepper ",
    "450g/1lb ready-rolled puff pastry",
    "1 free-range egg, beaten"
  ],
  "method": [
    "Preheat the oven to 200C/400F/Gas 6.",
    "Melt the butter in a large frying pan and fry the mushrooms until soft. Transfer to a large bowl.",
    "Add the Worcestershire sauce, Tabasco sauce, thyme and sausage meat and season well with salt and freshly ground black pepper. Mix until thoroughly combined.",
    "Roll the puff pastry out into a large rectangle, then cut into two long rectangles.",
    "Place a layer of sausage meat mixture down the middle of each pastry rectangle, then brush each with beaten egg on one edge.",
    "Fold the other side of the pastry over onto the egg-washed edge. Press down to seal and trim any excess. Cut each pastry roll into 8-10 small sausage rolls.",
    "Place the sausage rolls onto a baking tray and transfer to the oven to bake for 15-20 minutes, or until crisp and golden and the sausage meat is completely cooked through."
  ],
  "url": "www_bbc_com_food_recipes_bigsausagerolls_86258",
  "title": "Sausage rolls",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Makes 16-20Makes 16-20",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bigsausagerolls_86258_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Black bean and avocado salad": {
  "ingredients": [
    "4 tbsp lime juice ",
    "7 tbsp extra virgin olive oil ",
    "3-4 jalapeño peppers (or 1 red chilli), finely chopped, to taste",
    "1 garlic clove, minced",
    "pinch ground cumin",
    "salt and freshly ground black pepper",
    "3 x 400g tins cooked black beans, drained",
    "large handful chopped fresh coriander",
    "4 medium tomatoes, chopped into wedges, seeds removed (or 16 cherry tomatoes, halved)",
    "1 large red pepper, stalk and seeds removed, sliced into thin strips",
    "1 red onion, thinly sliced",
    "5 spring onions, trimmed and thinly sliced (or 1 small red onion, thinly sliced)",
    "200g/7oz fresh watercress, tough stems snipped into half",
    "2 large ripe avocados, skin and seeds removed, cut into cubes"
  ],
  "method": [
    "Put all of the dressing ingredients in a jam jar, replace the lid and shake until well combined. Season with salt and pepper. Add more chilli if desired.",
    "For the salad, rinse the black beans under cold running water and drain. Put in a large mixing bowl and pour over half of the dressing.",
    "Add the remaining salad ingredients, apart from the watercress and avocado and stir well to combine.  ",
    "To serve, divide the watercress among 4 serving plates. Spoon the salad on top, then cover with the avocado cubes. Drizzle a little more dressing over each portion. "
  ],
  "url": "www_bbc_com_food_recipes_black_bean_and_avocado_32747",
  "title": "Black bean and avocado salad",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "no cooking requiredno cooking required",
    "cookingMins": 0,
    "totalMins": 30
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bean_and_avocado_32747_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Black bean and brown rice bowl with poached eggs": {
  "ingredients": [
    "110g/3½oz brown rice, rinsed",
    "1 tbsp olive oil",
    "400g tin black beans, drained and rinsed ",
    "2 tsp smoked paprika",
    "1 tsp white wine vinegar",
    "2 free-range eggs",
    "50g/2oz spinach ",
    "1 avocado, halved and sliced",
    "40g/1½oz feta, crumbled",
    "½ lemon, juice only",
    "sea salt and freshly ground black pepper"
  ],
  "method": [
    "Bring a saucepan of water to the boil, add the rice and simmer for 30-40 minutes, until tender. Drain and set aside. ",
    "Place a little olive oil in a small pan, add the black beans and warm through over a low to medium heat. Stir through the smoked paprika.",
    "Meanwhile, bring another pan of water to the boil, reduce to a simmer and add the white wine vinegar. Gently crack the eggs in one at a time, as close to the water as possible, and poach on a low simmer for 3 minutes. ",
    "While the eggs are cooking, add the spinach to the beans and wilt for 2 minutes then season with salt and pepper. ",
    "Place the cooked rice in a large bowl, add the spinach and black beans and mix to combine. Spoon the mixture into two serving bowls and top with the poached eggs, slices of avocado and crumbles of feta. Add lemon juice, salt and pepper to taste. "
  ],
  "url": "www_bbc_com_food_recipes_black_bean_and_smoke_29105",
  "title": "Black bean and brown rice bowl with poached eggs",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "30 mins to 1 hour30 mins to 1 hour",
    "cookingMins": 60,
    "totalMins": 90
  },
  "serves": "Serves 2Serves 2",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_bean_and_smoke_29105_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Black cherry and hazelnut jam": {
  "ingredients": [
    "400g/14oz fresh cherries",
    "200g/7oz (about 2) Bramley apples",
    "350g/12oz granulated or caster sugar",
    "1 small lemon, juice only",
    "50g/2oz chopped, roasted hazelnuts"
  ],
  "method": [
    "Put the cherries (either pitted, whole or halved) into a saucepan and cover with 500ml/18fl oz water. Bring to the boil, then cook until the cherries are very tender and the water almost evaporated.",
    "Peel and grate the Bramley apples, minus the core and pips, and add the grated apple to the pan. Boil again until the apple threads are very soft and falling apart and the liquid has almost disappeared.",
    "Add the sugar and lemon juice, bring to the boil and cook until the preserve reaches 105C/220C on a sugar thermometer. Stir in the hazelnuts towards the end of cooking.",
    "Leave to cool for a few minutes, then pour into hot clean jars and seal immediately.",
    "Leave the jam until the following day before eating, and after opening keep in the refrigerator."
  ],
  "url": "www_bbc_com_food_recipes_black_cherry_and_47093",
  "title": "Black cherry and hazelnut jam",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "30 mins to 1 hour30 mins to 1 hour",
    "cookingMins": 60,
    "totalMins": 90
  },
  "serves": "Makes about 600ml/20fl oz (about 2 jam jars)Makes about 600ml/20fl oz (about 2 jam jars)",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_cherry_and_47093_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Black pepper pork noodle salad": {
  "ingredients": [
    "50g/1¾oz rice vermicelli noodles",
    "1 tsp vegetable oil",
    "100g/3½oz pork mince ",
    "½ tsp freshly ground black pepper",
    "2 tsp soy sauce",
    "2 spring onions, chopped",
    "½ red pepper, thinly sliced"
  ],
  "method": [
    "Boil the kettle. Put the noodles in a pan and pour over boiling water to cover. Allow to soak for 8 minutes until softened.",
    "Heat a wok or frying pan until very hot. Add the oil, then the pork mince with lots of freshly ground black pepper. Break up the mince with a wooden spoon, giving it time to brown before stirring.",
    "When browned all over, add the white parts of the spring onion and half of the green. Stir-fry for 1 minute. Add the soy sauce - it will bubble up quickly and thicken. Immediately transfer the pork mince to a serving bowl.",
    "Drain the noodles and stir into the meat along with the red pepper and remaining spring onion. This can be served warm, at room temperature or cold. "
  ],
  "url": "www_bbc_com_food_recipes_black_pepper_pork_noodle_13499",
  "title": "Black pepper pork noodle salad",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 1Serves 1",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_pepper_pork_noodle_13499_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Black pepper-crusted mackerel with a celery salad": {
  "ingredients": [
    "4 fillets fresh mackerel, pin-boned",
    "2 tsp Dijon mustard",
    "3 tbsp cracked black pepper",
    "½ head celery with leaves, sliced",
    "110g/4oz walnut halves",
    "2 green apples, cored and cut into wedges",
    "2 red apples, cored and cut into wedges",
    "1 tbsp Dijon mustard",
    "1 lemon, juice only",
    "3 tbsp olive oil"
  ],
  "method": [
    "For the black pepper-crusted mackerel, heat the grill to hot. Brush the mackerel fillets with the mustard and roll the fillets in the black pepper.",
    "Place on a baking tray and put under the grill for 3-4 minutes.",
    "For the celery salad, put all the ingredients in a large bowl and mix together.",
    "For the dressing, put all the dressing ingredients in a small bowl and whisk.",
    "Just before serving pour the dressing over the salad",
    "To serve, place the mackerel fillets on each of four plates with the salad alongside."
  ],
  "url": "www_bbc_com_food_recipes_black_pepper-crusted_61117",
  "title": "Black pepper-crusted mackerel with a celery salad",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "less than 10 minsless than 10 mins",
    "cookingMins": 10,
    "totalMins": 40
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/black_pepper-crusted_61117_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Black bean steamed scallops with noodles": {
  "ingredients": [
    "75g/3oz dried vermicelli noodles",
    "8 scallops, removed from the shells, de-bearded and coral removed, shells cleaned and reserved ",
    "6 cloves garlic, finely chopped",
    "2.5cm/1in piece fresh root ginger, peeled, finely chopped",
    "1 red chilli, de-seeded, finely chopped",
    "1 tbsp fermented salted black beans, washed and crushed into a paste (available from Asian grocers)",
    "1 tbsp Shaoxing rice wine or dry sherry",
    "2 tbsp light soy sauce ",
    "3 tbsp water",
    "2 tbsp finely chopped fresh chives or spring onions"
  ],
  "method": [
    "For the scallops with noodles, soak the dried vermicelli in a bowl of just-boiled water for 5-6 minutes, or until tender. Drain well, then chop into 10cm/4in lengths and set aside. ",
    "Place the cleaned scallops back into their shells. ",
    "For the black bean sauce, mix all of the sauce ingredients together in a bowl. Spoon a teaspoon of the sauce on top of each scallop and gently rub into the scallop flesh.",
    "Wrap some of the soft vermicelli noodles around each scallop, then spoon one teaspoon of water around the noodles. (This helps to keep the noodles moist and works to create a sauce when combined with the steamed juices of the scallops.)",
    "Divide the scallop shells between two heatproof serving plates and place each plate into a bamboo steamer, placing one steamer on top of the other. Place the steamers over a pan or wok of boiling water (making sure the water does not touch the base of the steamer), cover, and steam over a high heat for 4-5 minutes, or until the scallops are cooked through. If you do not have a bamboo steamer, place the shells onto a large heatproof plate set on a rack in a roasting tray. Fill the roasting tray with boiling water from the kettle. Pre-heat the oven to 180C/350F/Gas 4, cover the whole roasting tray with foil and place into the oven to steam for 4-5 minutes. ",
    "To serve, serve the scallops in the bamboo steamers, or remove the plates from the steamer and serve on the plates. Sprinkle over the chopped chives or spring onions and serve immediately."
  ],
  "url": "www_bbc_com_food_recipes_blackbeansteamedscal_89273",
  "title": "Black bean steamed scallops with noodles",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 2Serves 2",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackbeansteamedscal_89273_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Blackberry and apple crumble smoothie": {
  "ingredients": [
    "300g/10½oz frozen mixed berries ",
    "1 apple, cored and sliced",
    "200ml/7floz semi-skimmed milk",
    "150g/5½oz fat-free natural yoghurt",
    "25g/1oz porridge oats, with extra fibre",
    "10g/¼oz flaked almonds"
  ],
  "method": [
    "Place the berries, apple, milk, yoghurt, oats and nuts in a blender and blend until smooth. ",
    "Add 75-100ml/2½-3½floz cold water, a little at a time, to achieve a smooth consistency and blend again. ",
    "Pour into glasses and serve. "
  ],
  "url": "www_bbc_com_food_recipes_blackberry_and_apple_39192",
  "title": "Blackberry and apple crumble smoothie",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "no cooking requiredno cooking required",
    "cookingMins": 0,
    "totalMins": 30
  },
  "serves": "Serves 2Serves 2",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/blackberry_and_apple_39192_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Bombay potatoes": {
  "ingredients": [
    "4 tbsp oil",
    "¼ tsp mustard seeds",
    "2 pinches of chilli powder",
    "¼ tsp turmeric powder",
    "350g/12oz potatoes, boiled and quartered",
    "salt to taste"
  ],
  "method": [
    "Heat the oil in a pan on a medium heat setting. ",
    "To check that the oil is hot enough, sprinkle in a few mustard seeds, if they pop the oil is ready. Then add the remainder of the mustard seeds. ",
    "Add the chilli and turmeric powders to the sizzling seeds, and salt to taste. ",
    "Fry this pungent mixture of oil and spices for 1 minute then add the potatoes. Fry for about 4 minutes until the potatoes are smothered in seeds and appear to have crispy edges. They will look quite yellow in colour. Cover the pan and on a low heat, cook the potatoes for a further 5 minutes. ",
    "Serve immediately."
  ],
  "url": "www_bbc_com_food_recipes_bombaypotatoes_1406",
  "title": "Bombay potatoes",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bombaypotatoes_1406_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Bonfire toffee": {
  "ingredients": [
    "75g/3oz golden syrup",
    "75g/3oz black treacle",
    "150g/6oz light soft brown sugar",
    "75g/3oz butter",
    "¼ tsp cream of tartar"
  ],
  "method": [
    "Line a 15 x 20cm/6 x 8in baking tray with non-stick baking parchment.",
    "Measure all the ingredients into a deep, heavy-based saucepan. Place over a medium heat and stir occasionally until the butter is melted and the sugar has dissolved.",
    "When the mixture is smooth and well-combined, increase the heat and bring the mixture to a fast boil.  When the mixture reaches 140C/285F, pour carefully into the lined tray. ",
    "If you want even pieces, wait until the toffee is cool enough to handle, but elastic enough so that a finger pressed in the top leaves a slight indent (about 15-20 minutes depending on the room temperature). Partially cut the toffee into even pieces with an oiled knife. When it has cooled completely, break along these lines. Alternatively let the toffee cool completely, then break into shards with a toffee hammer or rolling pin.",
    "Store in an airtight container, with individual layers of toffee separated by baking parchment. If left exposed to humidity, the toffee will soften and stick together."
  ],
  "url": "www_bbc_com_food_recipes_bonfire_toffee_21396",
  "title": "Bonfire toffee",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "less than 10 minsless than 10 mins",
    "cookingMins": 10,
    "totalMins": 40
  },
  "serves": "Serves 8-10Serves 8-10",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/bonfire_toffee_21396_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Braised beef in red wine": {
  "ingredients": [
    "1kg/2lb 4oz topside of beef",
    "1 garlic clove",
    "2 bay leaves",
    "2 sprigs rosemary",
    "8 black peppercorns",
    "1 large onion, finely chopped",
    "3 carrots, finely chopped",
    "2 celery stalks, finely chopped",
    "1 bottle red wine",
    "90ml/6 tbsp extra virgin olive oil",
    "salt, to taste"
  ],
  "method": [
    "Pat the meat all over gently with kitchen paper to dry. Place in a large bowl together with all the other ingredients except for the oil and salt. Cover with clingfilm and marinate in the fridge overnight, or for at least 12 hours. ",
    "Remove the meat from the marinade, keeping the marinade for later. Pat the meat dry with kitchen paper. Heat the oil in a large saucepan, add the meat and seal well all over. Remove and set aside. ",
    "In the same saucepan, add the vegetables and herbs from the marinade and sweat for a couple of minutes. Return the meat to the pan, add some salt and cook on a medium heat for 10 minutes. ",
    "Add the wine from the marinade, bring to the boil then reduce the heat to low and cover with a lid. Cook for about two hours, until the meat is tender and the liquid has reduced, checking from time to time and gently turning over during cooking. Once the meat is cooked to your liking, remove it from the pan and keep it warm. If the sauce needs thickening continue to simmer until it has reduced to sauce consistency.",
    "To serve, slice the meat and place on a serving dish together with the vegetables and sauce. "
  ],
  "url": "www_bbc_com_food_recipes_braised_beef_in_red_wine_79613",
  "title": "Braised beef in red wine",
  "time": {
    "preparation": "overnightovernight",
    "preparationMins": 720,
    "cooking": "over 2 hoursover 2 hours",
    "cookingMins": 120,
    "totalMins": 840
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/braised_beef_in_red_wine_79613_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Brandy snaps": {
  "ingredients": [
    "55g/2oz butter",
    "55g/2oz demerara sugar",
    "55g/2oz golden syrup",
    "50g/1¾oz plain flour",
    "½ level tsp ground ginger",
    "½ tsp lemon juice"
  ],
  "method": [
    "Preheat the oven to 180C/350F/Gas 4. Line two baking trays with baking parchment then oil a thickish handle of a wooden spoon and lay it on a cooling rack. ",
    "Measure the butter, sugar and syrup into a small, heavy-based pan. The easiest way is to measure the butter, then the sugar on the scales (in the pan if you have digital scales), then measure the syrup on top to make up to 165g/6oz total weight. ",
    "Heat gently until the butter has melted and the sugar has dissolved. This will take about 15 minutes over a low heat. Don’t let the mixture boil as it may crystallise. To check when the sugar has dissolved, stir occasionally, pulling the spoon across the bottom of the pan until you can no longer hear the gritty granules being scraped along and most of them have disappeared. ",
    "Leave the mixture to cool slightly, about 2-3 minutes, then sieve in the flour and ginger. Pour in the lemon juice and stir well to mix thoroughly. Drop four teaspoonfuls of the mixture onto each of the prepared baking trays to make neat circles, about 10cm/4in apart. ",
    "Bake in the pre-heated oven for about 10-15 minutes, or until the mixture is well spread out, looks lacey and is a dark golden colour. Once baked, you need to work fast to shape the brandy snaps, so its easier if you bake one tray at a time. Remove each tray from the oven and leave for a minute or so to firm up slightly, then lift from the baking parchment using a fish slice. The mixture needs to be just firm enough to remove, but pliable enough to shape. Check by releasing around and under the edges with a small palette knife. ",
    "Quickly roll a circle of the warm mixture around the handle of the wooden spoon, having the join underneath. Press the join lightly together to seal, then slide the brandy snap off the spoon and leave it to firm up on the wire rack, again with the join underneath. If any of the circles on the sheet harden too much to work with, put them back in the oven for a few seconds to soften again. Repeat until all the mixture has been used. If the mixture in the pan becomes too firm to drop in neat spoonfuls, roll a teaspoonful of it into a small smooth ball in your hands, sit it on the baking tray and flatten slightly with your fingers. When cold, store the brandy snaps in an airtight tin or container; they will keep for at least a week.   "
  ],
  "url": "www_bbc_com_food_recipes_brandy_snaps_47363",
  "title": "Brandy snaps",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "30 mins to 1 hour30 mins to 1 hour",
    "cookingMins": 60,
    "totalMins": 90
  },
  "serves": "Makes 16 brandy snapsMakes 16 brandy snaps",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brandy_snaps_47363_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Breakfast bars 2.0": {
  "ingredients": [
    "250g/9oz medjool dates",
    "2 tsp ground cinnamon",
    "75g/2½oz goji berries",
    "75g/2½oz pumpkin seeds",
    "150g/5½oz brown flaxseeds",
    "50g/1¾oz cocoa nibs",
    "25g/1oz chia seeds",
    "25g/1oz cornflakes (gluten-free if required)",
    "100g/3½oz organic porridge oats (not instant), gluten-free if required)"
  ],
  "method": [
    "Preheat the oven to 180C/160C Fan/Gas 4, and line the bottom and sides of a 20cm/8in square tin with baking parchment. ",
    "Pit the dates and tear them with your fingers into a small saucepan, add the cinnamon, cover with 325ml/11fl oz cold water, bring to the boil and let bubble for 5 minutes. Turn off the heat, and beat with a fork until you have a rough purée.",
    "Put all the remaining ingredients into a large bowl, add the date mixture and mix until everything is combined. I wear a pair of disposable vinyl gloves for this.",
    "Squodge into your prepared tin and bake in the oven for 30 minutes, until firm and set, and golden on top and darker around the edges. Leave to cool in the tin before cutting into pieces."
  ],
  "url": "www_bbc_com_food_recipes_breakfast_bars_20_09760",
  "title": "Breakfast bars 2.0",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Makes 16 barsMakes 16 bars",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breakfast_bars_20_09760_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Breast of lamb baked with onions": {
  "ingredients": [
    "1.6 kg/3lb 8oz lamb breast, boned, rolled and tied with kitchen string",
    "fine salt and freshly ground white pepper ",
    "2 tbsp dripping or vegetable oil ",
    "1.6 kg/3lb 8oz onions, thinly sliced ",
    "1 bay leaf",
    "1 tbsp red wine vinegar  ",
    "2-3 tbsp anchovy essence (or several finely chopped anchovies), or to taste ",
    "2 tbsp chopped fresh parsley "
  ],
  "method": [
    "Preheat the oven to 150C/300F/Gas 2.",
    "Season the lamb with salt and freshly ground white pepper. Melt the dripping or oil in a large, lidded roomy casserole dish until hot. Place the lamb breast into the casserole dish, turn down the heat and colour well on all sides, until golden-brown. Lift out the meat and remove all fat from the dish with a spoon. ",
    "Add half of the onions to make a bed of onions on which to rest the lamb and add the lamb back into to the dish. Tuck in the bay leaf and cover with the remaining onions. ",
    "Cut a circle of greaseproof paper slightly bigger than the diameter of the dish. Dampen it, lightly grease one side, and press it onto the onions (greased side down).  Put on the lid cook in the oven for about three hours. After an hour, remove the dish to see whether the onion mixture has reduced and to check that the natural juices are running. Scrape down the side of the dish if the onions have stuck. Replace the paper and lid and place the dish into the oven again.",
    "After about three hours of cooking (check after another hour), push a skewer into the lamb to see how tender it is; there should be little resistance. Lift out the meat, put it into a small roasting tin and cover with foil. Turn down the oven to 140C/275F/Gas 1, and return the meat to the oven while you finish the onions.",
    "Remove the bay leaf from the onions and drain the onions, reserving the cooking juices. Put the onions back into the casserole. Remove any fat that has settled on the surface of the cooking juices. Pour the liquid back in with the onions, and simmer until the volume of liquid has reduced by half. Stir in the vinegar and anchovy essence.",
    "Season the onions to taste with salt and freshly ground black pepper. Finally, stir in the parsley. ",
    "Remove the lamb from the oven (if any meaty juices have exuded from the resting lamb, add them to the onions), cut off the strings and thickly slice the meat. Arrange the slices onto a hot serving dish and pile the onions alongside."
  ],
  "url": "www_bbc_com_food_recipes_breast_of_lamb_baked_80591",
  "title": "Breast of lamb baked with onions",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "over 2 hoursover 2 hours",
    "cookingMins": 120,
    "totalMins": 150
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/breast_of_lamb_baked_80591_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Brie, bacon and cranberry filo bites": {
  "ingredients": [
    "2 x sheets of filo pastry (48x25cm/19x10in) ",
    "55g/2oz unsalted butter, melted",
    "150g/5½oz brie",
    "1–2 tsp wholegrain mustard (optional)",
    "100g/3½oz cranberry sauce",
    "75g/2¾oz smoked back bacon rashers, cut into 1cm/½in strips",
    "freshly ground black pepper"
  ],
  "method": [
    "Preheat the oven to 190C/170C Fan/Gas 5.",
    "Take one sheet of the filo pastry and cover the rest of the pastry with a damp tea towel to stop it drying out. Cut the pastry in half so it is easier to work with. Take one half of the pastry and brush it with a little of the melted butter. Cut this half into 20 rough 5cm/2in squares. Take three of the squares and place them on top of each other, placing each at a slight angle to the one underneath (forming a star shape).",
    "Push the stack of pastry squares into one of the holes of a mini muffin tin, to make an empty pastry case. Repeat with the remaining pastry until all 24 holes are filled.",
    "Cut the brie into 24 small pieces and place one piece into each pastry case. Dot with a tiny amount of mustard, if using, add a little cranberry sauce and top with a few strips of bacon. ",
    "Bake for 10–12 minutes, or until the bacon is cooked, the cheese melted and the pastry golden-brown. Leave to cool in the tin for a couple of minutes before removing carefully and serving. "
  ],
  "url": "www_bbc_com_food_recipes_brie_bacon_and_cranberry_66096",
  "title": "Brie, bacon and cranberry filo bites",
  "time": {
    "preparation": "30 mins to 1 hour30 mins to 1 hour",
    "preparationMins": 60,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 90
  },
  "serves": "Makes 24 canapesMakes 24 canapes",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brie_bacon_and_cranberry_66096_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"British beef Raj curry": {
  "ingredients": [
    "25g/1oz butter",
    "750g/1lb 10oz chuck steak, cut into 4cm/1½in cubes",
    "2 medium onions, sliced",
    "3 garlic cloves, crushed",
    "1 tsp Kashmiri chilli powder",
    "1 tsp ground turmeric",
    "1½ tbsp garam masala",
    "1½ tsp salt",
    "600ml/20fl oz beef stock",
    "50g/1¾oz desiccated coconut",
    "100g/3½oz sultanas",
    "choose from: Bombay duck (or any dried, salted fish such as dried anchovies, available from Asian shops), apple chutney, tamarind chutney, sliced bananas, grated coconut and/or poppadoms"
  ],
  "method": [
    "Melt the butter in a large, sturdy pan over a medium heat. Add the steak, in batches, and fry for a few minutes until browned and then remove to a plate. Add the onions to the same pan and fry for 10 minutes, or until softened and golden-brown. ",
    "Add the garlic and fry for one minute, then return the meat to the pan, along with any juices on the plate. Stir in the chilli powder, turmeric, one tablespoon of the garam masala, and the salt, and cook for one minute.",
    "Add the stock, followed by the coconut and sultanas. Bring to a simmer, cover and cook over a low heat for 45 minutes to an hour or until the beef is tender. Stir in the remaining garam masala and serve."
  ],
  "url": "www_bbc_com_food_recipes_british_beef_raj_curry_70957",
  "title": "British beef Raj curry",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "1 to 2 hours1 to 2 hours",
    "cookingMins": 120,
    "totalMins": 150
  },
  "serves": "Serves 4-6Serves 4-6",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/british_beef_raj_curry_70957_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Broad bean and goats’ cheese bruschetta": {
  "ingredients": [
    "400g/14oz fresh broad beans, (about 300g/10½oz when podded)",
    "1 whole red chilli",
    "2 fat garlic cloves, finely chopped",
    "1 spring onion, thinly sliced",
    "1 lemon, zest and juice only \t",
    "1 tbsp dried oregano or 2 tbsp fresh chopped oregano",
    "½ loaf sourdough bread, sliced",
    "4 tbsp olive oil",
    "200g/7oz soft goats’ cheese"
  ],
  "method": [
    "Heat a large saucepan filled with boiling water. Blanch the beans very briefly (just to soften, not to cook them through).  Drain and set aside to cool.",
    "Roast the chilli over a direct flame on the hob until blackened a little, but not completely charred. Alternatively, char them under a hot grill. Slice open and remove the seeds. Cut the flesh into thin ribbons. ",
    "Mix the chilli, garlic, spring onion, lemon zest and juice together. Add the oregano and broad beans and lightly crush them as you mix. You don’t want a smooth purée, but it needs to hold together.",
    "Heat a large griddle pan and drizzle the sliced sourdough with a little olive oil. Place on the griddle and cook on both sides for 1-2 minutes, or until the bar marks appear.",
    "Remove from the heat and spread with the goats’ cheese. Top with the broad bean mixture and serve."
  ],
  "url": "www_bbc_com_food_recipes_broad_bean_and_goats_69027",
  "title": "Broad bean and goats’ cheese bruschetta",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "less than 10 minsless than 10 mins",
    "cookingMins": 10,
    "totalMins": 40
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broad_bean_and_goats_69027_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Broccoli and salmon bake": {
  "ingredients": [
    "1 onion, chopped",
    "1 tsp olive oil",
    "20g/¾oz butter",
    "20g/¾oz plain flour",
    "150ml/5fl oz milk",
    "50g/1¾oz parmesan, grated",
    "150g/5¼oz salmon steak",
    "150g/5¼oz broccoli, cut into florets and steamed",
    "2 carrots, cut into batons and steamed",
    "6 cherry tomatoes"
  ],
  "method": [
    "Preheat the oven to 220C/425F/Gas 7.",
    "Gently fry the onions in the oil in a saucepan and cook until soft. Stir in the butter and the flour. Mix thoroughly, cooking on a low heat for one minute.",
    "Pour in the milk, gradually, until everything is combined. Cook for two minutes.",
    "Add half the cheese to the sauce and reserve the other half.",
    "Meanwhile, pan-fry the salmon steak for one minute on each side.",
    "Lay the salmon steak in a small oven-proof dish.",
    "Add the broccoli, carrots and cherry tomatoes to the dish.",
    "Pour over the sauce and top with the rest of the cheese.",
    "Bake in the oven for ten minutes or until bubbling and golden."
  ],
  "url": "www_bbc_com_food_recipes_broccoliandsalmonbak_77132",
  "title": "Broccoli and salmon bake",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 1Serves 1",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoliandsalmonbak_77132_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Broccoli and Stilton soup": {
  "ingredients": [
    "350g/12oz broccoli, florets and stalks cut into small pieces",
    "400ml/14fl oz vegetable stock",
    "25g/1oz butter",
    "4 spring onions, finely sliced",
    "50g/1¾oz Stilton, crumbled, or to taste",
    "100ml/3½fl oz double cream",
    "salt and freshly ground black pepper",
    "pinch freshly grated nutmeg",
    "4 slices French bread",
    "100g/3½oz Stilton, sliced"
  ],
  "method": [
    "For the soup, place the pieces of broccoli into a glass bowl. Pour over the vegetable stock.",
    "Cover the bowl with cling film and place in the microwave. Cook on full power for four minutes, or until tender.",
    "Meanwhile, heat a frying pan until hot then add the butter. When it starts to foam, add the spring onions and cook for one minute.",
    "Transfer the cooked broccoli and stock to a food processor. Add the fried spring onions, Stilton and cream and blend until smooth.",
    "Transfer the blended mixture to a pan and bring gently to a simmer.",
    "Meanwhile, for the croûtons, toast the French bread under a grill until golden-brown on each side.",
    "Top the grilled bread with the slices of Stilton and return to the grill until golden-brown and bubbling.",
    "Season the soup with salt, freshly ground black pepper and a pinch of nutmeg.",
    "Divide the soup equally among four warm bowls and top each with a Stilton croûton. Serve."
  ],
  "url": "www_bbc_com_food_recipes_broccoliandstiltonso_76390",
  "title": "Broccoli and Stilton soup",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "less than 10 minsless than 10 mins",
    "cookingMins": 10,
    "totalMins": 40
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/broccoliandstiltonso_76390_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Brussels sprouts with pancetta": {
  "ingredients": [
    "salt",
    "900g/2lb 4oz Brussels sprouts, trimmed and loose leaves removed",
    "2 tsp olive oil",
    "225g/8oz pancetta, cut into cubes"
  ],
  "method": [
    "Bring a saucepan of salted water to the boil and add the sprouts. Cook for 8-10 minutes, or until tender, then drain in a colander.",
    "Heat a frying pan over a high heat until hot. Add the olive oil and pancetta cubes and fry for 5-7 minutes, or until the pancetta is crisp and golden-brown.",
    "Add the drained sprouts and stir together to warm through. Serve immediately."
  ],
  "url": "www_bbc_com_food_recipes_brussels_sprouts_with_12803",
  "title": "Brussels sprouts with pancetta",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 8Serves 8",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/brussels_sprouts_with_12803_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Buttermilk scones": {
  "ingredients": [
    "500g/1lb 2oz plain flour, plus extra for dusting",
    "2 tsp bicarbonate of soda",
    "2 tsp cream of tartar",
    "2 tsp caster sugar",
    "50g/2oz unsalted butter",
    "25g/1oz soft vegetable shortening",
    "300ml/10½fl oz buttermilk",
    "1 free-range egg, beaten, for an egg-wash (optional)"
  ],
  "method": [
    "Preheat the oven to 220C/450/Gas 7. Line a large baking sheet with baking parchment. ",
    "Put the flour into a bowl with the bicarbonate of soda, cream of tartar and sugar.",
    "Chop the butter and the vegetable shortening into pieces and drop them into the flour.",
    "Rub the fats into the flour using your fingertips – or just mix any old how – and then pour in the buttermilk, working everything together to form a dough.",
    "Lightly flour your work surface. Pat the dough down into a round-edged oblong about 4cm/1½in thick, then cut out 6cm/2¼in scones with a fluted cutter. ",
    "Arrange the scones fairly close together on your lined baking sheet, and brush with beaten egg (to give golden tops), if you wish. Cook for 12 minutes, by which time the scones will be dry on the bottom and have a relatively light feel. Remove them to a wire rack to cool, and serve with clotted cream and jam."
  ],
  "url": "www_bbc_com_food_recipes_buttermilk_scones_99091",
  "title": "Buttermilk scones",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Makes 18Makes 18",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/buttermilk_scones_99091_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Veggie lasagne": {
  "ingredients": [
    "50g/2oz parmesan (or a vegetarian alternative)",
    "50g/2oz dried natural breadcrumbs",
    "600g/1lb 5oz prepared sweet potato and butternut squash",
    "pinch salt",
    "4 sprigs rosemary",
    "12 sage leaves",
    "drizzle olive oil",
    "12 lasagne sheets",
    "75g/3oz baby spinach leaves",
    "100g/3½oz toasted pine nuts (some supermarkets sell them toasted)",
    "100g/3½oz parmesan (or a vegetarian alternative)",
    "2cm/¾in piece of fresh ginger ",
    "600g/1lb 5oz ricotta",
    "2 free-range eggs, yolks only",
    "pinch freshly grated nutmeg",
    "salt and freshly ground black pepper",
    "3 tbsp extra virgin olive oil",
    "1 tbsp balsamic vinegar",
    "pinch English mustard powder (optional)",
    "salt and freshly ground black pepper",
    "80g/2oz wild rocket"
  ],
  "method": [
    "Preheat the oven to 220C/200C Fan/Gas 7.",
    "Put the kettle on to boil for the vegetables. ",
    "Meanwhile, finely grate the parmesan for the topping, toss in a small bowl with the breadcrumbs and set aside.",
    "When the kettle has boiled, tip the prepared sweet potato and butternut squash into a large pan, add a little salt and then pour the boiled water over to cover. Put the lid on, bring back to the boil and then leave to bubble away for 15-20 minutes until tender.",
    "Fill the kettle up with water again and pop it back on to boil while you quickly prepare the herbs for later. Run your fingers down the length of the rosemary stalks to release the leaves and roughly chop them with the sage leaves and set aside in a small bowl.",
    "Pour the boiled water into a large pan, add a drizzle of oil, slip in the lasagne sheets and leave to cook for five minutes. (As there is not loads of liquid in this dish the lasagne sheets do need a bit of precooking).",
    "In the meantime, prepare the sauce. Finely grate the parmesan and peel and grate the ginger. Place both into a medium bowl, add the ricotta, egg yolks, pinch of nutmeg, salt and pepper, stir to combine and set aside.",
    "Drain the lasagne sheets once they’ve had their time and tip them back into the pan. Drizzle in a little more oil and gently toss them about to coat, so that the sheets don’t stick together.",
    "Check that the vegetables are now nice and tender. Drain well and tip them back into the pan. Mash them with a masher until smooth and add salt and pepper to taste.",
    "Now assemble the lasagne in a baking dish, set on a baking tray. Spread a third of the vegetable mash in the base of the dish. Next, scatter a third of the herbs, pine nuts and spinach leaves over. Then arrange four lasagne sheets on top, cutting to fit if necessary. Spread a third of the white sauce over. ",
    "Repeat this two more times giving you three layers and finally sprinkle the parmesan breadcrumbs on top. Bake for 15-20 minutes. ",
    "Prepare the salad dressing by simply mixing the olive oil, balsamic vinegar, mustard powder (if using) and seasoning together in a small bowl.",
    "When the lasagne is ready, the pasta will feel tender when pierced through with a knife and the top will be crisp and golden-brown.",
    "Cut it into portions, carefully lift out and serve with a handful of rocket drizzled with the dressing."
  ],
  "url": "www_bbc_com_food_recipes_butternut_and_sweet_49981",
  "title": "Veggie lasagne",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "30 mins to 1 hour30 mins to 1 hour",
    "cookingMins": 60,
    "totalMins": 90
  },
  "serves": "Serves 6Serves 6",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_and_sweet_49981_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Slow cooker vegetarian hotpot": {
  "ingredients": [
    "2 tbsp sunflower oil",
    "1 small butternut squash (approximately 800g/1lb 12oz), scrubbed, deseeded, chopped into chunks",
    "2 onions, thinly sliced",
    "3 carrots, peeled, cut into chunks",
    "2 parsnips, peeled, cut into chunks",
    "2 tbsp plain flour",
    "400g tin chopped tomatoes",
    "2 tbsp tomato purée",
    "½ tsp dried chilli flakes (optional)",
    "3 tbsp pesto (optional)",
    "350ml/12fl oz hot vegetable stock (made with 1 stock cube)",
    "100g/3½oz young spinach leaves (optional)",
    "salt and freshly ground black pepper",
    "200g/7oz self-raising flour",
    "75g/2¾oz frozen butter (or 75g2¾oz shredded vegetarian suet)",
    "125ml/4½fl oz cold water",
    "salt and freshly ground black pepper"
  ],
  "method": [
    "Heat the oil in a large, non-stick frying pan over a medium heat. Add the vegetables, in batches if necessary, and fry for 4-5 minutes, stirring regularly, until lightly browned all over. Season with salt and pepper. ",
    "Transfer the vegetables to the slow-cooker, sprinkle over the flour and stir well. Add the chopped tomatoes, tomato purée, chilli flakes and pesto and stir again. Pour over the stock and stir. Cover and cook on high for 4 hours.",
    "After the hotpot has been cooking for 3½ hours, make the dumplings. Put the flour in a large mixing bowl and season with salt and pepper.",
    "Coarsely grate one-quarter of the frozen butter into the flour. Toss the mixture to coat the butter lightly in the flour. Add the remaining butter in three more batches, grating and tossing it in the same way. This should prevent the dumpling dough from clumping and yield light, fluffy dumplings.",
    "Stir in enough cold water to bring the mixture together as a soft, squidy dough. Divide into 12 equally sized pieces and roll each into a ball. ",
    "Remove the lid from the slow-cooker, stir in the spinach until wilted, then arrange the dumplings gently on top. Replace the lid and continue to cook on high for a further 25-30 minutes, or until the dumplings are puffed-up and fluffy. ",
    "Spoon the hotpot onto serving plates with the dumplings on top."
  ],
  "url": "www_bbc_com_food_recipes_butternut_squash_and_46813",
  "title": "Slow cooker vegetarian hotpot",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "over 2 hoursover 2 hours",
    "cookingMins": 120,
    "totalMins": 150
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_squash_and_46813_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Butternut squash curry with cauliflower 'rice'": {
  "ingredients": [
    "100g/3½oz cauliflower florets ",
    "1 tsp olive oil",
    "salt and freshly ground black pepper",
    "1 tsp rapeseed oil",
    "1 small onion (75g/2½oz peeled weight), chopped ",
    "250g/9oz butternut squash, cut into cubes   ",
    "1 garlic clove, finely chopped ",
    "1 tbsp curry paste (see tip)",
    "200g/7oz tinned chopped tomatoes ",
    "150ml/5fl oz vegetable stock",
    "40g/1½oz baby spinach, washed"
  ],
  "method": [
    "To make the cauliflower ‘rice’, preheat the oven to 200C/180C Fan/Gas 6. Pulse the cauliflower in a food processor for 30 seconds, or until finely chopped (it should have the same texture as couscous). Mix in the olive oil and season to taste. Scatter the mixture onto a baking tray and bake for 15 minutes.  ",
    "To make the curry, heat the rapeseed oil in a small, deep saucepan. Add the onion and cook gently for 2–3 minutes. Add the butternut squash, garlic and curry paste and cook for 2–3 minutes.  ",
    "Add the tomatoes and stock, bring to the boil, then reduce the heat. Cover and simmer for 15 minutes, stirring occasionally. Remove the lid and simmer for a further 10 minutes.",
    "Stir in the baby spinach, then cover and cook until wilted. Season to taste with salt and pepper. Serve the curry with the 'rice'."
  ],
  "url": "www_bbc_com_food_recipes_butternut_squash_and_50241",
  "title": "Butternut squash curry with cauliflower 'rice'",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 1Serves 1",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/butternut_squash_and_50241_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Cabbage curry": {
  "ingredients": [
    "2 tbsp coconut oil or vegetable oil",
    "1 tsp cumin seeds",
    "1 tsp turmeric",
    "handful of fresh curry leaves",
    "½ green chilli, finely sliced",
    "1 red onion, sliced",
    "2 garlic cloves, peeled and kept whole",
    "1 small savoy cabbage, finely shredded (remove the thick stems)",
    "small handful desiccated coconut (approximately 25g/1oz)",
    "salt, to taste"
  ],
  "method": [
    "Heat the oil in a wide, heavy-based pan. Once hot, add the cumin seeds and turmeric and cook for 1–2 minutes before adding the curry leaves, green chilli and red onion. Gently fry over a medium–high heat for a few minutes to soften then add the whole garlic cloves. ",
    "Continue to cook on a low heat and, once the onion has softened, remove the garlic cloves. Add the shredded cabbage, a generous pinch of salt and a splash of water. Toss everything together in the pan and gently fry the cabbage for around 5 minutes until cooked.",
    "Add the desiccated coconut and cook whilst stirring for a further 2–3 minutes or until the mixture is dry. Serve."
  ],
  "url": "www_bbc_com_food_recipes_cabbage_mallang_55625",
  "title": "Cabbage curry",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 6Serves 6",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cabbage_mallang_55625_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Caesar salad": {
  "ingredients": [
    "1 large free-range egg",
    "1 large garlic clove, peeled and crushed",
    "1 tbsp lime juice",
    "2 tsp Worcestershire sauce",
    "4-5 anchovy fillets, chopped",
    "3 tbsp olive oil, plus a little extra for frying",
    "freshly ground black pepper",
    "2 thick slices of white bread, crusts removed, cubed",
    "1 cos lettuce, washed, dried, and torn into pieces",
    "25g/1oz parmesan cheese, coarsely grated"
  ],
  "method": [
    "Place the egg in a pan of cold water and bring to the boil. Boil for one minute and then plunge into cold water to stop the cooking process.",
    "Once the egg is cool enough to handle, crack the egg into a food processor and add the garlic, lime juice, Worcestershire sauce, anchovies and oil. Process well and add pepper to taste.",
    "Heat a little olive oil in a frying pan, then fry the bread cubes until crisp and golden-brown, then drain on kitchen paper.",
    "Place the cos lettuce into a large bowl.",
    "To serve, pour the dressing over the leaves and add the fried bread cubes and parmesan. Toss well and serve at once."
  ],
  "url": "www_bbc_com_food_recipes_caesarsalad_72154",
  "title": "Caesar salad",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "less than 10 minsless than 10 mins",
    "cookingMins": 10,
    "totalMins": 40
  },
  "serves": "Serves 2-3Serves 2-3",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/caesarsalad_72154_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Calabrian pork ribs": {
  "ingredients": [
    "100ml/3½fl oz olive oil",
    "2 tbsp red wine vinegar",
    "4 medium hot red chillies, deseeded, roughly chopped",
    "½ red pepper, deseeded roughly chopped",
    "1 head garlic, cloves peeled, roughly chopped",
    "few sprigs fresh thyme",
    "few sprigs fresh rosemary",
    "1 tsp dried oregano",
    "½ tsp dried red chilli flakes",
    "1 rack pork ribs, in one piece, around 1.5–2kg/3lb 5oz–4lb 8oz",
    "salt and freshly ground black pepper",
    "lemon wedges",
    "200g/7oz quick-cook polenta"
  ],
  "method": [
    "Preheat the oven to 140C/Fan 120C/Gas 1.",
    "Put all the ingredients, except the pork, into a blender and blend until fairly smooth. ",
    "Line a roasting tin with foil, making sure there is enough foil hanging over the sides to fold into a parcel. Place the pork on top of the foil and pour over the marinade, turning over to make sure it is completely covered. ",
    "Bring the foil together to make a parcel then put in the oven. Bake for between 2–3 hours, making sure you check after 2 hours – the meat should be cooked through and tender but nowhere near falling off the bone.",
    "Cook the polenta according to packet instructions and season well. ",
    "Remove from the oven and transfer to a chopping board. Pouring off any cooking juices and transfer to a small saucepan. When the ribs are cool enough to handle, cut into individual ribs – it is easier to follow the bone by turning bone side up. ",
    "To finish cooking, either prepare a barbecue, preheat your grill or heat a griddle pan until it is too hot to hold your hand over. Grill or griddle the ribs until well browned and nicely charred in places – this should take 3–4 minutes on each side.",
    "Reheat the pan juices and serve on the side with the ribs, along with lemon wedges and polenta."
  ],
  "url": "www_bbc_com_food_recipes_calabrian_pork_ribs_75821",
  "title": "Calabrian pork ribs",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "over 2 hoursover 2 hours",
    "cookingMins": 120,
    "totalMins": 150
  },
  "serves": "Serves 4–6Serves 4–6",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/calabrian_pork_ribs_75821_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Cappuccino crème brûlées": {
  "ingredients": [
    "butter, for greasing",
    "4 large free-range egg yolks",
    "45g/1½oz caster sugar",
    "½ tsp vanilla extract",
    "300ml/10fl oz single cream",
    "300ml/10fl oz double cream",
    "2½ tsp instant coffee granules",
    "100g/3½oz caster sugar, for the caramel topping"
  ],
  "method": [
    "Preheat the oven to 160C/140C Fan/Gas 3. Lightly grease 6 x 150ml/5fl oz heatproof ramekins with butter. Break the egg yolks into a large bowl, tip in the caster sugar and vanilla, and mix with a wire whisk to combine.",
    "Put both the creams in a medium pan and heat until scalding. Remove from the heat and stir in the coffee until it dissolves, then leave the mixture to cool slightly for about 2 minutes. Pour the cream mixture into the egg yolk mixture and stir thoroughly to combine. Strain the custard and pour it into the prepared ramekins. ",
    "Stand the ramekins in a roasting tin and pour hot water into the tin until it comes halfway up the sides of the ramekins. Bake for 25-30 minutes, then remove the ramekins from the roasting tin and leave to cool. Cover and chill in the fridge overnight (or up to 2 days ahead). ",
    "Put the caster sugar for the caramel in a stainless steel pan and add water to dampen. Place over a medium heat and stir until the sugar has dissolved (CAUTION: boiling sugar is very hot. Take care not to burn yourself). Once dissolved, turn the heat up high and cook until the caramel has turned a very pale straw colour. Pour the caramel onto non-stick paper, and allow to cool completely. Once cool, blitz the caramel in a food processor until very fine. Sprinkle the caramel sugar evenly over the cooled custard.",
    "Preheat the grill to high. Put the ramekins as close to the grill as possible and grill for about 4-5 minutes. Be careful not to burn the sugar or grill for too long otherwise you will overcook the softly set custard."
  ],
  "url": "www_bbc_com_food_recipes_cappucino_crme_brles_08725",
  "title": "Cappuccino crème brûlées",
  "time": {
    "preparation": "overnightovernight",
    "preparationMins": 720,
    "cooking": "30 mins to 1 hour30 mins to 1 hour",
    "cookingMins": 60,
    "totalMins": 780
  },
  "serves": "Serves 6Serves 6",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cappucino_crme_brles_08725_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Carrot and ginger soup": {
  "ingredients": [
    "1 tsp rapeseed oil",
    "1 small onion (75g/2½oz peeled weight), finely chopped ",
    "1 garlic clove, finely chopped",
    "20g/¾oz fresh root ginger, peeled and finely chopped ",
    "200g/7oz carrots, roughly chopped",
    "300ml/10fl oz vegetable stock",
    "freshly ground black pepper",
    "1 spring onion, finely chopped, to serve"
  ],
  "method": [
    "Heat the oil in small saucepan over a medium heat. Add the onion and cook for 2–3 minutes. Add the garlic, ginger and carrots and cook for 5 minutes, stirring occasionally. ",
    "Add the stock and season with pepper to taste. Bring to the boil, then reduce the heat, cover and simmer for 20 minutes, or until the carrots are soft.",
    "Pour the soup into a food processor and blend until smooth. Return to the pan and reheat gently. ",
    "To serve, pour the soup into a warm serving bowl and garnish with the spring onions. "
  ],
  "url": "www_bbc_com_food_recipes_carrot_and_ginger_soup_64093",
  "title": "Carrot and ginger soup",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 1Serves 1",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_and_ginger_soup_64093_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Carrot, parmesan and chilli fries": {
  "ingredients": [
    "2 large carrots, trimmed, cut into long, thin batons (these should resemble French fries in size and shape)",
    "salt, to taste",
    "50g/2oz ground almonds                      ",
    "30g/1¼oz parmesan, grated                                   ",
    "1⁄2 tsp dried oregano ",
    "small pinch cayenne pepper",
    "1 free-range egg, beaten "
  ],
  "method": [
    "Preheat the oven to 250C/220C Fan/Gas 9.",
    "Season the carrot batons with salt.",
    "In a large bowl, mix together the ground almonds, parmesan, oregano and cayenne pepper until well combined.",
    "Dip each baton into the beaten egg, then dredge in the herb-and-spice mixture until evenly coated.",
    "Arrange the carrot fries in a single layer on a baking tray. Bake for 10-12 minutes, turning during cooking, until tender and golden-brown all over. Serve hot.  "
  ],
  "url": "www_bbc_com_food_recipes_carrot_parmesan_and_88443",
  "title": "Carrot, parmesan and chilli fries",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 2Serves 2",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/carrot_parmesan_and_88443_16x9.jpg",
  "isVegetarian": true,
  "recommendations": 0
},

"Cauliflower and chorizo risotto with seared squid": {
  "ingredients": [
    "200g/7oz chorizo, finely diced",
    "50g/2oz butter",
    "2 tbsp olive oil",
    "1 onion, finely chopped",
    "1 garlic clove, finely chopped",
    "250g/9oz Arborio rice, or other Italian risotto rice",
    "150ml/5fl oz dry white wine",
    "1 litre/1¾ pint chicken stock",
    "1 cauliflower head, cut into small florets",
    "25g/1oz parmesan cheese, grated (or alternative vegetarian hard cheese)",
    "3 medium squid, cleaned, cut into triangles",
    "½ lemon, juice only",
    "4 tbsp parsley cress, to serve",
    "4 tbsp red amaranth cress, to serve"
  ],
  "method": [
    "Heat a frying pan until hot and dry fry the chorizo over a medium heat until the oils are released and the chorizo is just crisp. Add half the butter,  the olive oil, onion and garlic and fry for 2–3 minutes, or until softened.",
    "Stir in the risotto rice until well coated in the pan juices and cook for 1–2 minutes, or until the rice grains start to turn translucent. Add the wine and cook for 3–4 minutes, or until nearly all of the liquid has evaporated. ",
    "Add a ladleful of the chicken stock to the pan and stir well. Cook for 1–2 minutes, or until nearly all of the stock has been absorbed, then add another ladleful of the stock. Repeat the process until the rice is cooked but still al dente. Add the cauliflower during the last five minutes of cooking. Stir in the parmesan and season, to taste, with salt and black pepper.",
    "Heat another frying pan until hot, add the remaining butter and the squid and cook over a high heat for 1–2 minutes until golden brown and just cooked. Season with salt and black pepper and finish with a squeeze of lemon.",
    "To serve, spoon the risotto into serving bowls, top with the squid and a scattering of cress."
  ],
  "url": "www_bbc_com_food_recipes_cauliflower_and_chorizo_45104",
  "title": "Cauliflower and chorizo risotto with seared squid",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflower_and_chorizo_45104_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Cauliflower cheese with salmon": {
  "ingredients": [
    "1 large cauliflower, cut into florets",
    "50g/2oz butter, plus extra for greasing",
    "50g/2oz plain flour",
    "450ml/16fl oz milk",
    "2 free-range egg yolks",
    "1 tsp English mustard",
    "splash of Worcestershire sauce",
    "salt and black pepper",
    "150g/5oz cooked flaked salmon",
    "125g/4½oz cheddar cheese, grated",
    "75g/3oz emmental cheese, grated"
  ],
  "method": [
    "Preheat oven to 200C/400F/Gas 6.",
    "Bring a large pan of salted water to the boil, then add the cauliflower and cook for two minutes.",
    "Drain and place in a buttered ovenproof dish.",
    "Place the butter and flour into a saucepan and heat to melt the butter.",
    "Cook, stirring for one to two minutes until lightly golden.",
    "Remove from the heat and gradually whisk in the milk to form a smooth sauce.",
    "Return to the heat and simmer for two to three minutes.",
    "Remove from the heat and beat in the egg yolks, mustard and Worcestershire sauce.",
    "Season with salt and pepper and flake the salmon into the sauce, stirring carefully.",
    "Pour over the cauliflower and top with the grated cheeses.",
    "Place in the oven and cook for 10-15 minutes, until golden brown. Serve immediately."
  ],
  "url": "www_bbc_com_food_recipes_cauliflowercheesewit_83926",
  "title": "Cauliflower cheese with salmon",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "30 mins to 1 hour30 mins to 1 hour",
    "cookingMins": 60,
    "totalMins": 90
  },
  "serves": "Serves 4Serves 4",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/cauliflowercheesewit_83926_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
},

"Celery baked in vinaigrette with pancetta and shallots": {
  "ingredients": [
    "1 head celery",
    "6 shallots, peeled (and split if the bulbs are dividing)",
    "1 or 2 thyme sprigs",
    "1 rosemary sprig",
    "4 sage leaves",
    "3 slices pancetta or smoked steaky bacon",
    "3 tbsp light olive oil",
    "1 dessertspoon white wine vinegar",
    "salt and freshly milled black pepper"
  ],
  "method": [
    "Preheat the oven to 240C/475F/Gas 9.",
    "Begin by removing the tough outer layers of the celery, then pare the outside of the root off, but leave it attached. Now cut across the celery about 9cm/3½in from the base. Stand the lower half upright and cut vertically through the centre. Then cut each half into 4 to make 8 pieces, keeping them attached to the root. Save a couple of nice leaves (preferably attached to a small stem) and trim the top pieces of celery to a similar length to the base, cutting off any really tough and stringy edges. Now wash all the pieces and dry them on kitchen paper.",
    "Next heat one tablespoon of the oil in a frying pan, then lightly brown the celery and shallots, keeping them on the move so they brown evenly. Now transfer them to a plate. Increase the heat under the pan, add the pancetta and fry the slices until they're really crisp - it will take 2-3 minutes and you'll need to keep turning them.",
    "Next lay the silicone paper over the baking tray and lightly grease a circle of 23cm/9in on it. Arrange the celery in an attractive shape on the paper, putting the prettiest pieces on the top, add the shallots, thyme, rosemary and sage leaves in among it, and season with salt and pepper.",
    "Now combine the remaining olive oil and wine vinegar, sprinkle that over the vegetables, followed by the pancetta crumbled into pieces with your hands. Next fold the silicone paper over and seal, making pleats, all round - you may find a couple of metal (not plastic) paper clips useful here, as it's essential to keep the steam trapped inside. Place the parcel in the pre-heated oven for 20-25 minutes.",
    "After that carefully unwrap the paper - you may need scissors - and serve the vegetables with the juices spooned over."
  ],
  "url": "www_bbc_com_food_recipes_celerybakedinvinaigr_67190",
  "title": "Celery baked in vinaigrette with pancetta and shallots",
  "time": {
    "preparation": "less than 30 minsless than 30 mins",
    "preparationMins": 30,
    "cooking": "10 to 30 mins10 to 30 mins",
    "cookingMins": 30,
    "totalMins": 60
  },
  "serves": "Serves 2Serves 2",
  "image": "https://ichef.bbci.co.uk/food/ic/food_16x9_448/recipes/celerybakedinvinaigr_67190_16x9.jpg",
  "isVegetarian": false,
  "recommendations": 0
}

}
